<?xml version="1.0" ?>
<dataset id="dbpedia-train">

<question aggregation="true" answertype="string" id="67" onlydbo="false">
<string><![CDATA[
Give me the websites of companies with more than 500000 employees.
]]></string>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?string 
WHERE {
	?subject rdf:type dbo:Company .
	?subject dbp:numEmployees ?employees .
	FILTER( xsd:integer(?employees) > 500000 ) .
	?subject foaf:homepage ?string .
}
]]></query>
<keywords><![CDATA[
website, company, more than 500000, employee
]]></keywords>
<answers>
<answer>
<uri>
http://www.indiapost.gov.in/
</uri>
</answer>
<answer>
<uri>
http://www.issworld.com/
</uri>
</answer>
<answer>
<uri>
http://www.petrochina.com.cn/ptr/
</uri>
</answer>
<answer>
<uri>
http://www.usps.com/
</uri>
</answer>
<answer>
<uri>
http://www.g4s.com/
</uri>
</answer>
<answer>
<uri>
http://www.foxconn.com/
</uri>
</answer>
<answer>
<uri>
http://www.sgcc.com.cn/ywlm/default.shtml
</uri>
</answer>
<answer>
<uri>
http://www.cnpc.com.cn/en/
</uri>
</answer>
<answer>
<uri>
http://www.dsv.com/
</uri>
</answer>
<answer>
<uri>
http://www.dbs.com.hk/
</uri>
</answer>
<answer>
<uri>
http://www.danda.co.uk/
</uri>
</answer>
<answer>
<uri>
http://www.rotorooter.com/
</uri>
</answer>
<answer>
<uri>
http://qt.nokia.com/
</uri>
</answer>
<answer>
<uri>
http://www.safeco.com/
</uri>
</answer>
<answer>
<uri>
http://www.trands.com
</uri>
</answer>
<answer>
<uri>
http://www.asx.com.au/
</uri>
</answer>
<answer>
<uri>
http://www.asx.com.au
</uri>
</answer>
<answer>
<uri>
http://www.primemedia.com.au/
</uri>
</answer>
<answer>
<uri>
http://www.budgetinsurance.com/
</uri>
</answer>
<answer>
<uri>
http://www.bodyglove.com
</uri>
</answer>
<answer>
<uri>
http://www.lumene.com/
</uri>
</answer>
<answer>
<uri>
http://www.vailresorts.com/
</uri>
</answer>
<answer>
<uri>
http://www.idleaire.com/
</uri>
</answer>
<answer>
<uri>
http://www.caliperls.com
</uri>
</answer>
<answer>
<uri>
http://www.pbinsight.com/
</uri>
</answer>
<answer>
<uri>
http://www.intrawest.com/
</uri>
</answer>
<answer>
<uri>
http://www.steaknshake.com
</uri>
</answer>
<answer>
<uri>
http://www.amylin.com
</uri>
</answer>
<answer>
<uri>
http://www.coleman.com/
</uri>
</answer>
<answer>
<uri>
http://www.buffet.com/
</uri>
</answer>
<answer>
<uri>
http://bashas.com/
</uri>
</answer>
<answer>
<uri>
http://www.olamonline.com/
</uri>
</answer>
<answer>
<uri>
http://www.ceridian.com/
</uri>
</answer>
<answer>
<uri>
http://www.dpworld.com/
</uri>
</answer>
<answer>
<uri>
http://www.ulalaunch.com
</uri>
</answer>
<answer>
<uri>
http://www.vivacom.bg
</uri>
</answer>
<answer>
<uri>
http://www.tollbrothers.com/
</uri>
</answer>
<answer>
<uri>
https://www.firstmarkcu.org
</uri>
</answer>
<answer>
<uri>
http://www.qbp.com/
</uri>
</answer>
<answer>
<uri>
http://www.cyta.com.cy/
</uri>
</answer>
<answer>
<uri>
http://www.usec.com
</uri>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="84" onlydbo="true">
<string><![CDATA[
Give me all movies with Tom Cruise.
]]></string>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type dbo:Film.
	?uri dbo:starring res:Tom_Cruise .
	OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
<keywords><![CDATA[
Tom Cruise, movie
]]></keywords>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Eyes_Wide_Shut
</uri>
<string><![CDATA[
Eyes Wide Shut
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Vanilla_Sky
</uri>
<string><![CDATA[
Vanilla Sky
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Rain_Man
</uri>
<string><![CDATA[
Rain Man
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Minority_Report_%28film%29
</uri>
<string><![CDATA[
Minority Report (film)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Jerry_Maguire
</uri>
<string><![CDATA[
Jerry Maguire
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/The_Color_of_Money
</uri>
<string><![CDATA[
The Color of Money
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Top_Gun
</uri>
<string><![CDATA[
Top Gun
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/The_Last_Samurai
</uri>
<string><![CDATA[
The Last Samurai
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Magnolia_%28film%29
</uri>
<string><![CDATA[
Magnolia (film)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/The_Firm_%281993_film%29
</uri>
<string><![CDATA[
The Firm (1993 film)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/War_of_the_Worlds_%282005_film%29
</uri>
<string><![CDATA[
War of the Worlds (2005 film)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Risky_Business
</uri>
<string><![CDATA[
Risky Business
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Cocktail_%281988_film%29
</uri>
<string><![CDATA[
Cocktail (1988 film)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Days_of_Thunder
</uri>
<string><![CDATA[
Days of Thunder
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Far_and_Away
</uri>
<string><![CDATA[
Far and Away
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Mission:_Impossible_%28film%29
</uri>
<string><![CDATA[
Mission: Impossible (film)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Collateral_%28film%29
</uri>
<string><![CDATA[
Collateral (film)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Legend_%28film%29
</uri>
<string><![CDATA[
Legend (film)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Mission:_Impossible_III
</uri>
<string><![CDATA[
Mission: Impossible III
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Losin%27_It
</uri>
<string><![CDATA[
Losin' It
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/All_the_Right_Moves
</uri>
<string><![CDATA[
All the Right Moves
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/The_Outsiders_%28film%29
</uri>
<string><![CDATA[
The Outsiders (film)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Interview_with_the_Vampire:_The_Vampire_Chronicles
</uri>
<string><![CDATA[
Interview with the Vampire: The Vampire Chronicles
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Born_on_the_Fourth_of_July_%28film%29
</uri>
<string><![CDATA[
Born on the Fourth of July (film)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Lions_for_Lambs
</uri>
<string><![CDATA[
Lions for Lambs
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Valkyrie_%28film%29
</uri>
<string><![CDATA[
Valkyrie (film)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Mission:_Impossible_%28film_series%29
</uri>
<string><![CDATA[
Mission: Impossible (film series)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Mission:_Impossible_%E2%80%93_Ghost_Protocol
</uri>
<string><![CDATA[
Mission: Impossible – Ghost Protocol
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/A_Few_Good_Men
</uri>
<string><![CDATA[
A Few Good Men
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Taps_%28film%29
</uri>
<string><![CDATA[
Taps (film)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Rock_of_Ages_%28film%29
</uri>
<string><![CDATA[
Rock of Ages (film)
]]></string>
</answer>
</answers>
</question>

<question aggregation="true" answertype="resource" id="17" onlydbo="false">
<string><![CDATA[
Give me all cities in New Jersey with more than 100000 inhabitants.
]]></string>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type dbo:City .
        ?uri dbo:isPartOf res:New_Jersey .
        ?uri dbp:populationTotal ?inhabitants .
        FILTER (?inhabitants > 100000) .
        OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') }
}
]]></query>
<keywords><![CDATA[
New Jersey, city, inhabitants, more than 100000
]]></keywords>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Newark,_New_Jersey
</uri>
<string><![CDATA[
Newark, New Jersey
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Paterson,_New_Jersey
</uri>
<string><![CDATA[
Paterson, New Jersey
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Jersey_City,_New_Jersey
</uri>
<string><![CDATA[
Jersey City, New Jersey
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Elizabeth,_New_Jersey
</uri>
<string><![CDATA[
Elizabeth, New Jersey
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="63" onlydbo="true">
<string><![CDATA[
Give me all actors starring in Batman Begins.
]]></string>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	res:Batman_Begins dbo:starring ?uri .
	OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } 
}
]]></query>
<keywords><![CDATA[
Batman Begins, actor, starring
]]></keywords>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Morgan_Freeman
</uri>
<string><![CDATA[
Morgan Freeman
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Michael_Caine
</uri>
<string><![CDATA[
Michael Caine
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Liam_Neeson
</uri>
<string><![CDATA[
Liam Neeson
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Gary_Oldman
</uri>
<string><![CDATA[
Gary Oldman
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Christian_Bale
</uri>
<string><![CDATA[
Christian Bale
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Cillian_Murphy
</uri>
<string><![CDATA[
Cillian Murphy
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Katie_Holmes
</uri>
<string><![CDATA[
Katie Holmes
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="15" onlydbo="true">
<string><![CDATA[
Who created Goofy?
]]></string>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
        res:Goofy dbo:creator ?uri .
        OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') }
}
]]></query>
<keywords><![CDATA[
created, Goofy
]]></keywords>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Art_Babbitt
</uri>
<string><![CDATA[
Art Babbitt
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="86" onlydbo="false">
<string><![CDATA[
Give me all female German chancellors.
]]></string>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type yago:FemaleHeadsOfGovernment.
        ?uri dbp:office res:Chancellor_of_Germany .
        OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
<keywords><![CDATA[
German chancellor, female
]]></keywords>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Angela_Merkel
</uri>
<string><![CDATA[
Angela Merkel
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="71" onlydbo="false">
<string><![CDATA[
Give me all video games published by Mean Hamster Software.
]]></string>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
      ?uri rdf:type dbo:VideoGame .
      { ?uri dbp:publisher 'Mean Hamster Software'@en . }
      UNION 
      { ?uri dbo:publisher res:Mean_Hamster_Software . }
      OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
<keywords><![CDATA[
Mean Hamster Software, video game, publish
]]></keywords>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Riven
</uri>
<string><![CDATA[
Riven
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Myst
</uri>
<string><![CDATA[
Myst
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Crossbow_%28video_game%29
</uri>
<string><![CDATA[
Crossbow (video game)
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="date" id="2" onlydbo="true">
<string><![CDATA[
Give me the birthdays of all actors of the television show Charmed.
]]></string>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE { 
	res:Charmed dbo:starring ?actor .
        ?actor dbo:birthDate ?date .
}
]]></query>
<keywords><![CDATA[
birthday, actor, television show, Charmed
]]></keywords>
<answers>
<answer>
<date>
1968-07-27
</date>
</answer>
<answer>
<date>
1973-12-03
</date>
</answer>
<answer>
<date>
1972-12-19
</date>
</answer>
<answer>
<date>
1985-11-30
</date>
</answer>
<answer>
<date>
1973-06-15
</date>
</answer>
<answer>
<date>
1965-10-01
</date>
</answer>
<answer>
<date>
1969-02-08
</date>
</answer>
<answer>
<date>
1980-05-19
</date>
</answer>
<answer>
<date>
1971-01-26
</date>
</answer>
<answer>
<date>
1973-09-05
</date>
</answer>
<answer>
<date>
1971-04-12
</date>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="80" onlydbo="true">
<string><![CDATA[
Give me all Canadian Grunge record labels.
]]></string>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type dbo:RecordLabel .
        ?uri dbo:genre res:Grunge .
        ?uri dbo:country res:Canada .
        OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } 
}
]]></query>
<keywords><![CDATA[
record label, Canadian, Grunge
]]></keywords>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Murderecords
</uri>
<string><![CDATA[
Murderecords
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="73" onlydbo="true">
<string><![CDATA[
Who owns Aldi?
]]></string>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	res:Aldi dbo:keyPerson ?uri .
	OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
<keywords><![CDATA[
own, Aldi
]]></keywords>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Karl_Albrecht
</uri>
<string><![CDATA[
Karl Albrecht
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Theo_Albrecht
</uri>
<string><![CDATA[
Theo Albrecht
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="string" id="48" onlydbo="false">
<string><![CDATA[
Give me the homepage of Forbes.
]]></string>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?string 
WHERE {
	res:Forbes foaf:homepage ?string .
}
]]></query>
<keywords><![CDATA[
Forbes, homepage
]]></keywords>
<answers>
<answer>
<uri>
http://www.forbes.com
</uri>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="57" onlydbo="true">
<string><![CDATA[
List all episodes of the first season of the HBO television series The Sopranos!
]]></string>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri dbo:series res:The_Sopranos  .
        ?uri dbo:seasonNumber 1 .
	OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
<keywords><![CDATA[
HBO, television series, Sopranos, first season, list, episode
]]></keywords>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/The_Sopranos_%28episode%29
</uri>
<string><![CDATA[
The Sopranos (episode)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/46_Long
</uri>
<string><![CDATA[
46 Long
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti
</uri>
<string><![CDATA[
The Legend of Tennessee Moltisanti
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Denial,_Anger,_Acceptance
</uri>
<string><![CDATA[
Denial, Anger, Acceptance
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Meadowlands_%28The_Sopranos%29
</uri>
<string><![CDATA[
Meadowlands (The Sopranos)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/College_%28The_Sopranos%29
</uri>
<string><![CDATA[
College (The Sopranos)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Pax_Soprana
</uri>
<string><![CDATA[
Pax Soprana
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Boca_%28The_Sopranos%29
</uri>
<string><![CDATA[
Boca (The Sopranos)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Down_Neck
</uri>
<string><![CDATA[
Down Neck
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/A_Hit_Is_a_Hit
</uri>
<string><![CDATA[
A Hit Is a Hit
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano
</uri>
<string><![CDATA[
I Dream of Jeannie Cusamano
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Isabella_%28The_Sopranos%29
</uri>
<string><![CDATA[
Isabella (The Sopranos)
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Nobody_Knows_Anything
</uri>
<string><![CDATA[
Nobody Knows Anything
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="1" onlydbo="false">
<string><![CDATA[
Give me all female Russian astronauts.
]]></string>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type yago:RussianCosmonauts .
        ?uri rdf:type yago:FemaleAstronauts .
        OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') }
}
]]></query>
<keywords><![CDATA[
astronaut, female, Russian
]]></keywords>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Valentina_Tereshkova
</uri>
<string><![CDATA[
Valentina Tereshkova
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Yelena_Kondakova
</uri>
<string><![CDATA[
Yelena Kondakova
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Yelena_Serova
</uri>
<string><![CDATA[
Yelena Serova
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="89" onlydbo="true">
<string><![CDATA[
Give me all soccer clubs in the Premier League.
]]></string>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE { 
   ?uri dbo:league res:Premier_League . 
   OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
<keywords><![CDATA[
Premier League, soccer club
]]></keywords>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Arsenal_F.C.
</uri>
<string><![CDATA[
Arsenal F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Fulham_F.C.
</uri>
<string><![CDATA[
Fulham F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Chelsea_F.C.
</uri>
<string><![CDATA[
Chelsea F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Liverpool_F.C.
</uri>
<string><![CDATA[
Liverpool F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Manchester_United_F.C.
</uri>
<string><![CDATA[
Manchester United F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/West_Bromwich_Albion_F.C.
</uri>
<string><![CDATA[
West Bromwich Albion F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Aston_Villa_F.C.
</uri>
<string><![CDATA[
Aston Villa F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Newcastle_United_F.C.
</uri>
<string><![CDATA[
Newcastle United F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Tottenham_Hotspur_F.C.
</uri>
<string><![CDATA[
Tottenham Hotspur F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Queens_Park_Rangers_F.C.
</uri>
<string><![CDATA[
Queens Park Rangers F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Everton_F.C.
</uri>
<string><![CDATA[
Everton F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Manchester_City_F.C.
</uri>
<string><![CDATA[
Manchester City F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Sunderland_A.F.C.
</uri>
<string><![CDATA[
Sunderland A.F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Stoke_City_F.C.
</uri>
<string><![CDATA[
Stoke City F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Wolverhampton_Wanderers_F.C.
</uri>
<string><![CDATA[
Wolverhampton Wanderers F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Norwich_City_F.C.
</uri>
<string><![CDATA[
Norwich City F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Blackburn_Rovers_F.C.
</uri>
<string><![CDATA[
Blackburn Rovers F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Bolton_Wanderers_F.C.
</uri>
<string><![CDATA[
Bolton Wanderers F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Wigan_Athletic_F.C.
</uri>
<string><![CDATA[
Wigan Athletic F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Swansea_City_A.F.C.
</uri>
<string><![CDATA[
Swansea City A.F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Melchester_Rovers
</uri>
<string><![CDATA[
Melchester Rovers
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Harchester_United_F.C.
</uri>
<string><![CDATA[
Harchester United F.C.
]]></string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Botswana_Defence_Force_XI_FC
</uri>
<string><![CDATA[
Botswana Defence Force XI FC
]]></string>
</answer>
</answers>
</question>

