<?xml version="1.0" ?>
<dataset id="dbpedia-train">

<question id="1" answertype="resource" aggregation="false" onlydbo="false">
<string><![CDATA[
Give me all female Russian astronauts.
]]></string>
<keywords><![CDATA[ 
astronaut, female, Russian
]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type yago:RussianCosmonauts .
        ?uri rdf:type yago:FemaleAstronauts .
        OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="15" answertype="resource" aggregation="false" onlydbo="true">
<string><![CDATA[
Who created Goofy?
]]></string>
<keywords><![CDATA[ 
created, Goofy
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
        res:Goofy dbo:creator ?uri .
        OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="16" answertype="resource" aggregation="false" onlydbo="false">
<string><![CDATA[
Give me the capitals of all countries in Africa.
]]></string>
<keywords><![CDATA[ 
Africa, country, capital
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string
WHERE { 
	?states rdf:type yago:AfricanCountries .
        ?states dbo:capital ?uri .
        OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="41" answertype="resource" aggregation="false" onlydbo="false">
<string><![CDATA[
Give me all soccer clubs in Spain.
]]></string>
<keywords><![CDATA[ 
Spain, soccer club
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type dbo:SoccerClub .
        { ?uri dbo:ground res:Spain . }
        UNION 
        { ?uri dbp:ground ?ground . FILTER (regex(?ground, 'Spain')) }
        OPTIONAL {?uri rdfs:label ?string. FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="48" answertype="string" aggregation="false" onlydbo="false">
<string><![CDATA[
Give me the homepage of Forbes.
]]></string>
<keywords><![CDATA[ 
Forbes, homepage
]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?string 
WHERE {
	res:Forbes foaf:homepage ?string .
}
]]></query>
</question>

<question id="49" answertype="resource" aggregation="false" onlydbo="false">
<string><![CDATA[
Give me all companies in the advertising industry.
]]></string>
<keywords><![CDATA[ 
advertising industry, company
]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE { 
	?uri rdf:type dbo:Company  .
        ?uri dbp:industry ?industry .
        FILTER regex(?industry,'advertising','i') .
        OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="51" answertype="resource" aggregation="false" onlydbo="false">
<string><![CDATA[
Give me all school types.
]]></string>
<keywords><![CDATA[ 
school type
]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE { 
	?uri rdf:type yago:SchoolTypes .
        OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="53" answertype="resource" aggregation="false" onlydbo="false">
<string><![CDATA[
Give me all presidents of the United States.
]]></string>
<keywords><![CDATA[ 
United States, president
]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
        ?uri rdf:type dbo:Person .
        { ?uri rdf:type yago:PresidentsOfTheUnitedStates. }
        UNION
        { ?uri rdf:type dbo:President.
          ?uri dbp:title res:President_of_the_United_States. }
        ?uri rdfs:label ?string. 
        FILTER (lang(?string) = 'en' && !regex(?string,'Presidency','i') && !regex(?string,'and the')) .
}
]]></query>
</question>

<question id="57" answertype="resource" aggregation="false" onlydbo="true">
<string><![CDATA[
List all episodes of the first season of the HBO television series The Sopranos!
]]></string>
<keywords><![CDATA[ 
HBO, television series, Sopranos, first season, list, episode
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri dbo:series res:The_Sopranos  .
        ?uri dbo:seasonNumber 1 .
	OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="59" answertype="resource" aggregation="false" onlydbo="false">
<string><![CDATA[
Give me all people with first name Jimmy.
]]></string>
<keywords><![CDATA[ 
person, first name, Jimmy
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type foaf:Person.       
        ?uri foaf:givenName 'Jimmy'@en   .
        OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="63" answertype="resource" aggregation="false" onlydbo="true">
<string><![CDATA[
Give me all actors starring in Batman Begins.
]]></string>
<keywords><![CDATA[ 
Batman Begins, actor, starring
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	res:Batman_Begins dbo:starring ?uri .
	OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } 
}
]]></query>
</question>

<question id="70" answertype="resource" aggregation="false" onlydbo="true">
<string><![CDATA[
Give me all films produced by Hal Roach.
]]></string>
<keywords><![CDATA[ 
Hal Roach, film, produce
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type dbo:Film .
        ?uri dbo:producer res:Hal_Roach .
	OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="73" answertype="resource" aggregation="false" onlydbo="true">
<string><![CDATA[
Who owns Aldi?
]]></string>
<keywords><![CDATA[ 
own, Aldi
]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	res:Aldi dbo:keyPerson ?uri .
	OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="78" answertype="resource" aggregation="false" onlydbo="true">
<string><![CDATA[
Give me all books written by Danielle Steel.
]]></string>
<keywords><![CDATA[ 
Danielle Steel, book, written
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type dbo:Book .
        ?uri dbo:author res:Danielle_Steel .
	OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="80" answertype="resource" aggregation="false" onlydbo="true">
<string><![CDATA[
Give me all Canadian Grunge record labels.
]]></string>
<keywords><![CDATA[ 
record label, Canadian, Grunge
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type dbo:RecordLabel .
        ?uri dbo:genre res:Grunge .
        ?uri dbo:country res:Canada .
        OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } 
}
]]></query>
</question>

<question id="84" answertype="resource" aggregation="false" onlydbo="true">
<string><![CDATA[
Give me all movies with Tom Cruise.
]]></string>
<keywords><![CDATA[ 
Tom Cruise, movie
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type dbo:Film.
	?uri dbo:starring res:Tom_Cruise .
	OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="86" answertype="resource" aggregation="false" onlydbo="false">
<string><![CDATA[
Give me all female German chancellors.
]]></string>
<keywords><![CDATA[ 
German chancellor, female
]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type yago:FemaleHeadsOfGovernment.
        ?uri dbp:office res:Chancellor_of_Germany .
        OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="89" answertype="resource" aggregation="false" onlydbo="true">
<string><![CDATA[
Give me all soccer clubs in the Premier League.
]]></string>
<keywords><![CDATA[ 
Premier League, soccer club
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri ?string 
WHERE { 
   ?uri dbo:league res:Premier_League . 
   OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

