<?xml version="1.0" encoding="UTF-8"?>
<dataset id="musicbrainz-train">

<question id="6" answertype="resource" aggregation="true">
<string><![CDATA[
Which artists have their 50th birthday on May 30, 2012?
]]></string>
<keywords><![CDATA[ 
50th birthday, artist, 2011-05-30
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist ?artistname 
WHERE {
  ?artist foaf:name ?artistname .
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date "1962-05-30"^^xsd:dateTime .
}
]]></query>
</question>

<question id="7" answertype="resource" aggregation="true">
<string><![CDATA[
Give me the present members of The Cure.
]]></string>
<keywords><![CDATA[ 
The Cure, present member
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX event: <http://purl.org/NET/c4dm/event.owl#>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?member ?name
WHERE { 
  ?band foaf:name 'The Cure' .
  ?member foaf:name ?name .
  ?event rdf:type mo:membership .
  ?event event:agent ?member .
  ?event mo:group ?band .
  OPTIONAL {
    ?event event:time ?time .
    ?time tl:end ?enddate .
  }
  FILTER (!bound(?enddate))
}
]]></query>
</question>

<question id="8" answertype="resource" aggregation="false">
<string><![CDATA[
Give me all Kraftwerk albums!
]]></string>
<keywords><![CDATA[ 
Kraftwerk, album
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album ?albumtitle 
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:album .
  ?album dc:title ?albumtitle .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Kraftwerk' .
}
]]></query>
</question>

<question id="13" answertype="resource" aggregation="false">
<string><![CDATA[
Which artists were born on the 29th of December 1960?
]]></string>
<keywords><![CDATA[ 
artist, born, 1960-12-29
]]></keywords>
<query><![CDATA[
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist ?name
WHERE {
  ?artist rdf:type mo:SoloMusicArtist .
  ?artist foaf:name ?name .
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date "1960-12-29"^^xsd:dateTime .
}
]]></query>
</question>

<question id="15" answertype="resource" aggregation="false">
<string><![CDATA[
Give me all albums with the BBC Symphony Orchestra.
]]></string>
<keywords><![CDATA[ 
BBC Symphony Orchestra, album
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album ?title
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:performingOrchestra ?orchestra .
  ?orchestra foaf:name 'BBC Symphony Orchestra' .
  ?album dc:title ?title .
}
]]></query>
</question>

<question id="16" answertype="resource" aggregation="false">
<string><![CDATA[
Give me all bands that Michael Stipe is a member of.
]]></string>
<keywords><![CDATA[ 
Michael Stipe, member, band
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?band ?bandname
WHERE { 
 ?artist foaf:name 'Michael Stipe' .
 ?artist mo:member_of ?band .
 ?band foaf:name ?bandname .
}
]]></query>
</question>

<question id="18" answertype="resource" aggregation="false">
<string><![CDATA[
Give me all live albums by Michael Jackson.
]]></string>
<keywords><![CDATA[ 
Michael Jackson, live album
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album ?title
WHERE {
  ?album rdf:type mo:Record . 
  ?album mo:release_type mo:live .
  ?album dc:title ?title .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Michael Jackson' .
}
]]></query>
</question>

<question id="21" answertype="date" aggregation="false">
<string><![CDATA[
When did Kurt Cobain join Nirvana?
]]></string>
<keywords><![CDATA[ 
Kurt Cobain, join, Nirvana
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX event: <http://purl.org/NET/c4dm/event.owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?begindate
WHERE {
  ?artist foaf:name 'Kurt Cobain' .
  ?band foaf:name 'Nirvana' .
  ?event rdf:type mo:membership .
  ?event event:agent ?artist .
  ?event mo:group ?band .
  ?event event:time ?time .
  ?time tl:start ?begindate .
}
]]></query>
</question>

<question id="22" answertype="resource" aggregation="false">
<string><![CDATA[
Give me all songs by Aretha Franklin.
]]></string>
<keywords><![CDATA[ 
Aretha Franklin, song
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?track ?title 
WHERE {
  ?artist foaf:name 'Aretha Franklin' .
  ?track foaf:maker ?artist .
  ?track rdf:type mo:Track .
  ?track dc:title ?title .
}
]]></query>
</question>

<question id="29" answertype="resource" aggregation="false">
<string><![CDATA[
Give me all people who were members of The Beatles.
]]></string>
<keywords><![CDATA[ 
person, member, The Beatles
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?artist ?name
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Beatles' .
  ?artist foaf:name ?name .
}
]]></query>
</question>

<question id="32" answertype="resource" aggregation="true">
<string><![CDATA[
Which artists died on the same day as Elvis?
]]></string>
<keywords><![CDATA[ 
artist, die, same day, Elvis
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist_2 ?artist_2_name
WHERE {
  ?artist foaf:name 'Elvis Presley' .
  ?artist bio:event ?event .
  ?event rdf:type bio:Death .
  ?event bio:date ?date . 
  ?artist_2 rdf:type mo:SoloMusicArtist .
  ?artist_2 foaf:name ?artist_2_name .
  ?artist_2 bio:event ?event_2 .
  ?event_2 rdf:type bio:Death .
  ?event_2 bio:date ?date .
  FILTER (!sameTerm(?artist_2,?artist))
}
]]></query>
</question>

<question id="36" answertype="resource" aggregation="false">
<string><![CDATA[
In which band did Frank Sinatra play?
]]></string>
<keywords><![CDATA[ 
Frank Sinatra, play, band
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?band ?name
WHERE {
  ?artist foaf:name 'Frank Sinatra' .
  ?artist mo:member_of ?band .
  ?band foaf:name ?name .
}
]]></query>
</question>

<question id="37" answertype="resource" aggregation="true">
<string><![CDATA[
Which members of the Beatles are dead?
]]></string>
<keywords><![CDATA[ 
member, The Beatles, dead
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist ?artistname
WHERE {
  ?artist mo:member_of ?band .
  ?artist foaf:name ?artistname .
  ?band foaf:name 'The Beatles' .
  ?artist bio:event ?event .
  ?event rdf:type bio:Death .
  FILTER (bound(?event))
}
]]></query>
</question>

<question id="39" answertype="resource" aggregation="true">
<string><![CDATA[
Give me all former members of the Berliner Philharmoniker.
]]></string>
<keywords><![CDATA[ 
Berliner Philharmoniker, former member
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX event: <http://purl.org/NET/c4dm/event.owl#>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?member ?name
WHERE { 
  ?orchestra foaf:name 'Berliner Philharmoniker' .
  ?member foaf:name ?name .
  ?event rdf:type mo:membership .
  ?event event:agent ?member .
  ?event mo:group ?orchestra .
  ?event event:time ?time .
  ?time tl:end ?enddate .
  FILTER (bound(?enddate))
}
]]></query>
</question>

<question id="40" answertype="resource" aggregation="false">
<string><![CDATA[
Who wrote the song Freeway of Love?
]]></string>
<keywords><![CDATA[ 
write, song, Freeway of Love
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist ?name
WHERE {
  ?track rdf:type mo:Track .
  ?track dc:title 'Freeway of Love' .
  ?track foaf:maker ?artist .
  ?artist foaf:name ?name .
}
]]></query>
</question>

<question id="43" answertype="resource" aggregation="true">
<string><![CDATA[
Give me all Thrash Metal albums.
]]></string>
<keywords><![CDATA[ 
Trash Metal, album
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album ?name
WHERE {
    ?album rdf:type mo:Record .
    ?album dc:description ?tag .
    ?album dc:title ?name .
    FILTER regex(?tag,"thrash metal","i")
}
]]></query>
</question>

<question id="46" answertype="resource" aggregation="false">
<string><![CDATA[
List all members of The Notwist.
]]></string>
<keywords><![CDATA[ 
The Notwist, member
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?artist ?name 
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Notwist' .
  ?artist foaf:name ?name .
}
]]></query>
</question>

<question id="56" answertype="resource" aggregation="false">
<string><![CDATA[
Give me all songs on the album Abbey Road.
]]></string>
<keywords><![CDATA[ 
song, album, Abbey Road
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?track ?title 
WHERE {
  ?album mo:release_type mo:album .
  ?album dc:title 'Abbey Road' .
  ?album mo:track ?track .
  ?track dc:title ?title .
}
]]></query>
</question>

<question id="61" answertype="resource" aggregation="false">
<string><![CDATA[
Give me all members of The Muppets.
]]></string>
<keywords><![CDATA[ 
The Muppets, member
]]></keywords>
<query><![CDATA[
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?artist ?artistname 
WHERE {
  ?band foaf:name 'The Muppets' .
  ?artist mo:member_of ?band.
  ?artist foaf:name ?artistname .
}
]]></query>
</question>
 
<question id="62" answertype="resource" aggregation="false">
<string><![CDATA[
Give me all siblings of Michael Jackson.
]]></string>
<keywords><![CDATA[ 
Michael Jackson, sibling
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist ?artistname 
WHERE {
  ?artist foaf:name ?artistname .
  ?artist_2 foaf:name 'Michael Jackson' .
  ?artist rel:siblingOf ?artist_2 .
}
]]></query>
</question>  
  
<question id="65" answertype="resource" aggregation="false">
<string><![CDATA[
Give me all soundtracks composed by John Williams.
]]></string>
<keywords><![CDATA[ 
soundtrack, compose, John Williams
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?album ?albumname 
WHERE {
  ?album mo:release_type mo:soundtrack .
  ?album mo:composer ?artist .
  ?artist foaf:name 'John Williams' .
  ?album dc:title ?albumname .
}
]]></query>
</question>

<question id="69" answertype="resource" aggregation="false">
<string><![CDATA[
Give me all Celldweller EPs.
]]></string>
<keywords><![CDATA[ 
Celldweller, EP
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?album ?title 
WHERE {
  ?album mo:release_type mo:ep .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Celldweller' .
  ?album dc:title ?title .
}
]]></query>
</question>

<question id="73" answertype="resource" aggregation="false">
<string><![CDATA[
Give me the spouses of all members of The Beatles.
]]></string>
<keywords><![CDATA[ 
member, The Beatles, spouse
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?spouse ?spousename 
WHERE {
  ?band foaf:name 'The Beatles' .
  ?artist mo:member_of ?band .
  ?artist rel:spouseOf ?spouse .
  ?spouse foaf:name ?spousename .
}
]]></query>
</question>

<question id="92" answertype="resource" aggregation="false">
<string><![CDATA[
Give me the collaborations of Shakira.
]]></string>
<keywords><![CDATA[ 
Shakira, collaboration
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist_2 ?artist_2_name
WHERE {
  ?artist foaf:name 'Shakira'  .
  ?artist rel:collaboratesWith ?artist_2 .
  ?artist_2 foaf:name ?artist_2_name .
}
]]></query>
</question>
 
<question id="94" answertype="resource" aggregation="false">
<string><![CDATA[
Give me all audiobooks by Paul Auster.
]]></string>
<keywords><![CDATA[ 
audiobook, Paul Auster
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album ?title
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:audiobook .
  ?album dc:title ?title .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Paul Auster' .
}
]]></query>
</question>
  
<question id="97" answertype="resource" aggregation="true">
<string><![CDATA[
Which members of The Beatles were married more than once?
]]></string>
<keywords><![CDATA[ 
The Beatles, member, married, more than once
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist ?artistname
WHERE {
  ?band foaf:name 'The Beatles' .
  ?artist mo:member_of ?band .
  ?artist foaf:name ?artistname .
  ?artist rel:spouseOf ?spouse .
} 
GROUP BY ?artist ?artistname
HAVING (COUNT(?spouse) > 1)
]]></query>
</question>

<question id="98" answertype="resource" aggregation="false">
<string><![CDATA[
Show me all live albums by Nat King Cole.
]]></string>
<keywords><![CDATA[ 
Nat King Cole, live album
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album ?title
WHERE {
  ?album rdf:type mo:Record . 
  ?album mo:release_type mo:live .
  ?album dc:title ?title .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Nat King Cole' .
}
]]></query>
</question>

