<?xml version="1.0" ?>
<dataset id="musicbrainz-train">

<question aggregation="false" answertype="resource" id="94">
<string><![CDATA[
Give me all audiobooks by Paul Auster.
]]></string>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album ?title
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:audiobook .
  ?album dc:title ?title .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Paul Auster' .
}
]]></query>
<keywords><![CDATA[
audiobook, Paul Auster
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/record/d8395a70-6221-411a-8714-446093ced543
</uri>
<string><![CDATA[
Stadt aus Glas (disc 1)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/b3635198-90ea-4362-ace0-e6c921bcf021
</uri>
<string><![CDATA[
Stadt aus Glas (disc 2)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/a4e86ccf-803f-4131-861c-11f11b713bc6
</uri>
<string><![CDATA[
Reisen im Skriptorium (disc 1)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/e00843d3-71ad-401b-8a25-3f882a44474f
</uri>
<string><![CDATA[
Reisen im Skriptorium (disc 2)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/a06ea28b-2f0d-487f-be61-6c7b472d2c53
</uri>
<string><![CDATA[
Reisen im Skriptorium (disc 3)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/870ea4f9-ca03-4392-857f-c78251da5fcb
</uri>
<string><![CDATA[
Reisen im Skriptorium (disc 4)
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="61">
<string><![CDATA[
Give me all members of The Muppets.
]]></string>
<query><![CDATA[
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?artist ?artistname 
WHERE {
  ?band foaf:name 'The Muppets' .
  ?artist mo:member_of ?band.
  ?artist foaf:name ?artistname .
}
]]></query>
<keywords><![CDATA[
The Muppets, member
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/artist/992a7ea8-96c1-4058-ba96-f811c8d01c77
</uri>
<string><![CDATA[
Kermit the Frog
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/d49f81bd-7354-4263-86d2-3321273d4d10
</uri>
<string><![CDATA[
The Great Gonzo
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/d6924537-5874-4dea-9749-9c3d83348733
</uri>
<string><![CDATA[
Miss Piggy
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/31cc1360-4424-4c16-a7bd-4a6f780a0bad
</uri>
<string><![CDATA[
Scooter
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/b35a762a-1134-43ec-88da-ed67cf5013d2
</uri>
<string><![CDATA[
Rowlf the Dog
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/ca867c70-1f5f-4456-9888-70e97e14cb39
</uri>
<string><![CDATA[
Robin
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/71f88b1f-eac7-416f-bf1a-e76adc755578
</uri>
<string><![CDATA[
Fozzie Bear
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/7321c1f0-20ef-4eb9-b271-c13dcb5712a5
</uri>
<string><![CDATA[
Sam the Eagle
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="98">
<string><![CDATA[
Show me all live albums by Nat King Cole.
]]></string>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album ?title
WHERE {
  ?album rdf:type mo:Record . 
  ?album mo:release_type mo:live .
  ?album dc:title ?title .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Nat King Cole' .
}
]]></query>
<keywords><![CDATA[
Nat King Cole, live album
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/record/16fdc9e2-1667-49e2-af5b-a72ec6f07507
</uri>
<string><![CDATA[
Live at the Circle Room &amp; More
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/cb5103b7-929a-41a7-8aca-68b008d267d7
</uri>
<string><![CDATA[
At the Sands
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/687d25ad-4065-4e9a-9728-0931c1a4ee39
</uri>
<string><![CDATA[
Nat King Cole at the Sands
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/5ac4ea62-6e22-4c01-b339-815d12ff805b
</uri>
<string><![CDATA[
The Complete JATP Performances
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="62">
<string><![CDATA[
Give me all siblings of Michael Jackson.
]]></string>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist ?artistname 
WHERE {
  ?artist foaf:name ?artistname .
  ?artist_2 foaf:name 'Michael Jackson' .
  ?artist rel:siblingOf ?artist_2 .
}
]]></query>
<keywords><![CDATA[
Michael Jackson, sibling
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/artist/6be2828f-6c0d-4059-99d4-fa18acf1a296
</uri>
<string><![CDATA[
Janet Jackson
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/ccbdc2ab-1055-44d5-8417-a6b4898bf91b
</uri>
<string><![CDATA[
Jermaine Jackson
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/78bb7e34-0e7f-4103-b180-5274d11e50da
</uri>
<string><![CDATA[
Rebbie Jackson
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/19a3943b-19fb-4781-a585-afe9f46fd6d1
</uri>
<string><![CDATA[
Tito Jackson
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/7a0a724b-6c98-4a7a-9991-2faf659d3f8b
</uri>
<string><![CDATA[
LaToya Jackson
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/593abf14-4292-4d62-b365-79c7674cd1a5
</uri>
<string><![CDATA[
Randy Jackson
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/d06f65d2-26e0-4d40-95e5-22592917eb52
</uri>
<string><![CDATA[
Jackie Jackson
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/dfa29df0-2f21-409c-8509-a75e72205e1d
</uri>
<string><![CDATA[
Marlon Jackson
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="56">
<string><![CDATA[
Give me all songs on the album Abbey Road.
]]></string>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?track ?title 
WHERE {
  ?album mo:release_type mo:album .
  ?album dc:title 'Abbey Road' .
  ?album mo:track ?track .
  ?track dc:title ?title .
}
]]></query>
<keywords><![CDATA[
song, album, Abbey Road
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/track/0a6f3cf0-8323-46cf-9cc5-82f8f15b1717
</uri>
<string><![CDATA[
Maxwell's Silver Hammer
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/482fe397-3509-411c-b5aa-4e1589087bd7
</uri>
<string><![CDATA[
You Never Give Me Your Money
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/dbbe983f-83cf-4b59-87ac-9250047665ae
</uri>
<string><![CDATA[
She Came In Through the Bathroom Window
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/608a270c-eac0-4675-ac6e-780312ffdf98
</uri>
<string><![CDATA[
Golden Slumbers
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/e113c56f-c4d4-4bfb-b9f0-6f90a172b5a9
</uri>
<string><![CDATA[
Come Together
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/fdae8b76-f5b8-4458-bf32-81885000980b
</uri>
<string><![CDATA[
Something
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/52929a64-6a7f-4c1e-9f2a-30782665fbb9
</uri>
<string><![CDATA[
I Want You (She's So Heavy)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/5ddd279b-2279-47b5-a6b1-dc9985df0f43
</uri>
<string><![CDATA[
Here Comes the Sun
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/551b3432-2080-488c-a283-e768e79d281b
</uri>
<string><![CDATA[
Because
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/cc0b4fca-6f76-47f3-a5bd-99494fdbae95
</uri>
<string><![CDATA[
Sun King
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/021499f4-4fdd-4260-a8e6-ab11daa349e1
</uri>
<string><![CDATA[
Her Majesty
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/26457540-e3ce-46b4-a56f-3229bbac45f0
</uri>
<string><![CDATA[
Oh! Darling
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/a0a8de0d-ddac-4623-a006-d290cbc8f969
</uri>
<string><![CDATA[
Octopus's Garden
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/86e7b87d-6242-41fc-bdf8-7b3b0a082673
</uri>
<string><![CDATA[
Mean Mr. Mustard
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/f3c9792f-c6aa-4b1e-9feb-ce75a30b1f34
</uri>
<string><![CDATA[
Polythene Pam
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/e8c9907d-ff64-463c-8eff-fc78fd38884d
</uri>
<string><![CDATA[
Carry That Weight
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/track/8956ecf8-1ad3-469a-a04f-a7ba47516739
</uri>
<string><![CDATA[
The End
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="date" id="30">
<string><![CDATA[
Give me the birthdays of all members of The Beatles.
]]></string>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Beatles' .
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}
]]></query>
<keywords><![CDATA[
birthday, member, The Beatles
]]></keywords>
<answers>
<answer>
<date>
1940-10-09
</date>
</answer>
<answer>
<date>
1943-02-24
</date>
</answer>
<answer>
<date>
1941-11-24
</date>
</answer>
<answer>
<date>
1940-06-23
</date>
</answer>
<answer>
<date>
1942-06-18
</date>
</answer>
<answer>
<date>
1940-07-07
</date>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="16">
<string><![CDATA[
Give me all bands that Michael Stipe is a member of.
]]></string>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?band ?bandname
WHERE { 
 ?artist foaf:name 'Michael Stipe' .
 ?artist mo:member_of ?band .
 ?band foaf:name ?bandname .
}
]]></query>
<keywords><![CDATA[
Michael Stipe, member, band
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/artist/ea4dfa26-f633-4da6-a52a-f49ea4897b58
</uri>
<string><![CDATA[
R.E.M.
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/907981c8-f6be-4d8d-9210-01a0c4843b59
</uri>
<string><![CDATA[
The Golden Palominos
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/44e9e832-3f85-4094-a332-7d0548224cb2
</uri>
<string><![CDATA[
Bingo Hand Job
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="string" id="50">
<string><![CDATA[
Give me the names of the children of John Lennon.
]]></string>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?name
WHERE {
  ?artist foaf:name 'John Lennon' .
  ?artist rel:parentOf ?child .
  ?child foaf:name ?name .
}
]]></query>
<keywords><![CDATA[
name, child, John Lennon
]]></keywords>
<answers>
<answer>
<string><![CDATA[
Julian Lennon
]]></string>
</answer>
<answer>
<string><![CDATA[
Sean Lennon
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="15">
<string><![CDATA[
Give me all albums with the BBC Symphony Orchestra.
]]></string>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album ?title
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:performingOrchestra ?orchestra .
  ?orchestra foaf:name 'BBC Symphony Orchestra' .
  ?album dc:title ?title .
}
]]></query>
<keywords><![CDATA[
BBC Symphony Orchestra, album
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/record/63f82ef6-1ce9-4ea0-9c3d-a9de4640016c
</uri>
<string><![CDATA[
Last Night of the Proms (The 100th Season)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/4bc8b3da-9cc8-48e6-bfab-1ec94626e0d4
</uri>
<string><![CDATA[
Brahms
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/02cbf72c-8b93-4e3c-86ee-a6e7ea586296
</uri>
<string><![CDATA[
Cockaigne Overture / Introduction and Allegro / Serenade in E minor / Enigma Variations (BBC Symphony Orchestra feat. conductor: Andrew Davis)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/3e559fdd-0bc1-452a-90f6-ae71fb600d83
</uri>
<string><![CDATA[
Enigma Variations / Pomp and Circumstance / The Crown of India (BBC Symphony Orchestra, feat. conductor: Leonard Bernstein)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/578da6d4-a5fc-4255-85e9-0a124f07f93f
</uri>
<string><![CDATA[
The Dharma at Big Sur / My Father Knew Charles Ives (BBC Symphony Orchestra feat. conductor: John Adams) (disc 1)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/18a7aa23-6656-4e39-8ef7-c3a3a4f7ddaf
</uri>
<string><![CDATA[
The Young Person's Guide to the Orchestra / Four Sea Interludes (BBC Symphony Orchestra feat. conductor: Sir Andrew Davis)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/e9cad5e7-4f41-4b7a-83f3-60554a0a8614
</uri>
<string><![CDATA[
Beethoven/Mozart: Piano Concertos (Clifford Curzon)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/e6b43d6f-6c32-4a12-b93f-2e6680b82082
</uri>
<string><![CDATA[
The Dharma at Big Sur / My Father Knew Charles Ives (BBC Symphony Orchestra feat. conductor: John Adams) (disc 2)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/c7f1341d-874e-4533-a0bb-5abe77abcb6d
</uri>
<string><![CDATA[
The Perlman Edition (disc 5: Prokofiev Violin Concertos &amp; Sonata for Two Violins)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/a2988172-5ede-41b9-bf04-5259b9bc613d
</uri>
<string><![CDATA[
Pli Selon Pli / Le Visage Nuptial / Le Soleil des eaux / Figures, Doubles, Prismes (BBC Symphony Orchestra feat. conductor: Pierre Boulez) (disc 2)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/a478a8a3-5c3e-4fc7-b201-04531cb84a83
</uri>
<string><![CDATA[
Vanessa (BBC Symphony Orchestra feat. conductor: Leonard Slatkin) (disc 2)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/5dcc5017-3fbd-457e-9326-31fce3f63905
</uri>
<string><![CDATA[
Vanessa (BBC Symphony Orchestra feat. conductor: Leonard Slatkin) (disc 1)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/c8b9f993-c476-4ec7-947c-35cebe4f314c
</uri>
<string><![CDATA[
A Sea Symphony (BBC Symphony Orchestra &amp; Chorus feat. conductor: Andrew Davis)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/43da5103-3b0e-41b9-9a4e-9fedc05621c4
</uri>
<string><![CDATA[
Falstaff / Romance for Bassoon / Grania and Diarmid / Froissart
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/3f4f58cf-56e5-48a0-9488-3c2b09a5a1ae
</uri>
<string><![CDATA[
Not the Messiah (He's a Very Naughty Boy)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/b2558e90-0506-4d8c-82b5-2ae9e29a7a71
</uri>
<string><![CDATA[
The Isle of the Dead, Op. 29 / Two Études-tableaux / Pictures at an Exhibition (BBC Symphony Orchestra feat. conductor Evgeny Svetlanov)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/24cf9b07-2f9e-4589-96ce-906f778dafc7
</uri>
<string><![CDATA[
Taverner (BBC Symphony Orchestra feat. conductor: Oliver Knussen) (disc 1)
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="29">
<string><![CDATA[
Give me all people who were members of The Beatles.
]]></string>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?artist ?name
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Beatles' .
  ?artist foaf:name ?name .
}
]]></query>
<keywords><![CDATA[
person, member, The Beatles
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/artist/4d5447d7-c61c-4120-ba1b-d7f471d385b9
</uri>
<string><![CDATA[
John Lennon
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/42a8f507-8412-4611-854f-926571049fa0
</uri>
<string><![CDATA[
George Harrison
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/0d4ab0f9-bbda-4ab1-ae2c-f772ffcfbea9
</uri>
<string><![CDATA[
Pete Best
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/49a51491-650e-44b3-8085-2f07ac2986dd
</uri>
<string><![CDATA[
Stuart Sutcliffe
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/ba550d0e-adac-4864-b88b-407cab5e76af
</uri>
<string><![CDATA[
Paul McCartney
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/300c4c73-33ac-4255-9d57-4e32627f5e13
</uri>
<string><![CDATA[
Ringo Starr
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="92">
<string><![CDATA[
Give me the collaborations of Shakira.
]]></string>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist_2 ?artist_2_name
WHERE {
  ?artist foaf:name 'Shakira'  .
  ?artist rel:collaboratesWith ?artist_2 .
  ?artist_2 foaf:name ?artist_2_name .
}
]]></query>
<keywords><![CDATA[
Shakira, collaboration
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/artist/5e094f6b-3bfb-4248-925b-30b1b4698409
</uri>
<string><![CDATA[
Shakira &amp; Alejandro Sanz
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/ce14c227-cce0-416f-a05f-08f9b114b29f
</uri>
<string><![CDATA[
Beyoncé &amp; Shakira
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="46">
<string><![CDATA[
List all members of The Notwist.
]]></string>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?artist ?name 
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Notwist' .
  ?artist foaf:name ?name .
}
]]></query>
<keywords><![CDATA[
The Notwist, member
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/artist/ca134505-1fcc-40a3-bef2-4f344b86d1f8
</uri>
<string><![CDATA[
Console
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/cd967b9f-fb7b-4944-aca0-7fc09678407f
</uri>
<string><![CDATA[
Micha Acher
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/c4d30869-2366-45ef-8bab-c671aae79d2d
</uri>
<string><![CDATA[
Markus Acher
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/0a018360-3bc2-4cca-bb34-406bd5882334
</uri>
<string><![CDATA[
Martin Messerschmid
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="65">
<string><![CDATA[
Give me all soundtracks composed by John Williams.
]]></string>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?album ?albumname 
WHERE {
  ?album mo:release_type mo:soundtrack .
  ?album mo:composer ?artist .
  ?artist foaf:name 'John Williams' .
  ?album dc:title ?albumname .
}
]]></query>
<keywords><![CDATA[
soundtrack, compose, John Williams
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/record/0e9346b3-6d74-4126-acb4-67a0f68c1085
</uri>
<string><![CDATA[
Star Wars: Return of the Jedi (disc 2)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/60eadc40-e7b4-4872-bbd8-f1b5203992b3
</uri>
<string><![CDATA[
Harry Potter and the Philosopher's Stone
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/4de98485-0a3b-4b7e-aa70-f1a3552aebeb
</uri>
<string><![CDATA[
Indiana Jones and the Last Crusade
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/a6a132cc-5081-4026-bc9c-0f8f7046776c
</uri>
<string><![CDATA[
Raiders of the Lost Ark
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/36c0182f-0345-457f-88d8-13cdf2ca9f69
</uri>
<string><![CDATA[
Stanley &amp; Iris
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/cd4eb636-7124-4dda-9f52-1e26bb922ea9
</uri>
<string><![CDATA[
Harry Potter and the Prisoner of Azkaban
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/64c91884-ab75-48e4-8e24-9cb88740cabc
</uri>
<string><![CDATA[
Star Wars, Episode I: The Phantom Menace
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/a5c3ed2d-0a80-434b-b693-96645c30baea
</uri>
<string><![CDATA[
Star Wars, Episode III: Revenge of the Sith
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/69221d1c-0b23-440b-8e95-88fe6c4048fb
</uri>
<string><![CDATA[
The Cowboys
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/8942561e-4563-4f6d-946d-d948f9733700
</uri>
<string><![CDATA[
Indiana Jones and the Kingdom of the Crystal Skull
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/fad46666-6756-4c4a-9d9e-1e8f4b550ff0
</uri>
<string><![CDATA[
The Indiana Jones Trilogy: New Recordings of the Classic Scores
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="69">
<string><![CDATA[
Give me all Celldweller EPs.
]]></string>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?album ?title 
WHERE {
  ?album mo:release_type mo:ep .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Celldweller' .
  ?album dc:title ?title .
}
]]></query>
<keywords><![CDATA[
Celldweller, EP
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/record/56630772-5bf2-4576-8370-d8b037e56324
</uri>
<string><![CDATA[
Limited Edition EP
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/3bc40518-4091-4605-a386-acbb1d68cf53
</uri>
<string><![CDATA[
Celldweller Limited Edition E.P.
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/c565882a-10e7-4cd3-bc1f-a294e58d787b
</uri>
<string><![CDATA[
Celldweller Remix EP (Switchback / Own Little World)
]]></string>
</answer>
</answers>
</question>

<question aggregation="true" answertype="number" id="9">
<string><![CDATA[
How many bands are called Nirvana?
]]></string>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?artist)
WHERE {
  ?artist rdf:type mo:MusicGroup .
  ?artist foaf:name 'Nirvana' .
}
]]></query>
<keywords><![CDATA[
band, called, Nirvana
]]></keywords>
<answers>
<answer>
<number>
3
</number>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="73">
<string><![CDATA[
Give me the spouses of all members of The Beatles.
]]></string>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?spouse ?spousename 
WHERE {
  ?band foaf:name 'The Beatles' .
  ?artist mo:member_of ?band .
  ?artist rel:spouseOf ?spouse .
  ?spouse foaf:name ?spousename .
}
]]></query>
<keywords><![CDATA[
member, The Beatles, spouse
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/artist/b0b33754-a664-43b7-ba00-be0dc4ec2396
</uri>
<string><![CDATA[
Yoko Ono
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/d53fc0b4-351c-49ed-b532-297082d40a36
</uri>
<string><![CDATA[
Olivia Harrison
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/10b860bf-f225-4ee0-8c28-e32f1759b4a2
</uri>
<string><![CDATA[
Linda McCartney
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/80a4ee1b-e3e0-46c4-be17-af62c8755af7
</uri>
<string><![CDATA[
Barbara Bach
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/artist/96a008c8-63e0-48ee-92dd-d25beed4f0e5
</uri>
<string><![CDATA[
Maureen Cox
]]></string>
</answer>
</answers>
</question>

<question aggregation="false" answertype="resource" id="18">
<string><![CDATA[
Give me all live albums by Michael Jackson.
]]></string>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album ?title
WHERE {
  ?album rdf:type mo:Record . 
  ?album mo:release_type mo:live .
  ?album dc:title ?title .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Michael Jackson' .
}
]]></query>
<keywords><![CDATA[
Michael Jackson, live album
]]></keywords>
<answers>
<answer>
<uri>
http://zitgist.com/music/record/90092a8c-899d-47af-aebc-a7806dd2bd67
</uri>
<string><![CDATA[
In Concert
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/3691c708-504e-4035-b987-f78c89c3294d
</uri>
<string><![CDATA[
Heal the World Tour 92
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/c995c23e-83f4-4364-a13d-7ab17e6ab6f1
</uri>
<string><![CDATA[
1988: Bad Tour Live in Rotterdam 1988
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/5c7cd653-5cab-43cf-9969-a823c619048a
</uri>
<string><![CDATA[
1988-03-05: Madison Square Garden, New York, NY, USA
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/2d332333-5ccb-4560-a47d-3e605d2728d8
</uri>
<string><![CDATA[
Live in Bucharest: The Dangerous Tour (disc 2)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/90663c57-b44d-4558-ba3d-b37673d54822
</uri>
<string><![CDATA[
Live in Bucharest: The Dangerous Tour (disc 1)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/36b9f2f1-1ba8-4e36-a97e-739ae02a6c56
</uri>
<string><![CDATA[
All of It (Bucharest live October 92)
]]></string>
</answer>
<answer>
<uri>
http://zitgist.com/music/record/011dd451-1910-4ab5-b83f-63f65f6c9dcc
</uri>
<string><![CDATA[
You Were There
]]></string>
</answer>
</answers>
</question>

