{
  "dataset": {
    "id": "qald-6-train-multilingual"
  },
  "questions": [
    {
      "id": "118",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "What were the main discoveries of the Mars rover Curiosity?",
          "keywords": "Mars rover Curiosity, main discoveries"
        },
        {
          "language": "fa",
          "string": "مهم ترین کشف های مریخ نورد کوریوسیتی چه بود؟",
          "keywords": "کشف، مریخ نورد کوریوسیتی"
        },
        {
          "language": "de",
          "string": "Was waren die wichtigsten Entdeckungen des Marsrovers Curiosity?",
          "keywords": "Marsrover Curiosity, wichtigste Entdeckungen"
        },
        {
          "language": "es",
          "string": "¿Cuáles fueron los principales descubrimientos de Mars rover Curiosity?",
          "keywords": "Mars rover Curiosity, principales descubrimientos"
        },
        {
          "language": "it",
          "string": "Quali sono state le scoperte piu' importanti del Mars rover Curiosity?",
          "keywords": "Mars rover Curiosity, scoperte piu' importanti"
        },
        {
          "language": "fr",
          "string": "Quelles sont les découvertes les plus importantes du Mars Rover Curiosity?",
          "keywords": "Mars Rover Curiosity, découvertes importantes"
        },
        {
          "language": "nl",
          "string": "Wat zijn de meest belangrijke ontdekkingen van de Mars rover Curiosity?",
          "keywords": "Mars rover Curiosity, meest belangrijke ontdekkingen"
        },
        {
          "language": "ro",
          "string": "Care au fost descoperirile principale ale Mars rover Curiosity?",
          "keywords": "Mars rover Curiosity, descoperiri principale"
        }
      ],
      "query": {
      }
    },
    {
      "id": "16",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me the capitals of all countries in Africa.",
          "keywords": "Africa, country, capital"
        },
        {
          "language": "fa",
          "string": "پایتخت تمام کشورهای آفریقا را لیست کن.",
          "keywords": "پایتخت، کشورهای، آفریقا"
        },
        {
          "language": "de",
          "string": "Gib mir die Haupstädte von allen Ländern in Afrika.",
          "keywords": "Afrika, Land, Hauptstadt"
        },
        {
          "language": "es",
          "string": "Dame las capitales de todos los países africanos.",
          "keywords": "países, africanos, capital"
        },
        {
          "language": "it",
          "string": "Dammi le capitali di tutti gli stati dell'Africa.",
          "keywords": "Africa, stato, capitale"
        },
        {
          "language": "fr",
          "string": "Donnes-moi la capitale de chaque pays d'Afrique.",
          "keywords": "capitale, pays, Afrique"
        },
        {
          "language": "nl",
          "string": "Noem de hoofdsteden van alle landen in Afrika.",
          "keywords": "Africa, land, hoof"
        },
        {
          "language": "ro",
          "string": "Dă-mi capitalele tuturor țărilor din Africa.",
          "keywords": "Africa, țară, capitală"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?states <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/AfricanCountries> .  ?states <http://dbpedia.org/ontology/capital> ?uri . } "
      }
    },
    {
      "id": "182",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me a list of all American inventions.",
          "keywords": "American invention"
        },
        {
          "language": "fa",
          "string": "تمام اختراعات آمریکایی را لیست کن.",
          "keywords": "اختراعات آمریکایی"
        },
        {
          "language": "de",
          "string": "Gib mir eine Liste aller amerikanischen Erfindungen.",
          "keywords": "amerikanische Erfindung"
        },
        {
          "language": "es",
          "string": "Dame una lista de todos los inventos americanos.",
          "keywords": "inventos americanos"
        },
        {
          "language": "it",
          "string": "Dammi la lista delle invenzioni americane.",
          "keywords": "invenzioni americane"
        },
        {
          "language": "fr",
          "string": "Donnes-moi la liste de toutes les inventions américaines.",
          "keywords": "inventions américaines"
        },
        {
          "language": "nl",
          "string": "Geef een lijst van alle Amerikaanse uitvindingen.",
          "keywords": "Amerikaanse uitvinding"
        },
        {
          "language": "ro",
          "string": "Dă-mi o listă a tuturor invențiilor americane.",
          "keywords": "invenție americană"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/AmericanInventions> . } "
      }
    },
    {
      "id": "196",
      "answertype": "string",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all B-sides of the Ramones.",
          "keywords": "Ramones, B-sides"
        },
        {
          "language": "fa",
          "string": "تمام بیسایدهای رامونز را لیست کن.",
          "keywords": "بیسایدهای، رامونز"
        },
        {
          "language": "de",
          "string": "Gib mir alle B-Seiten der Ramones.",
          "keywords": "Ramones, B-Seiten"
        },
        {
          "language": "es",
          "string": "Dame todas las caras B de los Ramones.",
          "keywords": "Ramones, cara B"
        },
        {
          "language": "it",
          "string": "Dammi tutti i lati B dei Ramones.",
          "keywords": "Ramones, lato B"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les faces B des Ramones.",
          "keywords": "faces B, Ramones"
        },
        {
          "language": "nl",
          "string": "Geef alle B-kantjes van singles van de Ramones.",
          "keywords": "B-kant, single, de Ramones"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate laturile B ale Ramones",
          "keywords": "Ramones, laturi B"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?string WHERE {  ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> .  ?x <http://dbpedia.org/ontology/bSide> ?string . } "
      }
    },
    {
      "id": "28",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all communist countries.",
          "keywords": "communist countries"
        },
        {
          "language": "fa",
          "string": "تمام کشورهای کمونیست را لیست کن.",
          "keywords": "کشورهای، کمونیست"
        },
        {
          "language": "de",
          "string": "Gib mir alle kommunistischen Länder.",
          "keywords": "kommunistische Länder"
        },
        {
          "language": "es",
          "string": "Dame todos los países comunistas.",
          "keywords": "países comunistas"
        },
        {
          "language": "it",
          "string": "Dammi tutti i paesi comunisti.",
          "keywords": "paesi comunisti"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les pays communistes.",
          "keywords": "pays communistes"
        },
        {
          "language": "nl",
          "string": "Geef alle communistische landen.",
          "keywords": "communistische landen"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate țările comuniste.",
          "keywords": "țări comuniste"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/property/ideology> <http://dbpedia.org/resource/Communism> . }"
      }
    },
    {
      "id": "51",
      "answertype": "resource",
      "aggregation": "true",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all libraries established earlier than 1400.",
          "keywords": "libraries, established, earlier than 1400"
        },
        {
          "language": "fa",
          "string": "تمام کتاب خانه هایی که قبل از 1400 تأسیس شدند را لیست کن.",
          "keywords": "کتاب خانه هایی، قبل از 1400، تأسیس"
        },
        {
          "language": "de",
          "string": "Gib mir alle Bibliotheken, die vor 1400 gegründet worden.",
          "keywords": "Bibliotheken, gegründet, vor 1400"
        },
        {
          "language": "es",
          "string": "Dame todas las bibliotecas que fueron establecidas antes de 1400.",
          "keywords": "bibliotecas, establecidas, antes de 1400"
        },
        {
          "language": "it",
          "string": "Dammi tutte le biblioteche fondate prima del 1400.",
          "keywords": "biblioteche, fondate, prima del 1400"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les bibliothèques établies avant 1400.",
          "keywords": "bibliothèques, établies, avant 1400"
        },
        {
          "language": "nl",
          "string": "Geef me alle bibliotheken die voor 1400 werden opgericht.",
          "keywords": "bibliotheken, opgericht, voor 1400"
        },
        {
          "language": "ro",
          "string": "Dă-mi tote bibliotecile înființate înainte de 1400",
          "keywords": "biblioteci, înființat, înainte de 1400"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library> .  ?uri <http://dbpedia.org/property/established> ?year .  FILTER (?year < 1400) } "
      }
    },
    {
      "id": "59",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all people with first name Jimmy.",
          "keywords": "person, first name, Jimmy"
        },
        {
          "language": "fa",
          "string": "تمام افرادی که اسم کوچک آنها جیمی است را لیست کن.",
          "keywords": "افرادی، اسم کوچک، جیمی"
        },
        {
          "language": "de",
          "string": "Gib mir alle Personen, die den Vornamen Jimmy haben.",
          "keywords": "Person, Vorname, Jimmy"
        },
        {
          "language": "es",
          "string": "Dame todas las personas con el nombre propio Jimmy.",
          "keywords": "personas, nombre propio, Jimmy"
        },
        {
          "language": "it",
          "string": "Dammi tutte le persone il cui nome è Jimmy.",
          "keywords": "persone, nome, Jimmy"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les personnes dont le prénom est Jimmy.",
          "keywords": "personnes, prénom, Jimmy"
        },
        {
          "language": "nl",
          "string": "Noem alle personen met de voornaam Jimmy.",
          "keywords": "persoon, voornaam, Jimmy"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate persoanele cu prenumele Jimmy",
          "keywords": "persoană, prenume, Jimmy"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> foaf:Person .  ?uri foaf:givenName 'Jimmy'@en . } "
      }
    },
    {
      "id": "94",
      "answertype": "number",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Which budget did the first movie of Zdenek Sverak have?",
          "keywords": "Zdenek Sverak, movie, first, budget"
        },
        {
          "language": "fa",
          "string": "اولین فیلم زندیک سویراک چقدر بودجه داشت؟",
          "keywords": "اولین، فیلم، زندیک سویراک، بودجه"
        },
        {
          "language": "de",
          "string": "Welches Budget hatte der erste Film von Zdenek Sverak?",
          "keywords": "Zdenek Sverak, Film, erster, Budget"
        },
        {
          "language": "es",
          "string": "¿Cuál fué el presupuesto de la primera película de Zdenek Sverak?",
          "keywords": "presupuesto, primera pelicula, Zdenek Sverak"
        },
        {
          "language": "it",
          "string": "Che budget ebbe il primo film di Zdenek Sverak?",
          "keywords": "Zdenek Sverak, film, primo, budget"
        },
        {
          "language": "fr",
          "string": "Quel était le budget du premier film de Zdenek Sverak?",
          "keywords": "budget, premier film, Zdenek Sverak"
        },
        {
          "language": "nl",
          "string": "Welk budget had de eerste film van Zdenek Sverak",
          "keywords": "budget, eerste film, Zdenek Sverak"
        },
        {
          "language": "ro",
          "string": "Ce buget a avut primul film al lui Zdenek Sverak?",
          "keywords": "Zdenek Sverak, film, primul, buget"
        }
      ],
      "query": {
      }
    },
    {
      "id": "95",
      "answertype": "number",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "How many big fires struck Paris during the Middle Ages?",
          "keywords": "Paris, middle ages, fire"
        },
        {
          "language": "fa",
          "string": "چند آتش سوزی بزرگ در طول قرون وسطی در پاریس رخ داده است؟",
          "keywords": "آتش سوزی، قرون وسطی، پاریس"
        },
        {
          "language": "de",
          "string": "Wieviele Großbrände wüteten im Paris des Mittelalters?",
          "keywords": "Paris, Mittelalter, Großbrand"
        },
        {
          "language": "es",
          "string": "¿Cuántos grandes incendios se produjeron en el Paris medieval?",
          "keywords": "Paris, edad media, gran incendio"
        },
        {
          "language": "it",
          "string": "Quanti grandi incendi sono scoppiati a Parigi nel Medioevo?",
          "keywords": "Parigi, Medioevo, incendio"
        },
        {
          "language": "fr",
          "string": "Quels grands incendies ont frappé Paris pendant le Moyen Âge?",
          "keywords": "grands incendies, frappé, Paris, Moyen Âge"
        },
        {
          "language": "nl",
          "string": "Hoeveel grote branden troffen Parijs in de Middeleeuwen?",
          "keywords": "grote brand, Parijs, Middeleeuwen"
        },
        {
          "language": "ro",
          "string": "Câte incendii majore a suferit Parisul în Evul Mediu?",
          "keywords": "Paris, Evul Mediu, incendiu"
        }
      ],
      "query": {
      }
    },
    {
      "id": "97",
      "answertype": "number",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "How often was Michael Jordan divorced?",
          "keywords": "Michael Jordan, divorced"
        },
        {
          "language": "fa",
          "string": "مایکل جردن چند بار طلاق گرفته است؟",
          "keywords": "مایکل جردن، طلاق"
        },
        {
          "language": "de",
          "string": "Wie oft hat sich Michael Jordan scheiden lassen?",
          "keywords": "Michael Jordan, scheiden"
        },
        {
          "language": "es",
          "string": "¿Cuántas veces se ha divorciado Michael Jordan?",
          "keywords": "Michael Jordan, divorcio"
        },
        {
          "language": "it",
          "string": "Quante volte ha divorziato Michael Jordan?",
          "keywords": "Michael Jordan, divorziato"
        },
        {
          "language": "fr",
          "string": "Combien de fois a divorcé Michael Jordan?",
          "keywords": "Michael Jordan, divorcé"
        },
        {
          "language": "nl",
          "string": "Hoe vaak is Michael Jackson gescheiden?",
          "keywords": "gescheiden, Michael Jackson"
        },
        {
          "language": "ro",
          "string": "De câte ori a divorțat Michael Jordan?",
          "keywords": "Michael Jordan, divorțat"
        }
      ],
      "query": {
      }
    },
    {
      "id": "98",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "What is the most beautiful painting?",
          "keywords": "painting, most, beautiful"
        },
        {
          "language": "fa",
          "string": "زیباترین نقاشی کدام است؟",
          "keywords": "زیباترین، نقاشی"
        },
        {
          "language": "de",
          "string": "Welches Gemälde ist das schönste?",
          "keywords": "Gemälde, schönstes"
        },
        {
          "language": "es",
          "string": "¿Cuál es la pintur más bonita?",
          "keywords": "pintura, más bonita"
        },
        {
          "language": "it",
          "string": "Qual è il dipinto più bello?",
          "keywords": "dipinto, più bello"
        },
        {
          "language": "fr",
          "string": "Quelle est la plus belle peinture du monde?",
          "keywords": "plus belle peinture du monde"
        },
        {
          "language": "nl",
          "string": "Wat is het mooiste schilderij?",
          "keywords": "schilderij, mooiste"
        },
        {
          "language": "ro",
          "string": "Care este cel mai prumos tablou?",
          "keywords": "tablou, cel mai, frumos"
        }
      ],
      "query": {
      }
    },
    {
      "id": "233",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me the capitals of all countries that the Himalayas run through.",
          "keywords": "countries Himalayas run through, capitals"
        },
        {
          "language": "fa",
          "string": "پایتخت تمام کشورهایی که هیمالیا از آنها می گذرد را لیست کن.",
          "keywords": "پایتخت، کشورهایی، هیمالیا، می گذرد"
        },
        {
          "language": "de",
          "string": "Gib mir die Haupstädte aller Länder, über die sich der Himalaya erstreckt.",
          "keywords": "Länder, erstrecken, Himalaya, Haupstadt"
        },
        {
          "language": "es",
          "string": "Dame las capitales de todos los países que atraviesa el Himalaya.",
          "keywords": "capital de países, atraviesa el Himalaya"
        },
        {
          "language": "it",
          "string": "Dammi tutte le capitali degli stati attraversati dall'Himalaya.",
          "keywords": "capitali, stati attraversati dall'Himalaya"
        },
        {
          "language": "fr",
          "string": "Donne-moi les capitales de tous les pays que l'Himalaya traverse.",
          "keywords": "capitales, pays, traversé, Himalaya"
        },
        {
          "language": "nl",
          "string": "Toon de hoofdsteden van alle landen waardoor de Himalaya loopt.",
          "keywords": "Himalaya, lopen door, landen, hoofdsteden"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate țările traversate de Himalaya și capitalele lor.",
          "keywords": "țări, traversate de Himalaya, capitale"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/property/country> ?country .  ?country <http://dbpedia.org/ontology/capital> ?uri . } "
      }
    },
    {
      "id": "326",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all spacecrafts that flew to Mars.",
          "keywords": "spacecrafts, flew to, Mars"
        },
        {
          "language": "fa",
          "string": "تمام فضاپیماهایی که به مریخ پرواز کردند را لیست کن.",
          "keywords": "فضاپیماهایی، مریخ، پرواز"
        },
        {
          "language": "de",
          "string": "Zeig mir alle Raumschiffe, die zum Mars geflogen sind.",
          "keywords": "Raumschiffe, geflogen, Mars"
        },
        {
          "language": "es",
          "string": "Dame todas las naves espaciales que han volado a Marte",
          "keywords": "naves espaciales, volado, Marte"
        },
        {
          "language": "it",
          "string": "Dammi tutte le astronavi che hanno volato su Marte.",
          "keywords": "astronavi, volare, Marte"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les vaisseaux spatiaux qui ont volé pour Mars.",
          "keywords": "vaisseaux spatiaux, volé, Mars"
        },
        {
          "language": "nl",
          "string": "Geef alle ruimtetuigen die naar Mars werden gestuurd.",
          "keywords": "ruimtetuigen, gestuurd, Mars"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate navele spațiale care au zburat spre Marte.",
          "keywords": "nave spațiale, zburat, Marte"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Spacecraft> .  ?uri <http://dbpedia.org/property/planet> <http://dbpedia.org/resource/Mars> . } "
      }
    }
  ]
}
