<?xml version="1.0" ?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="65" onlydbo="false">
<string lang="en"><![CDATA[Which companies work in the aerospace industry as well as in medicine?]]></string>
<string lang="de"><![CDATA[Welche Unternehmen sind sowohl in der Luft- und Raumfahrt als auch im Bereich der Medizin tätig?]]></string>
<string lang="es"><![CDATA[¿Qué empresas aerospaciales trabajar también en en medicina?]]></string>
<string lang="it"><![CDATA[Quali aziende si occupano sia nell'industria aerospaziale che in ambito medico?]]></string>
<string lang="fr"><![CDATA[Quelles companies travaillent dans l'aérospatial et dans la médecine?]]></string>
<string lang="nl"><![CDATA[Welke bedrijven zijn zowel actief in de ruimtevaartindustrie als in de geneeskunde?]]></string>
<string lang="ro"><![CDATA[Ce companii lucrează în industria aerospațială, precum și în medicină?]]></string>
<keywords lang="en"><![CDATA[company, aerospace industry, medicine]]></keywords>
<keywords lang="de"><![CDATA[Unternehmen, Luft- und Raumfahrt, Medizin]]></keywords>
<keywords lang="es"><![CDATA[empresas, areospaciales, medicina]]></keywords>
<keywords lang="it"><![CDATA[azienda, industria aerospaziale, ambito medico]]></keywords>
<keywords lang="fr"><![CDATA[companies, aérospatial, médecine]]></keywords>
<keywords lang="nl"><![CDATA[bedrijf, ruimtevaartindustrie, geneeskunde]]></keywords>
<keywords lang="ro"><![CDATA[companii, industrie aerospațială, medicină]]></keywords>
<query><![CDATA[
PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Company  .
        ?uri dbo:industry res:Aerospace . 
        ?uri dbo:industry res:Medicine .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="boolean" id="66" onlydbo="true">
<string lang="en"><![CDATA[Is Christian Bale starring in Velvet Goldmine?]]></string>
<string lang="de"><![CDATA[Spielt Christian Bale in Velvet Goldmine mit?]]></string>
<string lang="es"><![CDATA[¿Actúa Christian Bale en Velvet Goldmine?]]></string>
<string lang="it"><![CDATA[Christian Bale ha recitato in Velvet Goldmine?]]></string>
<string lang="fr"><![CDATA[Christian Bale joue-t-il dans Velvet Goldmine?]]></string>
<string lang="nl"><![CDATA[Speelt Christian Bale in Velvet Goldmine?]]></string>
<string lang="ro"><![CDATA[Joacă Christian Bale un rol principal în Velvet Goldmine?]]></string>
<keywords lang="en"><![CDATA[Christian Bale, starring, Velvet Goldmine]]></keywords>
<keywords lang="de"><![CDATA[Christian Bale, mitspielen, Velvet Goldmine]]></keywords>
<keywords lang="es"><![CDATA[Christian Bale, actúa, Velvet Goldmine]]></keywords>
<keywords lang="it"><![CDATA[Christian Bale, recitare, Velvet Goldmine]]></keywords>
<keywords lang="fr"><![CDATA[Christian Bale, joue, Velvet Goldmine]]></keywords>
<keywords lang="nl"><![CDATA[Christian Bale, speelt in, Velvet Goldmine]]></keywords>
<keywords lang="ro"><![CDATA[Christian Bale, rol principal, Velevet Goldmine]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE {
        res:Velvet_Goldmine dbo:starring res:Christian_Bale .
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="string" id="67" onlydbo="false">
<string lang="en"><![CDATA[Give me the websites of companies with more than 500000 employees.]]></string>
<string lang="de"><![CDATA[Gib mir alle Webseiten von Unternehmen mit mehr als 500000 Angestellten.]]></string>
<string lang="es"><![CDATA[Dame todas las páginas de Web de empresas con más de 500000 empleados.]]></string>
<string lang="it"><![CDATA[Dammi tutti i siti internet di aziende con più di 500000 dipendenti.]]></string>
<string lang="fr"><![CDATA[Donnes-moi les sites webs de companies avec plus de 500000 employés.]]></string>
<string lang="nl"><![CDATA[Geef me de websites van alle ondernemingen met meer dan 500000 werknemers.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate website-urile de la companiile cu mai mult de 500000 de angajați]]></string>
<keywords lang="en"><![CDATA[website, company, employee, more than 500000]]></keywords>
<keywords lang="de"><![CDATA[Webseite, Unternehmen, Angestellte, mehr als 500000]]></keywords>
<keywords lang="es"><![CDATA[página de Web, empreasas, empleados, más de 500000]]></keywords>
<keywords lang="it"><![CDATA[sito internet, azienda, dipendenti, più di 500000]]></keywords>
<keywords lang="fr"><![CDATA[sites webs, companies, plus de 500000 employés]]></keywords>
<keywords lang="nl"><![CDATA[website, onderneming, werknemers, meer dan 500000]]></keywords>
<keywords lang="ro"><![CDATA[website, companie, angajat, mai mult de 500000]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
SELECT DISTINCT ?string
WHERE {
         ?c rdf:type dbo:Company .
       { ?c dbo:numberOfEmployees ?employees . }
       UNION
       { ?c dbp:numEmployees ?employees . }
         FILTER( xsd:integer(?employees) > 500000 ) .
         ?c dbp:homepage ?string .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="68" onlydbo="true">
<string lang="en"><![CDATA[Which actors were born in Germany?]]></string>
<string lang="de"><![CDATA[Welche Schauspieler wurden in Deutschland geboren?]]></string>
<string lang="es"><![CDATA[¿Qué actores nacieron en Alemania?]]></string>
<string lang="it"><![CDATA[Quali attori sono nati in Germania?]]></string>
<string lang="fr"><![CDATA[Quels acteurs sont nés en Allemagne?]]></string>
<string lang="nl"><![CDATA[Welke acteurs zijn geboren in Duitsland?]]></string>
<string lang="ro"><![CDATA[Ce actori au fost născuți în Germania?]]></string>
<keywords lang="en"><![CDATA[actor, born, Germany]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, geboren, Deutschland]]></keywords>
<keywords lang="es"><![CDATA[Actores, nacidos, Alemania]]></keywords>
<keywords lang="it"><![CDATA[attore, nato, Germania]]></keywords>
<keywords lang="fr"><![CDATA[acteurs, nés, Allemagne]]></keywords>
<keywords lang="nl"><![CDATA[acteur, geboren, Duitsland]]></keywords>
<keywords lang="ro"><![CDATA[actor, născut, Germania]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Actor .
      { ?uri dbo:birthPlace res:Germany . }
      UNION 
      { ?uri dbo:birthPlace ?place .
        ?place dbo:country res:Germany . }
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="69" onlydbo="false">
<string lang="en"><![CDATA[Which caves have more than 3 entrances?]]></string>
<string lang="de"><![CDATA[Welche Höhlen haben mehr als 3 Eingänge?]]></string>
<string lang="es"><![CDATA[¿Qué cuevas tienen más de 3 entradas?]]></string>
<string lang="it"><![CDATA[Quali grotte hanno più di 3 entrate?]]></string>
<string lang="fr"><![CDATA[Quelles grottes ont plus de 3 entrées?]]></string>
<string lang="nl"><![CDATA[Welke grotten hebben meer dan drie ingangen?]]></string>
<string lang="ro"><![CDATA[Ce peșteri au mai mult de 3 intrări?]]></string>
<keywords lang="en"><![CDATA[cave, entrance, more than 3]]></keywords>
<keywords lang="de"><![CDATA[Höhle, Eingang, mehr als 3]]></keywords>
<keywords lang="es"><![CDATA[cueva, entrada, más de 3]]></keywords>
<keywords lang="it"><![CDATA[grotta, entrata, più di 3]]></keywords>
<keywords lang="fr"><![CDATA[grottes, plus de 3 entrées]]></keywords>
<keywords lang="nl"><![CDATA[grot, ingang, meer dan drie]]></keywords>
<keywords lang="ro"><![CDATA[peșteră, intrare, mai mult de 3]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Cave .
        ?uri dbp:entranceCount ?entrance .
        FILTER (?entrance > 3) .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="boolean" id="7" onlydbo="true">
<string lang="en"><![CDATA[Was the wife of president Lincoln called Mary?]]></string>
<string lang="de"><![CDATA[Hieß die Frau von Präsident Lincoln Mary?]]></string>
<string lang="es"><![CDATA[¿La mujer del presidente Lincoln se llama Mary?]]></string>
<string lang="it"><![CDATA[La moglie del presidente Lincoln si chiamava Mary?]]></string>
<string lang="fr"><![CDATA[Est-ce que l'épouse du président Lincoln s'appelait Mary?]]></string>
<string lang="nl"><![CDATA[Heette de echtgenote van president Lincoln Mary?]]></string>
<string lang="ro"><![CDATA[Este soția președintelui Lincoln numită Mary?]]></string>
<keywords lang="en"><![CDATA[Lincoln, president, wife, called, Mary]]></keywords>
<keywords lang="de"><![CDATA[Lincoln, Präsident, Frau, heißen, Mary]]></keywords>
<keywords lang="es"><![CDATA[mujer, presidente, Lincoln, se lamma, Mary]]></keywords>
<keywords lang="it"><![CDATA[moglie, presidente, Lincoln, si chiama, Mary]]></keywords>
<keywords lang="fr"><![CDATA[épouse, Lincoln, Mary, appelle]]></keywords>
<keywords lang="nl"><![CDATA[echtgenote, Lincoln, Mary]]></keywords>
<keywords lang="ro"><![CDATA[Lincoln, președinte, soție, numită, Mary]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
ASK 
WHERE {
        res:Abraham_Lincoln dbo:spouse ?spouse .
        ?spouse rdfs:label ?name .
        FILTER(regex(?name,'Mary')) 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="70" onlydbo="true">
<string lang="en"><![CDATA[Give me all films produced by Hal Roach.]]></string>
<string lang="de"><![CDATA[Gib mir alle Filme des Produzenten Hal Roach.]]></string>
<string lang="es"><![CDATA[Dame todas las películas del producente Hal Roach.]]></string>
<string lang="it"><![CDATA[Dammi tutti i film prodotti da Hal Roach.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les films produits par Hal Roach.]]></string>
<string lang="nl"><![CDATA[Noem alle films die zijn geproduceerd door Hal Roach.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate filmele produse de Hal Roach]]></string>
<keywords lang="en"><![CDATA[film, produce, Hal Roach]]></keywords>
<keywords lang="de"><![CDATA[Film, Produzent, Hal Roach]]></keywords>
<keywords lang="es"><![CDATA[película, producente, Hal Roach]]></keywords>
<keywords lang="it"><![CDATA[film, produrre, Hal Roach]]></keywords>
<keywords lang="fr"><![CDATA[films, produits, Hal Roach]]></keywords>
<keywords lang="nl"><![CDATA[film, producent, Hal Roach]]></keywords>
<keywords lang="ro"><![CDATA[film, produs, Hal Roach]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:producer res:Hal_Roach .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="71" onlydbo="false">
<string lang="en"><![CDATA[Give me all video games published by Mean Hamster Software.]]></string>
<string lang="de"><![CDATA[Gib mir alle Videospiele von Mean Hamster Software.]]></string>
<string lang="es"><![CDATA[Dame todos los videojuegos de Mean Hamster Software.]]></string>
<string lang="it"><![CDATA[Dammi tutti i videogiochi di Mean Hamster Software.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les jeux vidéos publiés par Mean Hamster Software.]]></string>
<string lang="nl"><![CDATA[Geef me alle videogames van Mean Hamster Software.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate jocurile video publicate de Mean Hamster Software]]></string>
<keywords lang="en"><![CDATA[video game, publish, Mean Hamster Software]]></keywords>
<keywords lang="de"><![CDATA[Videospiel, Mean Hamster Software]]></keywords>
<keywords lang="es"><![CDATA[videojuego, Mean Hamster Software]]></keywords>
<keywords lang="it"><![CDATA[videogioco, prodotto, Mean Hamster Software]]></keywords>
<keywords lang="fr"><![CDATA[jeux vidéos, publiés, Mean Hamster Software]]></keywords>
<keywords lang="nl"><![CDATA[videogame, Mean Hamster Software]]></keywords>
<keywords lang="ro"><![CDATA[joc video, publicat, Mean Hamster Software]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
      ?uri rdf:type dbo:VideoGame .
      ?uri dbo:publisher res:Mean_Hamster_Software . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="72" onlydbo="true">
<string lang="en"><![CDATA[Which languages are spoken in Estonia?]]></string>
<string lang="de"><![CDATA[Welche Sprachen werden in Estland gesprochen?]]></string>
<string lang="es"><![CDATA[¿Qué idiomas se hablan en Estonia?]]></string>
<string lang="it"><![CDATA[Quali lingue sono parlate in Estonia?]]></string>
<string lang="fr"><![CDATA[Quelles langues parle-t-on en Estonie?]]></string>
<string lang="nl"><![CDATA[Welke talen worden gesproken in Estland?]]></string>
<string lang="ro"><![CDATA[Ce limbi sunt vorbite în Estonia?]]></string>
<keywords lang="en"><![CDATA[language, spoken, Estonia]]></keywords>
<keywords lang="de"><![CDATA[Sprache, sprechen, Estland]]></keywords>
<keywords lang="es"><![CDATA[idiomas, Estonia]]></keywords>
<keywords lang="it"><![CDATA[lingua, Estonia]]></keywords>
<keywords lang="fr"><![CDATA[langues, Estonie]]></keywords>
<keywords lang="nl"><![CDATA[taal, gesproken, Estland]]></keywords>
<keywords lang="ro"><![CDATA[limbă, vorbită, Estonia]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:spokenIn res:Estonia . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="number" id="73" onlydbo="true">
<string lang="en"><![CDATA[How many Aldi stores are there?]]></string>
<string lang="de"><![CDATA[Wieviele Aldi-Filialen gibt es?]]></string>
<string lang="es"><![CDATA[¿Cuántas tiendas Aldi hay?]]></string>
<string lang="it"><![CDATA[Quanti negozi Aldi ci sono?]]></string>
<string lang="fr"><![CDATA[Combien de magasins Aldi sont là?]]></string>
<string lang="nl"><![CDATA[Hoeveel Aldi winkels zijn er?]]></string>
<string lang="ro"><![CDATA[Câte magazine Aldi există?]]></string>
<keywords lang="en"><![CDATA[own, Aldi]]></keywords>
<keywords lang="de"><![CDATA[gehören, Aldi]]></keywords>
<keywords lang="es"><![CDATA[pertenece, Aldi]]></keywords>
<keywords lang="it"><![CDATA[possedere, Aldi]]></keywords>
<keywords lang="fr"><![CDATA[possède, Aldi]]></keywords>
<keywords lang="nl"><![CDATA[eigenaar, Aldi]]></keywords>
<keywords lang="ro"><![CDATA[avea, Aldi]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?number
WHERE {
        res:Aldi dbo:numberOfLocations ?number .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="74" onlydbo="false">
<string lang="en"><![CDATA[Which capitals in Europe were host cities of the summer olympic games?]]></string>
<string lang="de"><![CDATA[In welchen europäischen Hauptstädten fanden olympische Sommerspiele statt?]]></string>
<string lang="es"><![CDATA[¿En qué capitales europeas tuvieron lugar los juegos olímpicos de verano?]]></string>
<string lang="it"><![CDATA[Quali capitali europee hanno ospitato i giochi olimpici estivi?]]></string>
<string lang="fr"><![CDATA[Quelles capitales européenes ont été hôtes de jeux olympiques d'été?]]></string>
<string lang="nl"><![CDATA[In welke Europese hoofdsteden waren de Olympische Zomerspelen?]]></string>
<string lang="ro"><![CDATA[Ce capitale europene au fost gazde ale Jocurile Olimpice de vară?]]></string>
<keywords lang="en"><![CDATA[capital, Europe, host city, summer olympic games]]></keywords>
<keywords lang="de"><![CDATA[europäisch, Hauptstadt, stattfinden, olympische Sommerspiele]]></keywords>
<keywords lang="es"><![CDATA[capital europea, juegos olímpicos de verano]]></keywords>
<keywords lang="it"><![CDATA[capitale, Europa, ospitare, giochi olimpici estivi]]></keywords>
<keywords lang="fr"><![CDATA[capitales européenes, hôtes, jeux olympiques d'été]]></keywords>
<keywords lang="nl"><![CDATA[Europese hoofdstad, plaatvinden, Olympische Zomerspelen]]></keywords>
<keywords lang="ro"><![CDATA[capital, Europa, oraș gazdă, Jocurile Olimpice]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type yago:CapitalsInEurope .
        ?uri rdf:type yago:HostCitiesOfTheSummerOlympicGames .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="75" onlydbo="true">
<string lang="en"><![CDATA[Who was the 16th president of the United States?]]></string>
<string lang="de"><![CDATA[Wer war der 16. Präsident der Vereinigten Staaten?]]></string>
<string lang="es"><![CDATA[¿Quién fue el 16th presidente de los Estados Unidos?]]></string>
<string lang="it"><![CDATA[Chi è stato il sedicesimo presidente degli Stati Uniti?]]></string>
<string lang="fr"><![CDATA[Qui fut le premier président des États-Unis?]]></string>
<string lang="nl"><![CDATA[Wie was de 16de president van de Verenigde Staten?]]></string>
<string lang="ro"><![CDATA[Cine a fost primul președinte al Statelor Unite?]]></string>
<keywords lang="en"><![CDATA[United States, 16th president]]></keywords>
<keywords lang="de"><![CDATA[Vereinigte Staaten, 16. Präsident]]></keywords>
<keywords lang="es"><![CDATA[estados unidos, primer presidente]]></keywords>
<keywords lang="it"><![CDATA[Stati Uniti, sedicesimo presidente]]></keywords>
<keywords lang="fr"><![CDATA[Etats-Unis, premier président]]></keywords>
<keywords lang="nl"><![CDATA[Verenigde Staten, 16de president]]></keywords>
<keywords lang="ro"><![CDATA[Statele Unite, primul președinte]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
         ?uri dbo:office 'President of the United States' .
         ?uri dbo:orderInOffice '16th' .
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="number" id="76" onlydbo="true">
<string lang="en"><![CDATA[How many films did Hal Roach produce?]]></string>
<string lang="de"><![CDATA[Wieviele Filme hat Hal Roach produziert?]]></string>
<string lang="es"><![CDATA[¿Cuántas películas ha producido Hal Roach?]]></string>
<string lang="it"><![CDATA[Quanti film ha prodotto Hal Roach?]]></string>
<string lang="fr"><![CDATA[Combien de films ont été produit par Hal Roach?]]></string>
<string lang="nl"><![CDATA[Hoeveel films heeft Hal Roach geproduceerd?]]></string>
<string lang="ro"><![CDATA[Câte filme a produs Hal Roach?]]></string>
<keywords lang="en"><![CDATA[Hal Roach, produce, film]]></keywords>
<keywords lang="de"><![CDATA[Hal Roach, produzieren, Film]]></keywords>
<keywords lang="es"><![CDATA[películas, producido, Hal Roach]]></keywords>
<keywords lang="it"><![CDATA[film, prodotto, Hal Roach]]></keywords>
<keywords lang="fr"><![CDATA[combien, films, Hal Roach]]></keywords>
<keywords lang="nl"><![CDATA[Hal Roach, producent, film]]></keywords>
<keywords lang="ro"><![CDATA[Hal Roach, produs, film]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
SELECT COUNT(DISTINCT ?uri) 
WHERE {
        ?uri dbo:producer res:Hal_Roach .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="77" onlydbo="false">
<string lang="en"><![CDATA[Which music albums contain the song Last Christmas?]]></string>
<string lang="de"><![CDATA[Auf welchen Musikalben ist das Lied Last Christmas?]]></string>
<string lang="es"><![CDATA[¿Qué albums musicales contienen la canción Las Christmas?]]></string>
<string lang="it"><![CDATA[Quali album musicali contengono la canzone Last Christmas?]]></string>
<string lang="fr"><![CDATA[Quels albums contiennent le morceau Last Christmas?]]></string>
<string lang="nl"><![CDATA[Op welke muziekalbums staat het nummer Last Christmas?]]></string>
<string lang="ro"><![CDATA[Ce albume muzicale conțin melodia Last Christmas?]]></string>
<keywords lang="en"><![CDATA[music album, song, Last Christmas]]></keywords>
<keywords lang="de"><![CDATA[Musikalbum, Lied, Last Christmas]]></keywords>
<keywords lang="es"><![CDATA[album musical, canción, Last Christmas]]></keywords>
<keywords lang="it"><![CDATA[album musicale, canzone, Last Christmas]]></keywords>
<keywords lang="fr"><![CDATA[albums, contiennent, Last Christmas?]]></keywords>
<keywords lang="nl"><![CDATA[muziekalbum, nummer, Last Christmas]]></keywords>
<keywords lang="ro"><![CDATA[album musical, melodie, Last Christmas]]></keywords>
<query><![CDATA[
PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri 
WHERE {
        ?single dbo:album ?uri .
        ?single rdfs:label 'Last Christmas'@en .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="78" onlydbo="true">
<string lang="en"><![CDATA[Give me all books written by Danielle Steel.]]></string>
<string lang="de"><![CDATA[Gib mir alle Bücher, die Danielle Steel geschrieben hat.]]></string>
<string lang="es"><![CDATA[Dame todos los libros escritos por Danielle Steel.]]></string>
<string lang="it"><![CDATA[Dammi tutti i libri scritti da Danielle Steel.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les livres écrits par Danielle Steel.]]></string>
<string lang="nl"><![CDATA[Noem alle boeken van Danielle Steel.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate cărțile scrise de Danielle Steel.]]></string>
<keywords lang="en"><![CDATA[book, written, Danielle Steel]]></keywords>
<keywords lang="de"><![CDATA[Buch, schreiben, Danielle Steel]]></keywords>
<keywords lang="es"><![CDATA[libors, escritos, Danielle Steel]]></keywords>
<keywords lang="it"><![CDATA[libri, scritti, Danielle Steel]]></keywords>
<keywords lang="fr"><![CDATA[livres, écrits, Danielle Steele]]></keywords>
<keywords lang="nl"><![CDATA[boek, Danielle Steel]]></keywords>
<keywords lang="ro"><![CDATA[carte, scrisă, Danielle Steele]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Book .
        ?uri dbo:author res:Danielle_Steel .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="8" onlydbo="false">
<string lang="en"><![CDATA[Which states of Germany are governed by the Social Democratic Party?]]></string>
<string lang="de"><![CDATA[Welche Bundesländer in Deutschland werden von der SPD regiert?]]></string>
<string lang="es"><![CDATA[¿En qué estados federales de Alemania gobierna la SPD?]]></string>
<string lang="it"><![CDATA[In quali stati federati della Germania governa il Partito Socialista Democratico?]]></string>
<string lang="fr"><![CDATA[Quels sont les états d'Allemagne gouvernés par le parti social-démocrate d'Allemagne?]]></string>
<string lang="nl"><![CDATA[In welke Duitse deelstaten is de SPD aan de macht?]]></string>
<string lang="ro"><![CDATA[Ce state germane sunt guvernate de Partidul Social Democrat?]]></string>
<keywords lang="en"><![CDATA[state, Germany, govern, Social Democratic Party]]></keywords>
<keywords lang="de"><![CDATA[Deutschland, Bundesland, regieren, SPD]]></keywords>
<keywords lang="es"><![CDATA[estado federal, Alemania, gobierna, SPD]]></keywords>
<keywords lang="it"><![CDATA[stato federato, Germania, governo, Partito Socialista Democratico]]></keywords>
<keywords lang="fr"><![CDATA[états d'Allemagne, parti social-démocrate d'Allemagne, gouvernés]]></keywords>
<keywords lang="nl"><![CDATA[Duitse deelstaat, SPD, aan de macht]]></keywords>
<keywords lang="ro"><![CDATA[stat, Germania, guverna, Partidul Social Democrat]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
          ?uri rdf:type yago:StatesOfGermany .
        { ?uri dbo:leaderParty res:Social_Democratic_Party_of_Germany . }
        UNION
        { ?uri dbp:rulingParty 'SPD'@en . } 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="80" onlydbo="true">
<string lang="en"><![CDATA[Give me all Canadian Grunge record labels.]]></string>
<string lang="de"><![CDATA[Gib mir alle kanadischen Grunge-Plattenfirmen.]]></string>
<string lang="es"><![CDATA[Dame todos las empresas canadienses productoras de música Grunge.]]></string>
<string lang="it"><![CDATA[Dammi tutti i produttori canadesi di musica Grunge.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les labels discographiques canadiens de grunge.]]></string>
<string lang="nl"><![CDATA[Noem alle Canadese grunge-platenlabels.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate casele canadiene Grunge de înregistrări.]]></string>
<keywords lang="en"><![CDATA[record label, Canadian, Grunge]]></keywords>
<keywords lang="de"><![CDATA[kanadisch, Plattenfirma, Grunge]]></keywords>
<keywords lang="es"><![CDATA[empresa productora de música, canadiense, Grunge]]></keywords>
<keywords lang="it"><![CDATA[produttore di musica, canadese, Grunge]]></keywords>
<keywords lang="fr"><![CDATA[labels discographiques, canadiens, grunge]]></keywords>
<keywords lang="nl"><![CDATA[Canadees, platenlabel, Grunge]]></keywords>
<keywords lang="ro"><![CDATA[casă de înregistrări, canadian, Grunge]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:RecordLabel .
        ?uri dbo:genre res:Grunge .
        ?uri dbo:country res:Canada .
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="81" onlydbo="false">
<string lang="en"><![CDATA[Which country has the most official languages?]]></string>
<string lang="de"><![CDATA[Welches Land hat die meisten Amtssprachen?]]></string>
<string lang="es"><![CDATA[¿Qué país tiene más idiomas oficiales?]]></string>
<string lang="it"><![CDATA[Quale stato ha più lingue ufficiali?]]></string>
<string lang="fr"><![CDATA[Quels pays a le plus de langues officielles?]]></string>
<string lang="nl"><![CDATA[Welk land heeft de meeste officiële talen.]]></string>
<string lang="ro"><![CDATA[Ce țară are cele mai multe limbi oficiale?]]></string>
<keywords lang="en"><![CDATA[country, official language, most]]></keywords>
<keywords lang="de"><![CDATA[Land, Amtssprache, die meisten]]></keywords>
<keywords lang="es"><![CDATA[país, idiomas oficiales, más]]></keywords>
<keywords lang="it"><![CDATA[stato, lingue ufficiali, più]]></keywords>
<keywords lang="fr"><![CDATA[pays, plus de langues officielles]]></keywords>
<keywords lang="nl"><![CDATA[land, officiële taal, meeste]]></keywords>
<keywords lang="ro"><![CDATA[șară, limbă oficială, cele mai multe]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Country  .
        ?uri dbp:officialLanguages ?language .
} 
ORDER BY DESC(COUNT(?language)) 
OFFSET 0 LIMIT 1
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="82" onlydbo="true">
<string lang="en"><![CDATA[In which programming language is GIMP written?]]></string>
<string lang="de"><![CDATA[In welcher Programmiersprache wurde GIMP geschrieben?]]></string>
<string lang="es"><![CDATA[¿En qué lenguaje de programación esta programado GIMP?]]></string>
<string lang="it"><![CDATA[In quale linguaggio di programmazione è scritto GIMP?]]></string>
<string lang="fr"><![CDATA[En quel langage de programmation a été écrit GIMP?]]></string>
<string lang="nl"><![CDATA[In welke programmeertaal is GIMP geschreven?]]></string>
<string lang="ro"><![CDATA[În ce limbaj de programare este scris GIMP?]]></string>
<keywords lang="en"><![CDATA[GIMP, programming language]]></keywords>
<keywords lang="de"><![CDATA[GIMP, Programmiersprache]]></keywords>
<keywords lang="es"><![CDATA[GIMP, lenguaje de programación]]></keywords>
<keywords lang="it"><![CDATA[GIMP, linguaggio di programmazione]]></keywords>
<keywords lang="fr"><![CDATA[langage de programmation, GIMP]]></keywords>
<keywords lang="nl"><![CDATA[GIMP, programmeertaal]]></keywords>
<keywords lang="ro"><![CDATA[GIMP, limbaj de programare]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        res:GIMP dbo:programmingLanguage ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="83" onlydbo="true">
<string lang="en"><![CDATA[Who produced films starring Natalie Portman?]]></string>
<string lang="de"><![CDATA[Wer produzierte Filme, in denen Natalie Portman mitspielt?]]></string>
<string lang="es"><![CDATA[¿Quién ha producido películas en las que actua Natalie Portman?]]></string>
<string lang="it"><![CDATA[Chi ha prodotto i film in cui recita Natalie Portman?]]></string>
<string lang="fr"><![CDATA[Qui a produit des films dans lesquels joue Natalie Portman?]]></string>
<string lang="nl"><![CDATA[Wie produceerde films waarin Natalie Portman speelde?]]></string>
<string lang="ro"><![CDATA[Cine a produs filme cu Natalie Portman în rol principal?]]></string>
<keywords lang="en"><![CDATA[produce, film, starring, Natalie Portman]]></keywords>
<keywords lang="de"><![CDATA[produzieren, Film, mitspielen, Natalie Portman]]></keywords>
<keywords lang="es"><![CDATA[producente, perlículas, actua, Natalie Portman]]></keywords>
<keywords lang="it"><![CDATA[produttore, film, recita, Natalie Portman]]></keywords>
<keywords lang="fr"><![CDATA[produit, films, Natalie Portman]]></keywords>
<keywords lang="nl"><![CDATA[producent, film, Natalie Portman, speelt]]></keywords>
<keywords lang="ro"><![CDATA[produce, film, rol principal, Natalie Portman]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?film rdf:type dbo:Film .
        ?film dbo:starring res:Natalie_Portman .
        ?film dbo:producer ?uri .
}
]]></query>
</question>

