<?xml version="1.0"?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="190" onlydbo="false">
<string lang="en"><![CDATA[Where is the residence of the prime minister of Spain?]]></string>
<string lang="de"><![CDATA[Wo wohnt der Premierminister von Spanien?]]></string>
<string lang="es"><![CDATA[¿Dónde vive el primer ministor de España?]]></string>
<string lang="it"><![CDATA[Dove vive il primo ministro della Spagna?]]></string>
<string lang="fr"><![CDATA[Où se trouve la résidence du Premier Ministre d'Espagne?]]></string>
<string lang="nl"><![CDATA[Waar woont de premier van Spanje?]]></string>
<string lang="ro"><![CDATA[Unde este reședința primului ministru al Spaniei?]]></string>
<keywords lang="en"><![CDATA[prime minister, Spain, residence]]></keywords>
<keywords lang="de"><![CDATA[Premierminister, Spanien, wohnen]]></keywords>
<keywords lang="es"><![CDATA[primer ministro, España, vive]]></keywords>
<keywords lang="it"><![CDATA[primo ministro, Spagna, vivere]]></keywords>
<keywords lang="fr"><![CDATA[résidence, Premier Ministre d'Espagne]]></keywords>
<keywords lang="nl"><![CDATA[woont, premier van Spanje]]></keywords>
<keywords lang="ro"><![CDATA[prim ministru, Spania, reședință]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:Prime_Minister_of_Spain dbp:residence ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Palace_of_Moncloa]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="191" onlydbo="false">
<string lang="en"><![CDATA[Which U.S. state has the abbreviation MN?]]></string>
<string lang="de"><![CDATA[Welcher US-Bundesstaat hat die Abkürzung MN?]]></string>
<string lang="es"><![CDATA[¿Qué estado americano tiene la abreviación MN?]]></string>
<string lang="it"><![CDATA[Quale stato americano è abbreviato MN?]]></string>
<string lang="fr"><![CDATA[Quel état americain a l'abréviation MN?]]></string>
<string lang="nl"><![CDATA[Welke staat van de Verenigde Staten heeft de afkorting MN?]]></string>
<string lang="ro"><![CDATA[Care stat American este abreviat MN?]]></string>
<keywords lang="en"><![CDATA[U.S. state, abbreviation, MN]]></keywords>
<keywords lang="de"><![CDATA[US-Bundesstaat, Abkürzung, MN]]></keywords>
<keywords lang="es"><![CDATA[estado americano, abreviación, MN]]></keywords>
<keywords lang="it"><![CDATA[stato americano, abbreviazione, MN]]></keywords>
<keywords lang="fr"><![CDATA[état americain, abréviation, MN]]></keywords>
<keywords lang="nl"><![CDATA[staat van de Verenigde Staten, afkorting, MN]]></keywords>
<keywords lang="ro"><![CDATA[stat american, abreviere, MN]]></keywords>
<query><![CDATA[
PREFIX dbp:  <http://dbpedia.org/property/>
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type yago:StatesOfTheUnitedStates .
        ?uri dbp:postalabbreviation 'MN'@en .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Minnesota]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="192" onlydbo="true">
<string lang="en"><![CDATA[Show me all songs from Bruce Springsteen released between 1980 and 1990.]]></string>
<string lang="de"><![CDATA[Zeige mir alle Lieder von Bruce Springsteen, die zwischen 1980 und 1990 herausgebracht wurden.]]></string>
<string lang="es"><![CDATA[¿Enseñame todas las canciones de Bruce Springsteen que aparecieron entre 1980 y 1990.]]></string>
<string lang="it"><![CDATA[Dammi tutte le canzoni di Bruce Springsteen rilasciate tra il 1980 e il 1990.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les morceaux de Bruce Springsteen qui ont été publiés entre 1980 et 1990.]]></string>
<string lang="nl"><![CDATA[Geef alle songs van Bruce Springsteen die werden uitgebracht tussen 1980 en 1990.]]></string>
<string lang="ro"><![CDATA[Arată-mi toate melodiile de Bruce Springsten apărute între 1980 și 1990]]></string>
<keywords lang="en"><![CDATA[song, Bruce Springsteen, release, between 1980 and 1990]]></keywords>
<keywords lang="de"><![CDATA[Lied, Bruce Springsteen, herausbringen, zwischen 1980 und 1990]]></keywords>
<keywords lang="es"><![CDATA[canción, Bruce Springsteen, aparecida entre 1980 y 1990]]></keywords>
<keywords lang="it"><![CDATA[canzone, Bruce Springsteen, rilasciare, tra il 1980 e il 1990]]></keywords>
<keywords lang="fr"><![CDATA[morceaux, Bruce Springsteen, publiés entre 1980 et 1990]]></keywords>
<keywords lang="nl"><![CDATA[song, Bruce Springsteen, uitgebracht tussen 1980 en 1990]]></keywords>
<keywords lang="ro"><![CDATA[melodie, Bruce Springsteen, apărut, între 1980 și 1990]]></keywords>
<query><![CDATA[
PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Song .
        ?uri dbo:artist res:Bruce_Springsteen .
        ?uri dbo:releaseDate ?date . 
        FILTER (?date >= '1980-01-01'^^xsd:date && ?date <= '1990-12-31'^^xsd:date)
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/No_Surrender_(song)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bobby_Jean]]></answer><answer><![CDATA[http://dbpedia.org/resource/Downbound_Train]]></answer><answer><![CDATA[http://dbpedia.org/resource/Darlington_County_(song)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Johnny_99_(song)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Working_on_the_Highway]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="193" onlydbo="false">
<string lang="en"><![CDATA[Which movies did Kurosawa direct?]]></string>
<string lang="de"><![CDATA[Welche Filme hat Kurosawa gedreht?]]></string>
<string lang="es"><![CDATA[¿Qué películas ha rodado Kurosawa?]]></string>
<string lang="it"><![CDATA[Che film ha diretto Kurosawa?]]></string>
<string lang="fr"><![CDATA[Quels films ont été realisés par Kurosawa?]]></string>
<string lang="nl"><![CDATA[Welke films heeft Kurosawa geregisseerd?]]></string>
<string lang="ro"><![CDATA[Ce filme a regizat Kurosawa?]]></string>
<keywords lang="en"><![CDATA[film, direct, Kurosawa]]></keywords>
<keywords lang="de"><![CDATA[Film, drehen, Kurosawa]]></keywords>
<keywords lang="es"><![CDATA[película, rodada, Kurosawa?]]></keywords>
<keywords lang="it"><![CDATA[film, dirigere, Kurosawa]]></keywords>
<keywords lang="fr"><![CDATA[films, Kurosawa]]></keywords>
<keywords lang="nl"><![CDATA[film, Kurosawa, regisseur]]></keywords>
<keywords lang="ro"><![CDATA[film, regiza, Kurosawa]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:director res:Akira_Kurosawa .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Seven_Samurai]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ran_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Throne_of_Blood]]></answer><answer><![CDATA[http://dbpedia.org/resource/Horse_(1941_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sanjuro]]></answer><answer><![CDATA[http://dbpedia.org/resource/Yojimbo_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Drunken_Angel]]></answer><answer><![CDATA[http://dbpedia.org/resource/High_and_Low_(1963_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Bad_Sleep_Well]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rashomon]]></answer><answer><![CDATA[http://dbpedia.org/resource/Scandal_(1950_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sanshiro_Sugata]]></answer><answer><![CDATA[http://dbpedia.org/resource/Madadayo]]></answer><answer><![CDATA[http://dbpedia.org/resource/No_Regrets_for_Our_Youth]]></answer><answer><![CDATA[http://dbpedia.org/resource/One_Wonderful_Sunday]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rhapsody_in_August]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dreams_(1990_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Red_Beard]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Hidden_Fortress]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dodes'ka-den]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kagemusha]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Quiet_Duel]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sanshiro_Sugata_Part_II]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Most_Beautiful]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Idiot_(1951_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/I_Live_in_Fear]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dersu_Uzala_(1975_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Lower_Depths_(1957_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Stray_Dog_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Men_Who_Tread_on_the_Tiger's_Tail]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ikiru]]></answer><answer><![CDATA[http://dbpedia.org/resource/Those_Who_Make_Tomorrow]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="194" onlydbo="false">
<string lang="en"><![CDATA[What is the founding year of the brewery that produces Pilsner Urquell?]]></string>
<string lang="de"><![CDATA[In welchem Jahr wurde die Brauerei gegründet, die Pilsner Urquell herstellt?]]></string>
<string lang="es"><![CDATA[¿En qué año fue fundada la cervecería que produce Pilsner Urquell?]]></string>
<string lang="it"><![CDATA[In che anno è stato fondato il birrificio che produce la Pilsner Urquell?]]></string>
<string lang="fr"><![CDATA[Quelle est l'année de fondation de la brasserie qui produit Pilsner Urquell?]]></string>
<string lang="nl"><![CDATA[Wanneer werd de brouwerij opgericht die Pilsner Urquell produceert?]]></string>
<string lang="ro"><![CDATA[Care este anul înființării berăriei ce produce Pilsner Urquell?]]></string>
<keywords lang="en"><![CDATA[Pilsner Urquell, brewery, founding year]]></keywords>
<keywords lang="de"><![CDATA[Pilsner Urquell, Brauerei, gründen]]></keywords>
<keywords lang="es"><![CDATA[Pilsner Urquell, cervecería, fundada]]></keywords>
<keywords lang="it"><![CDATA[Pilsner Urquell, birrificio, anno di fondazione]]></keywords>
<keywords lang="fr"><![CDATA[année de fondation, brasserie, produit, Pilsner Urquell]]></keywords>
<keywords lang="nl"><![CDATA[brouwerij, opgericht, produceert, Pilsner Urquell]]></keywords>
<keywords lang="ro"><![CDATA[Pilsner Urquell, berărie, anul înființării]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num 
WHERE {
        res:Pilsner_Urquell dbp:brewery ?uri .
        ?uri dbp:foundation ?num .
}
]]></query>
<answers><answer><![CDATA[1842]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="195" onlydbo="false">
<string lang="en"><![CDATA[Who wrote the lyrics for the Polish national anthem?]]></string>
<string lang="de"><![CDATA[Wer schrieb den Text für die polnische Nationalhymne?]]></string>
<string lang="es"><![CDATA[¿Quién escribió el texto del himno de Polonia?]]></string>
<string lang="it"><![CDATA[Chi ha scritto il testo dell'inno nazionale polacco?]]></string>
<string lang="fr"><![CDATA[Qui a écrit le texte de l'hymne nationale de la Pologne?]]></string>
<string lang="nl"><![CDATA[Wie schreef het Poolse volkslied?]]></string>
<string lang="ro"><![CDATA[Cine a scris versurile pentru imnul național al Poloniei?]]></string>
<keywords lang="en"><![CDATA[Poland, national anthem, write, lyrics]]></keywords>
<keywords lang="de"><![CDATA[Polen, Nationalhymne, schreiben, Text]]></keywords>
<keywords lang="es"><![CDATA[texto, escribió, himno, Polonia]]></keywords>
<keywords lang="it"><![CDATA[Polonia, inno nazionale, scrivere, testo]]></keywords>
<keywords lang="fr"><![CDATA[texte, hymne nationale, Pologne, auteur]]></keywords>
<keywords lang="nl"><![CDATA[volkslied, Polen, componist]]></keywords>
<keywords lang="ro"><![CDATA[Polonia, imn national, scrie, versuri]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:Poland dbo:anthem ?x .
        ?x dbp:author ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/J%C3%B3zef_Wybicki]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="string" id="196" onlydbo="true">
<string lang="en"><![CDATA[Give me all B-sides of the Ramones.]]></string>
<string lang="de"><![CDATA[Gib mir alle B-Seiten der Ramones.]]></string>
<string lang="es"><![CDATA[Dame todas las caras B de los Ramones.]]></string>
<string lang="it"><![CDATA[Dammi tutti i lati B dei Ramones.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les faces B des Ramones.]]></string>
<string lang="nl"><![CDATA[Geef alle B-kantjes van singles van de Ramones.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate laturile B ale Ramones]]></string>
<keywords lang="en"><![CDATA[Ramones, B-sides]]></keywords>
<keywords lang="de"><![CDATA[Ramones, B-Seiten]]></keywords>
<keywords lang="es"><![CDATA[Ramones, cara B]]></keywords>
<keywords lang="it"><![CDATA[Ramones, lato B]]></keywords>
<keywords lang="fr"><![CDATA[faces B, Ramones]]></keywords>
<keywords lang="nl"><![CDATA[B-kant, single, de Ramones]]></keywords>
<keywords lang="ro"><![CDATA[Ramones, laturi B]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?string 
WHERE {
        ?x dbo:musicalArtist res:Ramones .
        ?x dbo:bSide ?string . 
}
]]></query>
<answers><answer><![CDATA["Daytime Dilemma (Dangers of Love)"]]></answer><answer><![CDATA["Go Home Ann" (12" only)]]></answer><answer><![CDATA["Babysitter"]]></answer><answer><![CDATA["No-One Could Ever Love You More" (Norway)]]></answer><answer><![CDATA["Saturday Night Out"]]></answer><answer><![CDATA["She's the One"]]></answer><answer><![CDATA[Censorshit]]></answer><answer><![CDATA["Do You Wanna Dance?"]]></answer><answer><![CDATA["I Don't Care"]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="197" onlydbo="false">
<string lang="en"><![CDATA[Who painted The Storm on the Sea of Galilee?]]></string>
<string lang="de"><![CDATA[Wer malte Christus im Sturm auf dem See von Galilea?]]></string>
<string lang="es"><![CDATA[¿Quién pintó el Cristo en la tormenta en el lago de Galilea?]]></string>
<string lang="it"><![CDATA[Chi dipinse il Cristo nella tempesta sul mare di Galilea?]]></string>
<string lang="fr"><![CDATA[Qui a peint Christ dans la tempête sur la mer de Galilée?]]></string>
<string lang="nl"><![CDATA[Wie schilderde Christus in de storm op het meer van Galilea?]]></string>
<string lang="ro"><![CDATA[Cine a pictat Furtuna pe Marea Galileii?]]></string>
<keywords lang="en"><![CDATA[The Storm on the Sea of Galilee, paint]]></keywords>
<keywords lang="de"><![CDATA[Christus im Sturm auf dem See von Galilea, malen]]></keywords>
<keywords lang="es"><![CDATA[Cristo en la tormenta en el lago de Galilea, pintor]]></keywords>
<keywords lang="it"><![CDATA[Cristo nella tempesta sul mare di Galilea, pittore]]></keywords>
<keywords lang="fr"><![CDATA[peintre, Christ dans la tempête sur la mer de Galilée]]></keywords>
<keywords lang="nl"><![CDATA[schilder, Christus in de storm op het meer van Galilea]]></keywords>
<keywords lang="ro"><![CDATA[Furtuna pe Marea Galileii, picta]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:The_Storm_on_the_Sea_of_Galilee dbo:author ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Rembrandt]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="198" onlydbo="true">
<string lang="en"><![CDATA[Which country does the creator of Miffy come from?]]></string>
<string lang="de"><![CDATA[Aus welchem Land kommt der Erfinder von Nijntje?]]></string>
<string lang="es"><![CDATA[¿De qué país viene el creador de Nijntje?]]></string>
<string lang="it"><![CDATA[Da quale stato proviene il creatore di Miffy?]]></string>
<string lang="fr"><![CDATA[De quel pays vient le créateur de Miffy?]]></string>
<string lang="nl"><![CDATA[Uit welk land komt de bedenker van Nijntje?]]></string>
<string lang="ro"><![CDATA[ Din ce țara provine creatorul Miffy?]]></string>
<keywords lang="en"><![CDATA[Miffy, creator, country]]></keywords>
<keywords lang="de"><![CDATA[Nijntje, Erfinder, Land]]></keywords>
<keywords lang="es"><![CDATA[Njintje, creados, país]]></keywords>
<keywords lang="it"><![CDATA[Miffy, creatore, nazione]]></keywords>
<keywords lang="fr"><![CDATA[pays, créateur, Miffy]]></keywords>
<keywords lang="nl"><![CDATA[Nijntje, bedenker, nationaliteit]]></keywords>
<keywords lang="ro"><![CDATA[Miffy, creator, țară]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:Miffy dbo:creator ?x .
        ?x dbo:nationality ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Netherlands]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="199" onlydbo="true">
<string lang="en"><![CDATA[For which label did Elvis record his first album?]]></string>
<string lang="de"><![CDATA[Welche Plattenfirma hat Elvis' erstes Album aufgenommen?]]></string>
<string lang="es"><![CDATA[¿Qué discográfica grabó el primer album de Elvis?]]></string>
<string lang="it"><![CDATA[Quale casa discografica ha inciso il primo album di Elvis?]]></string>
<string lang="fr"><![CDATA[Quel est le label discographe qui a publié le premier disque d'Elvis?]]></string>
<string lang="nl"><![CDATA[Bij welk platenlabel verscheen het eerste album van Elvis Presley?]]></string>
<string lang="ro"><![CDATA[Ce casă discografică a înregistrat primul album al lui Elvis?]]></string>
<keywords lang="en"><![CDATA[Elvis, first, album, label]]></keywords>
<keywords lang="de"><![CDATA[Elvis, erstes, Album, Plattenfirma]]></keywords>
<keywords lang="es"><![CDATA[discográfica, primer album de Elvis]]></keywords>
<keywords lang="it"><![CDATA[Elvis, primo, album, casa discografica]]></keywords>
<keywords lang="fr"><![CDATA[label discographe, publié, premier disque, Elvis]]></keywords>
<keywords lang="nl"><![CDATA[platenlabel, eerste album, Elvis]]></keywords>
<keywords lang="ro"><![CDATA[Elvis, prim, album, casă discografică]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?x rdf:type dbo:Album .
        ?x dbo:artist res:Elvis_Presley .
        ?x dbo:releaseDate ?y .
        ?x dbo:recordLabel ?uri .
}
ORDER BY ASC(?y) 
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Pickwick_Records]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="date" id="2" onlydbo="true">
<string lang="en"><![CDATA[Give me the birthdays of all actors of the television show Charmed.]]></string>
<string lang="de"><![CDATA[Gib mir die Geburtstage von allen Darstellern der Fernsehserie Charmed.]]></string>
<string lang="es"><![CDATA[Dame los cumpleaños de los actores de la serie de televisión Charmed.]]></string>
<string lang="it"><![CDATA[Dammi le date dei compleanni di tutti gli attori della serie televisiva Charmed.]]></string>
<string lang="fr"><![CDATA[Donnes-moi les dates de naissance des acteurs de la série télévisée Charmed.]]></string>
<string lang="nl"><![CDATA[Noem de verjaardag van alle acteurs uit de televisieserie Charmed.]]></string>
<string lang="ro"><![CDATA[Dă-mi zilele de naștere a tuturor actorilor din serialul de televiziune Charmed]]></string>
<keywords lang="en"><![CDATA[television show, Charmed, actor, birthday]]></keywords>
<keywords lang="de"><![CDATA[Fernsehserie, Charmed, Darsteller, Geburtstag]]></keywords>
<keywords lang="es"><![CDATA[serie televisiva, Charmed, actores, cumpleaños]]></keywords>
<keywords lang="it"><![CDATA[serie televisiva, Charmed, attore, compleanno]]></keywords>
<keywords lang="fr"><![CDATA[série télévisée, Charmed, acteurs, date de naissance]]></keywords>
<keywords lang="nl"><![CDATA[verjaardag, acteur, televisieserie, Charmed]]></keywords>
<keywords lang="ro"><![CDATA[serial de televiziune, Charmed, actor, zi de naștere]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE { 
        res:Charmed dbo:starring ?actor .
        ?actor dbo:birthDate ?date .
}
]]></query>
<answers><answer><![CDATA[1985-11-30+02:00]]></answer><answer><![CDATA[1971-01-26+02:00]]></answer><answer><![CDATA[1973-12-03+02:00]]></answer><answer><![CDATA[1969-02-01+02:00]]></answer><answer><![CDATA[1969-02-08+02:00]]></answer><answer><![CDATA[1980-05-19+02:00]]></answer><answer><![CDATA[1968-07-27+02:00]]></answer><answer><![CDATA[1965-10-01+02:00]]></answer><answer><![CDATA[1971-04-12+02:00]]></answer><answer><![CDATA[1973-09-05+02:00]]></answer><answer><![CDATA[1972-12-19+02:00]]></answer><answer><![CDATA[1973-06-15+02:00]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="20" onlydbo="true">
<string lang="en"><![CDATA[How many employees does IBM have?]]></string>
<string lang="de"><![CDATA[Wieviele Angestellte hat IBM?]]></string>
<string lang="es"><![CDATA[¿Cuántos empleados tiene IBM?]]></string>
<string lang="it"><![CDATA[Quanti dipendenti ha IBM?]]></string>
<string lang="fr"><![CDATA[Combien d'employés a IBM?]]></string>
<string lang="nl"><![CDATA[Hoeveel medewerkers heeft IBM?]]></string>
<string lang="ro"><![CDATA[Câți angajați are IBM?]]></string>
<keywords lang="en"><![CDATA[IBM, employees]]></keywords>
<keywords lang="de"><![CDATA[IBM, Angestellte]]></keywords>
<keywords lang="es"><![CDATA[IBM, empleados]]></keywords>
<keywords lang="it"><![CDATA[IBM, dipendenti]]></keywords>
<keywords lang="fr"><![CDATA[employés, IBM]]></keywords>
<keywords lang="nl"><![CDATA[medewerkers, IBM]]></keywords>
<keywords lang="ro"><![CDATA[IBM, angajați]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?number 
WHERE {
        res:IBM dbo:numberOfEmployees ?number .
}
]]></query>
<answers><answer><![CDATA[431212]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="21" onlydbo="false">
<string lang="en"><![CDATA[Which states border Illinois?]]></string>
<string lang="de"><![CDATA[Welche Staaten grenzen an Illinois?]]></string>
<string lang="es"><![CDATA[¿Qué estados tienen frontera con Illinois?]]></string>
<string lang="it"><![CDATA[Con quali stati confina l'Illinois?]]></string>
<string lang="fr"><![CDATA[Quels sont les états voisins de l'Illinois?]]></string>
<string lang="nl"><![CDATA[Welke staten grenzen aan Illinois?]]></string>
<string lang="ro"><![CDATA[Ce state formează granite cu Illinois?]]></string>
<keywords lang="en"><![CDATA[state, border, Illinois]]></keywords>
<keywords lang="de"><![CDATA[Staat, angrenzen, Illinois]]></keywords>
<keywords lang="es"><![CDATA[estado, frontera, Illinois]]></keywords>
<keywords lang="it"><![CDATA[stati, confine, Illinois]]></keywords>
<keywords lang="fr"><![CDATA[états voisins, Illinois]]></keywords>
<keywords lang="nl"><![CDATA[staat, grenzen aan, Illinois]]></keywords>
<keywords lang="ro"><![CDATA[stat, granite, Illinois]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri 
WHERE {
        res:Illinois dbp:borderingstates ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Wisconsin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kentucky]]></answer><answer><![CDATA[http://dbpedia.org/resource/Missouri]]></answer><answer><![CDATA[http://dbpedia.org/resource/Indiana]]></answer><answer><![CDATA[http://dbpedia.org/resource/Iowa]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="22" onlydbo="true">
<string lang="en"><![CDATA[In which country is the Limerick Lake?]]></string>
<string lang="de"><![CDATA[In welchem Land befindet sich der Limerick Lake?]]></string>
<string lang="es"><![CDATA[¿En qué país se encuentra el lago Limerick?]]></string>
<string lang="it"><![CDATA[In quale stato si trova il lago Limerick?]]></string>
<string lang="fr"><![CDATA[Dans quel pays se trouve le lac Limerick?]]></string>
<string lang="nl"><![CDATA[In welk land ligt Limerick Lake?]]></string>
<string lang="ro"><![CDATA[În ce țară este lacul Limerick?]]></string>
<keywords lang="en"><![CDATA[Limerick Lake, country]]></keywords>
<keywords lang="de"><![CDATA[Limerick Lake, Land]]></keywords>
<keywords lang="es"><![CDATA[lago Limerick, país]]></keywords>
<keywords lang="it"><![CDATA[lago Limerick, stato]]></keywords>
<keywords lang="fr"><![CDATA[pays, lac Limerick]]></keywords>
<keywords lang="nl"><![CDATA[Limerick Lake, land]]></keywords>
<keywords lang="ro"><![CDATA[lacul Limerick, țară]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        res:Limerick_Lake dbo:country ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Canada]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="23" onlydbo="true">
<string lang="en"><![CDATA[Which television shows were created by John Cleese?]]></string>
<string lang="de"><![CDATA[Welche Fernsehserien hat John Cleese entworfen?]]></string>
<string lang="es"><![CDATA[¿Qué series televisivas ideó John Cleese?]]></string>
<string lang="it"><![CDATA[Quali serie televisive sono state create dalla John Cleese?]]></string>
<string lang="fr"><![CDATA[Quelles séries télevisées ont été créées par John Cleese?]]></string>
<string lang="nl"><![CDATA[Welke televisieseries werden bedacht door John Cleese?]]></string>
<string lang="ro"><![CDATA[Ce seriale de televiziune au fost create de John Cleese?]]></string>
<keywords lang="en"><![CDATA[television show, create, John Cleese]]></keywords>
<keywords lang="de"><![CDATA[Fernsehserie, entwerfen, John Cleese]]></keywords>
<keywords lang="es"><![CDATA[serie televisica, ideó, John Cleese]]></keywords>
<keywords lang="it"><![CDATA[serie televisiva, ideata, John Cleese?]]></keywords>
<keywords lang="fr"><![CDATA[séries télevisées, créées, John Cleese]]></keywords>
<keywords lang="nl"><![CDATA[televisieserie, bedacht, John Cleese]]></keywords>
<keywords lang="ro"><![CDATA[serial de televiziune, creat, John Cleese]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:TelevisionShow .
        ?uri dbo:creator res:John_Cleese .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Python_Night_%E2%80%93_30_Years_of_Monty_Python]]></answer><answer><![CDATA[http://dbpedia.org/resource/Fawlty_Towers]]></answer><answer><![CDATA[http://dbpedia.org/resource/Monty_Python's_Flying_Circus]]></answer><answer><![CDATA[http://dbpedia.org/resource/At_Last_the_1948_Show]]></answer><answer><![CDATA[http://dbpedia.org/resource/Monty_Python's_Personal_Best]]></answer><answer><![CDATA[http://dbpedia.org/resource/Parrot_Sketch_Not_Included_%E2%80%93_20_Years_of_Monty_Python]]></answer><answer><![CDATA[http://dbpedia.org/resource/Monty_Python_Live_at_Aspen]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="25" onlydbo="true">
<string lang="en"><![CDATA[In which films directed by Garry Marshall was Julia Roberts starring?]]></string>
<string lang="de"><![CDATA[In welchem Filmen, bei denen Garry Marshall Regie geführt hat, hat Julia Roberts mitgespielt?]]></string>
<string lang="es"><![CDATA[¿En qué películas dirigidas por Garry Mashall actuó Julia Roberts?]]></string>
<string lang="it"><![CDATA[In quali film diretti da Garry Marshall recita Julia Roberts?]]></string>
<string lang="fr"><![CDATA[Dans quels films dirigés par Garry Marshall joue Julia Roberts?]]></string>
<string lang="nl"><![CDATA[In welke films die werden geregisseerd door Garry Marshall speelde Julia Roberts?]]></string>
<string lang="ro"><![CDATA[În ce filme regizate de Garry Marsall a jucat Julia Roberts roluri principale?]]></string>
<keywords lang="en"><![CDATA[film, directed, Garry Marshall, starring, Julia Roberts]]></keywords>
<keywords lang="de"><![CDATA[Film, Regie, Garry Marshall, mitspielen, Julia Roberts]]></keywords>
<keywords lang="es"><![CDATA[película, director, Garry Marshall, actuar, Julia Roberts]]></keywords>
<keywords lang="it"><![CDATA[film, regista, Garry Marshall, recitare, Julia Roberts]]></keywords>
<keywords lang="fr"><![CDATA[film, dirigés, Garry Marshall, joue Julia Roberts]]></keywords>
<keywords lang="nl"><![CDATA[film, regisseur, Garry Marshall, speelt, Julia Roberts]]></keywords>
<keywords lang="ro"><![CDATA[film, regizat, Garry Marshall, rol principal, Julia Roberts]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:starring res:Julia_Roberts .
        ?uri dbo:director res:Garry_Marshall .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Pretty_Woman]]></answer><answer><![CDATA[http://dbpedia.org/resource/Valentine's_Day_(2010_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Runaway_Bride_(1999_film)]]></answer></answers></question>

