<?xml version="1.0"?>
<dataset id="qald-5_train">

<question id="10" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[In which country does the Ganges start?]]></string>
<string lang="de"><![CDATA[In welchem Land entspringt der Ganges?]]></string>
<string lang="es"><![CDATA[¿En qué país nace el Ganges?]]></string>
<string lang="it"><![CDATA[In quale stato nasce il Gange?]]></string>
<string lang="fr"><![CDATA[Dans quel pays commence le Gange?]]></string>
<string lang="nl"><![CDATA[In welk land ontspringt de Ganges?]]></string>
<string lang="ro"><![CDATA[Din ce țară izvorăște Ganga?]]></string>
<keywords lang="en"><![CDATA[Ganges, start, country]]></keywords>
<keywords lang="de"><![CDATA[Ganges, entspringen, Land]]></keywords>
<keywords lang="es"><![CDATA[Ganges, país, orígen]]></keywords>
<keywords lang="it"><![CDATA[Gange, stato, origine]]></keywords>
<keywords lang="fr"><![CDATA[pays, commence, Gange]]></keywords>
<keywords lang="nl"><![CDATA[ontspringt, Ganges]]></keywords>
<keywords lang="ro"><![CDATA[Gangele, izvor, țară]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Ganges dbo:sourceCountry ?uri .
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/India]]></answer></answers></question>

<question id="101" onlydbo="true" answertype="resource" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Which German cities have more than 250000 inhabitants?]]></string>
<string lang="de"><![CDATA[Welche deutschen Städte haben mehr als 250000 Einwohner?]]></string>
<string lang="es"><![CDATA[¿Qué ciudades alemanas tienen más de 250000 habitantes?]]></string>
<string lang="it"><![CDATA[Quali città tedesche hanno più di 250000 abitanti?]]></string>
<string lang="fr"><![CDATA[Quelles villes allemandes ont plus de 250000 habitants?]]></string>
<string lang="nl"><![CDATA[Welke Duitse steden hebben meer dan 250000 inwoners?]]></string>
<string lang="ro"><![CDATA[Ce orașe germane au mai mult de 250000 de locuitori?]]></string>
<keywords lang="en"><![CDATA[city, Germany, inhabitants, more than 250000]]></keywords>
<keywords lang="de"><![CDATA[Stadt, Deutschland, Einwohner, mehr als 250000]]></keywords>
<keywords lang="es"><![CDATA[cuidad, Alemania, habitantes, más de 250000]]></keywords>
<keywords lang="it"><![CDATA[città, Germania, abitanti, più di 250000]]></keywords>
<keywords lang="fr"><![CDATA[villes, Allemagne, habitants, plus de 250000]]></keywords>
<keywords lang="nl"><![CDATA[stad, Duitsland, inwoners, meer dan 250000]]></keywords>
<keywords lang="ro"><![CDATA[oraș, Germania, locuitori, mai mult de 250000]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
       { ?uri rdf:type dbo:City . } 
       UNION 
       { ?uri rdf:type dbo:Town . } 
         ?uri dbo:country res:Germany . 
         ?uri dbo:populationTotal ?population . 
         FILTER ( ?population > 250000 ) } 
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Braunschweig]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dresden]]></answer><answer><![CDATA[http://dbpedia.org/resource/Wuppertal]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bonn]]></answer><answer><![CDATA[http://dbpedia.org/resource/Cologne]]></answer><answer><![CDATA[http://dbpedia.org/resource/Frankfurt]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hamburg]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hanover]]></answer><answer><![CDATA[http://dbpedia.org/resource/Munich]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nuremberg]]></answer><answer><![CDATA[http://dbpedia.org/resource/Duisburg]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bielefeld]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bochum]]></answer><answer><![CDATA[http://dbpedia.org/resource/Essen]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gelsenkirchen]]></answer><answer><![CDATA[http://dbpedia.org/resource/M%C3%B6nchengladbach]]></answer><answer><![CDATA[http://dbpedia.org/resource/Augsburg]]></answer><answer><![CDATA[http://dbpedia.org/resource/Wiesbaden]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aachen]]></answer><answer><![CDATA[http://dbpedia.org/resource/Leipzig]]></answer><answer><![CDATA[http://dbpedia.org/resource/Stuttgart]]></answer><answer><![CDATA[http://dbpedia.org/resource/Karlsruhe]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mannheim]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bremen]]></answer></answers></question>

<question id="102" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who was John F. Kennedy's vice president?]]></string>
<string lang="de"><![CDATA[Wer war der Vizepräsident unter John F. Kennedy?]]></string>
<string lang="es"><![CDATA[¿Quién fué el vicepresidente de John F. Kennedy?]]></string>
<string lang="it"><![CDATA[Chi fu il vicepresidente di John F. Kennedy?]]></string>
<string lang="fr"><![CDATA[Qui était le vice-président de John F. Kennedy?]]></string>
<string lang="nl"><![CDATA[Wie was de vicepresident onder John F. Kennedy?]]></string>
<string lang="ro"><![CDATA[Cine a fost vicepreședintele lui John F. Kennedy?]]></string>
<keywords lang="en"><![CDATA[John F. Kennedy, vice president]]></keywords>
<keywords lang="de"><![CDATA[John F. Kennedy, Vizepräsident]]></keywords>
<keywords lang="es"><![CDATA[John F. Kennedy, vicepresidente]]></keywords>
<keywords lang="it"><![CDATA[John F. Kennedy, vicepresidente]]></keywords>
<keywords lang="fr"><![CDATA[John F. Kennedy, vice-président]]></keywords>
<keywords lang="nl"><![CDATA[John F. Kennedy, vicepresident]]></keywords>
<keywords lang="ro"><![CDATA[John F. Kennedy, vicepreședinte]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { res:John_F._Kennedy dbo:vicePresident ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Lyndon_B._Johnson]]></answer></answers></question>

<question id="103" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who is the mayor of Berlin?]]></string>
<string lang="de"><![CDATA[Wer ist der Bürgermeister von Berlin?]]></string>
<string lang="es"><![CDATA[¿Quién es el alcalde de Berlin?]]></string>
<string lang="it"><![CDATA[Chi è il sindaco di Berlino?]]></string>
<string lang="fr"><![CDATA[Qui est le maire de Berlin?]]></string>
<string lang="nl"><![CDATA[Wie is de burgemeester van Berlijn?]]></string>
<string lang="ro"><![CDATA[Cine este primarul din Berlin?]]></string>
<keywords lang="en"><![CDATA[Berlin, mayor]]></keywords>
<keywords lang="de"><![CDATA[Berlin, Bürgermeister]]></keywords>
<keywords lang="es"><![CDATA[Berlin, alcalde]]></keywords>
<keywords lang="it"><![CDATA[Berlino, sindaco]]></keywords>
<keywords lang="fr"><![CDATA[Berlin, maire]]></keywords>
<keywords lang="nl"><![CDATA[Berlijn, burgemeester]]></keywords>
<keywords lang="ro"><![CDATA[Berlin, primar]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Berlin dbo:leader ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Klaus_Wowereit]]></answer></answers></question>

<question id="104" onlydbo="true" answertype="number" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[How many students does the Free University in Amsterdam have?]]></string>
<string lang="de"><![CDATA[Wieviele Studenten hat die Freie Universität in Amsterdam?]]></string>
<string lang="es"><![CDATA[¿Cuántos estudiantes tiene la Universidad Libre de Amsterdam?]]></string>
<string lang="it"><![CDATA[Quanti studenti ci sono nella Libera Università di Amsterdam?]]></string>
<string lang="fr"><![CDATA[Combien d'étudiants a l'université libre d'Amsterdam?]]></string>
<string lang="nl"><![CDATA[Hoeveel studenten heeft de Vrije Universiteit in Amsterdam?]]></string>
<string lang="ro"><![CDATA[Câți studenți are Universitatea Liberă din Amsterdam?]]></string>
<keywords lang="en"><![CDATA[Free University, Amsterdam, students]]></keywords>
<keywords lang="de"><![CDATA[Freie Universität, Amsterdam, Studenten]]></keywords>
<keywords lang="es"><![CDATA[Universidad Libre, Amsterdam, estudiantes]]></keywords>
<keywords lang="it"><![CDATA[Libera Università, Amsterdam, studenti]]></keywords>
<keywords lang="fr"><![CDATA[Université libre, Amsterdam, étudiants]]></keywords>
<keywords lang="nl"><![CDATA[Vrije Universiteit, Amsterdam, studenten]]></keywords>
<keywords lang="ro"><![CDATA[Universitatea Liberă, Amsterdam, studenți]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?num 
WHERE { 
        res:VU_University_Amsterdam dbo:numberOfStudents ?num . 
} 
]]>
</query>
<answers><answer><![CDATA[24500]]></answer></answers></question>

<question id="105" onlydbo="true" answertype="resource" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[What is the second highest mountain on Earth?]]></string>
<string lang="de"><![CDATA[Was ist der zweithöchste Berg der Erde?]]></string>
<string lang="es"><![CDATA[¿Cuál es la segunda montaña más alta de la tierra?]]></string>
<string lang="it"><![CDATA[Qual è la seconda montagna più alta sulla Terra?]]></string>
<string lang="fr"><![CDATA[Quelle est la deuxième plus haute montagne de la Terre?]]></string>
<string lang="nl"><![CDATA[Wat is de op één na hoogste berg ter wereld?]]></string>
<string lang="ro"><![CDATA[Care este al doilea cel mai înalt munte de pe Pământ?]]></string>
<keywords lang="en"><![CDATA[mountain, second highest]]></keywords>
<keywords lang="de"><![CDATA[Berg, zweithöchster]]></keywords>
<keywords lang="es"><![CDATA[montaña, seguna más alta]]></keywords>
<keywords lang="it"><![CDATA[montagna, seconda più alta]]></keywords>
<keywords lang="fr"><![CDATA[montagne, deuxième plus haute]]></keywords>
<keywords lang="nl"><![CDATA[berg, op één na hoogste]]></keywords>
<keywords lang="ro"><![CDATA[munte, al doilea cel mai înalt]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Mountain . 
        ?uri dbo:elevation ?elevation . 
} 
ORDER BY DESC(?elevation) 
OFFSET 1 LIMIT 1 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/K2]]></answer></answers></question>

<question id="106" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all professional skateboarders from Sweden.]]></string>
<string lang="de"><![CDATA[Gib mir alle Profiskateboarder aus Schweden.]]></string>
<string lang="es"><![CDATA[Dame todos las skateboarders profesionales de Suecia.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli skateboarders professionisti della Svezia.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les skateboarders professionnels de Suède.]]></string>
<string lang="nl"><![CDATA[Noem alle professionele skateboarders uit Zweden.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți skateboarderii profesioniști din Suedia.]]></string>
<keywords lang="en"><![CDATA[professional, skateboarder, Sweden]]></keywords>
<keywords lang="de"><![CDATA[Profiskateboarder, Schweden]]></keywords>
<keywords lang="es"><![CDATA[skateboarder profesional, Suecia]]></keywords>
<keywords lang="it"><![CDATA[skateboarders professionisti, Svezia]]></keywords>
<keywords lang="fr"><![CDATA[skateboarders professionnels, Suède]]></keywords>
<keywords lang="nl"><![CDATA[skateboarder, professioneel, Zweden]]></keywords>
<keywords lang="ro"><![CDATA[profesionist, skateboarder, Suedia]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:occupation res:Skateboarding . 
      { ?uri dbo:birthPlace res:Sweden . } 
      UNION 
      { ?uri dbo:birthPlace ?place . 
        ?place dbo:country res:Sweden . } 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Ali_Boulala]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tony_Magnusson]]></answer></answers></question>

<question id="107" onlydbo="false" answertype="date" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[When was Alberta admitted as province?]]></string>
<string lang="de"><![CDATA[Wann wurde die Provinz Alberta gegründet?]]></string>
<string lang="es"><![CDATA[¿Cúando fué fundada la provincia de Alberta?]]></string>
<string lang="it"><![CDATA[Quando Alberta è stata ammessa come provincia?]]></string>
<string lang="fr"><![CDATA[Quand a Alberta reçu le status de province?]]></string>
<string lang="nl"><![CDATA[Wanneer werd de provincie Alberta gesticht?]]></string>
<string lang="ro"><![CDATA[Când a fost Alberta recunoscută ca provincie?]]></string>
<keywords lang="en"><![CDATA[Alberta, admit, province]]></keywords>
<keywords lang="de"><![CDATA[Provinz, Alberta, gegründet]]></keywords>
<keywords lang="es"><![CDATA[provincia, Alberta, fundada]]></keywords>
<keywords lang="it"><![CDATA[Alberta, ammessa, provincia]]></keywords>
<keywords lang="fr"><![CDATA[Alberta, reçu, province]]></keywords>
<keywords lang="nl"><![CDATA[provincie, Alberta, gesticht]]></keywords>
<keywords lang="ro"><![CDATA[Alberta, recunoaște, provincie]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?date 
WHERE { 
        res:Alberta dbp:admittancedate ?date . 
} 
]]>
</query>
<answers><answer><![CDATA[1905-09-01+02:00]]></answer></answers></question>

<question id="108" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[To which countries does the Himalayan mountain system extend?]]></string>
<string lang="de"><![CDATA[Über welche Länder erstreckt sich der Himalaya?]]></string>
<string lang="es"><![CDATA[¿Por qué países se extiende el Himalaya?]]></string>
<string lang="it"><![CDATA[Su quali stati si estende la catena montuosa dell'Himalaya?]]></string>
<string lang="fr"><![CDATA[Quels sont les pays chevauchés par l'Himalaya?]]></string>
<string lang="nl"><![CDATA[Over welke landen strekt de Himalaya zich uit?]]></string>
<string lang="ro"><![CDATA[Peste ce țări se întinde lanțul munților Himalaya?]]></string>
<keywords lang="en"><![CDATA[Himalayan mountain system, extend, country]]></keywords>
<keywords lang="de"><![CDATA[Himalaya, erstrecken, Land]]></keywords>
<keywords lang="es"><![CDATA[Himalaya, extiende, países]]></keywords>
<keywords lang="it"><![CDATA[catena montuosa dell'Himalaya, estendersi, stati]]></keywords>
<keywords lang="fr"><![CDATA[Himalaya, chevauchés, pays]]></keywords>
<keywords lang="nl"><![CDATA[Himalaya, land, uitstrekken]]></keywords>
<keywords lang="ro"><![CDATA[lanțul munților Himalaya, întinde, țară]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Himalayas dbp:country ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/China]]></answer><answer><![CDATA[http://dbpedia.org/resource/India]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pakistan]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nepal]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bhutan]]></answer></answers></question>

<question id="11" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which countries have more than ten caves?]]></string>
<string lang="de"><![CDATA[In welchen Ländern gibt es mehr als zehn Höhlen?]]></string>
<string lang="es"><![CDATA[¿Qué países tienen más de diez cuevas?]]></string>
<string lang="it"><![CDATA[Quali nazioni hanno più di dieci grotte?]]></string>
<string lang="fr"><![CDATA[Quels pays ont plus de dix grottes?]]></string>
<string lang="nl"><![CDATA[Welke landen hebben meer dan tien grotten?]]></string>
<string lang="ro"><![CDATA[Ce țări au mai mult de zece peșteri?]]></string>
<keywords lang="en"><![CDATA[country, cave, more than ten]]></keywords>
<keywords lang="de"><![CDATA[Land, Höhle, mehr als zehn]]></keywords>
<keywords lang="es"><![CDATA[país, cuevas, más de diez]]></keywords>
<keywords lang="it"><![CDATA[nazione, grotta, più di dieci]]></keywords>
<keywords lang="fr"><![CDATA[pays, grottes, plus de dix]]></keywords>
<keywords lang="nl"><![CDATA[land, grotten, meer dan tien]]></keywords>
<keywords lang="ro"><![CDATA[țară, peșteră, mai mult de zece]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Country . 
        ?cave rdf:type dbo:Cave . 
      { ?cave dbo:location ?uri . } 
      UNION 
      { ?cave dbo:location ?loc . 
        ?loc dbo:country ?uri . } 
} 
GROUP BY ?uri 
HAVING(COUNT(?cave) > 10) 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/China]]></answer><answer><![CDATA[http://dbpedia.org/resource/England]]></answer><answer><![CDATA[http://dbpedia.org/resource/India]]></answer><answer><![CDATA[http://dbpedia.org/resource/Republic_of_Ireland]]></answer><answer><![CDATA[http://dbpedia.org/resource/Wales]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mexico]]></answer><answer><![CDATA[http://dbpedia.org/resource/United_Kingdom]]></answer><answer><![CDATA[http://dbpedia.org/resource/Italy]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jamaica]]></answer><answer><![CDATA[http://dbpedia.org/resource/United_States]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gibraltar]]></answer></answers></question>

<question id="110" onlydbo="false" answertype="number" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[What is the total amount of men and women serving in the FDNY?]]></string>
<string lang="de"><![CDATA[Wieviele Männer und Frauen arbeiten in der New Yorker Berufsfeuerwehr?]]></string>
<string lang="es"><![CDATA[¿Cúantos hombres y mujeres trabajan para los bomberos de Nueva York?]]></string>
<string lang="it"><![CDATA[Qual è il totale di uomini e donne che prestano servizio nel dipartimento dei vigili del fuoco di New York?]]></string>
<string lang="fr"><![CDATA[Combien d'hommes et femmes sont membres du corps des sapeurs-pompiers professionnels de New York?]]></string>
<string lang="nl"><![CDATA[Wat is het totale aantal vrouwen en mannen dat werkt bij de brandweer van New York?]]></string>
<string lang="ro"><![CDATA[Care este numărul total de bărbați și femei membri ai Departamentului de Pompieri din New York?]]></string>
<keywords lang="en"><![CDATA[total amount, men, women, serve, FDNY]]></keywords>
<keywords lang="de"><![CDATA[Männer, Frauen, arbeiten, New York, Berufsfeuerwehr]]></keywords>
<keywords lang="es"><![CDATA[hombres, mujeres, bomberos, Nueva York]]></keywords>
<keywords lang="it"><![CDATA[totale, uomini, donne, prestare servizio, dipartimento dei vigili del fuoco di New York]]></keywords>
<keywords lang="fr"><![CDATA[hommes, femmes, sapeurs-pompiers professionnels de New York]]></keywords>
<keywords lang="nl"><![CDATA[mannen, vrouwen, brandweer, New York]]></keywords>
<keywords lang="ro"><![CDATA[număr total, bărbați, femei, membri, Departamentul de Pompieri din New York]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?num 
WHERE { 
        res:New_York_City_Fire_Department dbp:employees ?num . 
} 
]]>
</query>
<answers><answer><![CDATA[15870]]></answer></answers></question>

<question id="200" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who produces Orangina?]]></string>
<string lang="de"><![CDATA[Wer stellt Orangina her?]]></string>
<string lang="es"><![CDATA[¿Quién produce Orangina?]]></string>
<string lang="it"><![CDATA[Chi produce l'Orangina?]]></string>
<string lang="fr"><![CDATA[Qui produit Orangina?]]></string>
<string lang="nl"><![CDATA[Wie is de producent van Orangina?]]></string>
<string lang="ro"><![CDATA[Cine produce Orangina?]]></string>
<keywords lang="en"><![CDATA[produce, Orangina]]></keywords>
<keywords lang="de"><![CDATA[herstellen, Orangina]]></keywords>
<keywords lang="es"><![CDATA[Orangina, productor]]></keywords>
<keywords lang="it"><![CDATA[Orangina, produttore]]></keywords>
<keywords lang="fr"><![CDATA[produire, Orangina]]></keywords>
<keywords lang="nl"><![CDATA[producent, Orangina]]></keywords>
<keywords lang="ro"><![CDATA[produce, Orangina]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:product res:Orangina . 
}
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/A.G._Barr]]></answer></answers></question>

<question id="111" onlydbo="true" answertype="resource" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Who is the Formula 1 race driver with the most races?]]></string>
<string lang="de"><![CDATA[Wer ist der Formel-1-Fahrer mit den meisten Rennen?]]></string>
<string lang="es"><![CDATA[¿Quién es el conductor de Formula 1 con más carreras?]]></string>
<string lang="it"><![CDATA[Qual è il pilota di Formula 1 con più gare?]]></string>
<string lang="fr"><![CDATA[Quel est le pilote de Formule 1 qui a gagné le plus de courses?]]></string>
<string lang="nl"><![CDATA[Wie is de Formule 1-coureur met de meeste races op zijn naam?]]></string>
<string lang="ro"><![CDATA[Cine este pilotul de curse Formula 1 cu cele mai multe curse?]]></string>
<keywords lang="en"><![CDATA[Formula 1, race driver, races, most]]></keywords>
<keywords lang="de"><![CDATA[Formel 1, Rennfahrer, Rennen, die meisten]]></keywords>
<keywords lang="es"><![CDATA[Fconductor, órmula 1, carreras, más]]></keywords>
<keywords lang="it"><![CDATA[Formula 1, pilota, maggior numero di gare]]></keywords>
<keywords lang="fr"><![CDATA[Formule 1, pilote, plus de courses]]></keywords>
<keywords lang="nl"><![CDATA[Formule 1, coureur, races, de meeste]]></keywords>
<keywords lang="ro"><![CDATA[Formula 1, pilot de curse, cele mai multe]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:FormulaOneRacer . 
        ?uri dbo:races ?x . 
} 
ORDER BY DESC(?x) 
OFFSET 0 LIMIT 1 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Rubens_Barrichello]]></answer></answers></question>

<question id="112" onlydbo="false" answertype="resource" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Give me all world heritage sites designated within the past two years.]]></string>
<string lang="de"><![CDATA[Gib mir alle Welterbestätten, die in den vergangenen zwei Jahren aufgenommen wurden.]]></string>
<string lang="es"><![CDATA[¿Qué patrimonios de la humanidad fueron reconocidos en los últimos dos años?]]></string>
<string lang="it"><![CDATA[Dammi tutti i siti designati patrimoni dell'umanità negli ultimi due anni.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les patrimoines mondiaux qui ont été inscrits pendant les derniers deux ans.]]></string>
<string lang="nl"><![CDATA[Noem alle plaatsen op de Werelderfgoedlijst die in de laatste twee jaar zijn toegevoegd.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate siturile de patrimoniu mondial desemnate in ultimii doi ani.]]></string>
<keywords lang="en"><![CDATA[world heritage site, designate, past two years]]></keywords>
<keywords lang="de"><![CDATA[Welterbestätte, aufnehmen, vergangene zwei Jahre]]></keywords>
<keywords lang="es"><![CDATA[patrimonios de la humanidad, reconocidos, últimos dos años]]></keywords>
<keywords lang="it"><![CDATA[patrimoni dell'umanità, designare, ultimi due anni]]></keywords>
<keywords lang="fr"><![CDATA[patrimoines mondiaux, inscrits, derniers deux ans]]></keywords>
<keywords lang="nl"><![CDATA[Werelderfgoed, laatste twee jaar, toevoegen]]></keywords>
<keywords lang="ro"><![CDATA[situri de patrimoniu mondial, desemna, ultimii doi ani]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:WorldHeritageSite . 
      { ?uri dbp:year '2013'^^xsd:integer . }
      UNION 
      { ?uri dbp:year '2014'^^xsd:integer . }
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Ranthambore_Fort]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bergpark_Wilhelmsh%C3%B6he]]></answer><answer><![CDATA[http://dbpedia.org/resource/Holy_Trinity_Church,_Zhovkva]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gagron_Fort]]></answer><answer><![CDATA[http://dbpedia.org/resource/Wooden_tserkvas_of_Carpathian_region_in_Poland_and_Ukraine]]></answer><answer><![CDATA[http://dbpedia.org/resource/Golestan_Palace]]></answer><answer><![CDATA[http://dbpedia.org/resource/Levuka]]></answer><answer><![CDATA[http://dbpedia.org/resource/Medici_villas]]></answer><answer><![CDATA[http://dbpedia.org/resource/Honghe_Hani_Rice_Terraces]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pamir_National_Park]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jaisalmer_Fort]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hill_Forts_of_Rajasthan]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rani_ki_vav]]></answer></answers></question>

<question id="113" onlydbo="true" answertype="resource" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Who is the youngest player in the Premier League?]]></string>
<string lang="de"><![CDATA[Wer ist der jüngste Spieler in der Premier League?]]></string>
<string lang="es"><![CDATA[¿Quién es el jugador más jóven de la Premier League?]]></string>
<string lang="it"><![CDATA[Chi è il giocatore più giovane della Premier League?]]></string>
<string lang="fr"><![CDATA[Quel est le joueur le plus jeune de la Premier League?]]></string>
<string lang="nl"><![CDATA[Wie is de jongste speler in de Premier League?]]></string>
<string lang="ro"><![CDATA[Cine este cel mai tânăr jucător din Premier League?]]></string>
<keywords lang="en"><![CDATA[player, Premier League, youngest]]></keywords>
<keywords lang="de"><![CDATA[Spieler, Premier League, jüngste]]></keywords>
<keywords lang="es"><![CDATA[jugador, más jóven, Premier League]]></keywords>
<keywords lang="it"><![CDATA[giocatore, Premier League, più giovane]]></keywords>
<keywords lang="fr"><![CDATA[joueur, Premier League, plus jeune]]></keywords>
<keywords lang="nl"><![CDATA[speler, jongste, Premier League]]></keywords>
<keywords lang="ro"><![CDATA[juător, Premier League, cel mai tânăr]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:team ?x . 
        ?x dbo:league res:Premier_League . 
        ?uri dbo:birthDate ?y . 
} 
ORDER BY DESC(?y) 
OFFSET 0 LIMIT 1 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Ernie_Pinkney]]></answer></answers></question>

<question id="114" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all members of Prodigy.]]></string>
<string lang="de"><![CDATA[Gib mir alle Bandmitglieder von Prodigy.]]></string>
<string lang="es"><![CDATA[Dame todos los miembros de la banda Prodigy.]]></string>
<string lang="it"><![CDATA[Dammi tutti i membri dei Prodigy.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les membres de Prodigy.]]></string>
<string lang="nl"><![CDATA[Noem alle leden van Prodigy.]]></string>
<string lang="ro"><![CDATA[Dă-mi toții membrii Prodigy.]]></string>
<keywords lang="en"><![CDATA[member, Prodigy]]></keywords>
<keywords lang="de"><![CDATA[Bandmitglied, Prodigy]]></keywords>
<keywords lang="es"><![CDATA[miembros de la banda Prodigy]]></keywords>
<keywords lang="it"><![CDATA[membri, Prodigy]]></keywords>
<keywords lang="fr"><![CDATA[members, Prodigy]]></keywords>
<keywords lang="nl"><![CDATA[leden, Prodigy]]></keywords>
<keywords lang="ro"><![CDATA[membru, Prodigy]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:The_Prodigy dbo:bandMember ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Keith_Flint]]></answer><answer><![CDATA[http://dbpedia.org/resource/Maxim_Reality]]></answer><answer><![CDATA[http://dbpedia.org/resource/Liam_Howlett]]></answer></answers></question>

<question id="115" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[What is the longest river?]]></string>
<string lang="de"><![CDATA[Was ist der längste Fluss?]]></string>
<string lang="es"><![CDATA[¿Cuál es el río más largo?]]></string>
<string lang="it"><![CDATA[Qual è il fiume più lungo?]]></string>
<string lang="fr"><![CDATA[Quel est le cours d'eau le plus long?]]></string>
<string lang="nl"><![CDATA[Wat is de langste rivier?]]></string>
<string lang="ro"><![CDATA[Care este cel mai lung fluviu?]]></string>
<keywords lang="en"><![CDATA[river, longest]]></keywords>
<keywords lang="de"><![CDATA[Fluss, längster]]></keywords>
<keywords lang="es"><![CDATA[río, más largo]]></keywords>
<keywords lang="it"><![CDATA[fiume, più lungo]]></keywords>
<keywords lang="fr"><![CDATA[cours d'eau, plus long]]></keywords>
<keywords lang="nl"><![CDATA[rivier, langste]]></keywords>
<keywords lang="ro"><![CDATA[fluviu, cel mai lung]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:River . 
      { ?uri dbo:length ?l . } 
      UNION 
      { ?uri dbp:length ?l . } 
} 
ORDER BY DESC(?l) 
OFFSET 0 LIMIT 1 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Lochbach_(Itter)]]></answer></answers></question>

