<?xml version="1.0"?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="77" onlydbo="false">
<string lang="en"><![CDATA[Which music albums contain the song Last Christmas?]]></string>
<string lang="de"><![CDATA[Auf welchen Musikalben ist das Lied Last Christmas?]]></string>
<string lang="es"><![CDATA[¿Qué albums musicales contienen la canción Las Christmas?]]></string>
<string lang="it"><![CDATA[Quali album musicali contengono la canzone Last Christmas?]]></string>
<string lang="fr"><![CDATA[Quels albums contiennent le morceau Last Christmas?]]></string>
<string lang="nl"><![CDATA[Op welke muziekalbums staat het nummer Last Christmas?]]></string>
<string lang="ro"><![CDATA[Ce albume muzicale conțin melodia Last Christmas?]]></string>
<keywords lang="en"><![CDATA[music album, song, Last Christmas]]></keywords>
<keywords lang="de"><![CDATA[Musikalbum, Lied, Last Christmas]]></keywords>
<keywords lang="es"><![CDATA[album musical, canción, Last Christmas]]></keywords>
<keywords lang="it"><![CDATA[album musicale, canzone, Last Christmas]]></keywords>
<keywords lang="fr"><![CDATA[albums, contiennent, Last Christmas?]]></keywords>
<keywords lang="nl"><![CDATA[muziekalbum, nummer, Last Christmas]]></keywords>
<keywords lang="ro"><![CDATA[album musical, melodie, Last Christmas]]></keywords>
<query><![CDATA[
PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri 
WHERE {
        ?single dbo:album ?uri .
        ?single rdfs:label 'Last Christmas'@en .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Disco_Defenders]]></answer><answer><![CDATA[http://dbpedia.org/resource/Whigfield_II]]></answer><answer><![CDATA[http://dbpedia.org/resource/Perfect_Day_(Cascada_album)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Whigfield_(album)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Music_from_the_Edge_of_Heaven]]></answer><answer><![CDATA[http://dbpedia.org/resource/Classic_Christmas_(Joe_McElderry_album)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Crazy_Frog_Presents_More_Crazy_Hits]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="8" onlydbo="false">
<string lang="en"><![CDATA[Which states of Germany are governed by the Social Democratic Party?]]></string>
<string lang="de"><![CDATA[Welche Bundesländer in Deutschland werden von der SPD regiert?]]></string>
<string lang="es"><![CDATA[¿En qué estados federales de Alemania gobierna la SPD?]]></string>
<string lang="it"><![CDATA[In quali stati federati della Germania governa il Partito Socialista Democratico?]]></string>
<string lang="fr"><![CDATA[Quels sont les états d'Allemagne gouvernés par le parti social-démocrate d'Allemagne?]]></string>
<string lang="nl"><![CDATA[In welke Duitse deelstaten is de SPD aan de macht?]]></string>
<string lang="ro"><![CDATA[Ce state germane sunt guvernate de Partidul Social Democrat?]]></string>
<keywords lang="en"><![CDATA[state, Germany, govern, Social Democratic Party]]></keywords>
<keywords lang="de"><![CDATA[Deutschland, Bundesland, regieren, SPD]]></keywords>
<keywords lang="es"><![CDATA[estado federal, Alemania, gobierna, SPD]]></keywords>
<keywords lang="it"><![CDATA[stato federato, Germania, governo, Partito Socialista Democratico]]></keywords>
<keywords lang="fr"><![CDATA[états d'Allemagne, parti social-démocrate d'Allemagne, gouvernés]]></keywords>
<keywords lang="nl"><![CDATA[Duitse deelstaat, SPD, aan de macht]]></keywords>
<keywords lang="ro"><![CDATA[stat, Germania, guverna, Partidul Social Democrat]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
          ?uri rdf:type yago:StatesOfGermany .
        { ?uri dbo:leaderParty res:Social_Democratic_Party_of_Germany . }
        UNION
        { ?uri dbp:rulingParty 'SPD'@en . } 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Mecklenburg-Vorpommern]]></answer><answer><![CDATA[http://dbpedia.org/resource/Berlin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Saarland]]></answer><answer><![CDATA[http://dbpedia.org/resource/Schleswig-Holstein]]></answer><answer><![CDATA[http://dbpedia.org/resource/North_Rhine-Westphalia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Saxony-Anhalt]]></answer><answer><![CDATA[http://dbpedia.org/resource/Brandenburg]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hamburg]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lower_Saxony]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rhineland-Palatinate]]></answer><answer><![CDATA[http://dbpedia.org/resource/Thuringia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Baden-W%C3%BCrttemberg]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bremen_(state)]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="80" onlydbo="true">
<string lang="en"><![CDATA[Give me all Canadian Grunge record labels.]]></string>
<string lang="de"><![CDATA[Gib mir alle kanadischen Grunge-Plattenfirmen.]]></string>
<string lang="es"><![CDATA[Dame todos las empresas canadienses productoras de música Grunge.]]></string>
<string lang="it"><![CDATA[Dammi tutti i produttori canadesi di musica Grunge.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les labels discographiques canadiens de grunge.]]></string>
<string lang="nl"><![CDATA[Noem alle Canadese grunge-platenlabels.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate casele canadiene Grunge de înregistrări.]]></string>
<keywords lang="en"><![CDATA[record label, Canadian, Grunge]]></keywords>
<keywords lang="de"><![CDATA[kanadisch, Plattenfirma, Grunge]]></keywords>
<keywords lang="es"><![CDATA[empresa productora de música, canadiense, Grunge]]></keywords>
<keywords lang="it"><![CDATA[produttore di musica, canadese, Grunge]]></keywords>
<keywords lang="fr"><![CDATA[labels discographiques, canadiens, grunge]]></keywords>
<keywords lang="nl"><![CDATA[Canadees, platenlabel, Grunge]]></keywords>
<keywords lang="ro"><![CDATA[casă de înregistrări, canadian, Grunge]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:RecordLabel .
        ?uri dbo:genre res:Grunge .
        ?uri dbo:country res:Canada .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Murderecords]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="81" onlydbo="false">
<string lang="en"><![CDATA[Which country has the most official languages?]]></string>
<string lang="de"><![CDATA[Welches Land hat die meisten Amtssprachen?]]></string>
<string lang="es"><![CDATA[¿Qué país tiene más idiomas oficiales?]]></string>
<string lang="it"><![CDATA[Quale stato ha più lingue ufficiali?]]></string>
<string lang="fr"><![CDATA[Quels pays a le plus de langues officielles?]]></string>
<string lang="nl"><![CDATA[Welk land heeft de meeste officiële talen.]]></string>
<string lang="ro"><![CDATA[Ce țară are cele mai multe limbi oficiale?]]></string>
<keywords lang="en"><![CDATA[country, official language, most]]></keywords>
<keywords lang="de"><![CDATA[Land, Amtssprache, die meisten]]></keywords>
<keywords lang="es"><![CDATA[país, idiomas oficiales, más]]></keywords>
<keywords lang="it"><![CDATA[stato, lingue ufficiali, più]]></keywords>
<keywords lang="fr"><![CDATA[pays, plus de langues officielles]]></keywords>
<keywords lang="nl"><![CDATA[land, officiële taal, meeste]]></keywords>
<keywords lang="ro"><![CDATA[șară, limbă oficială, cele mai multe]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Country  .
        ?uri dbp:officialLanguages ?language .
} 
ORDER BY DESC(COUNT(?language)) 
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Vojvodina]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="82" onlydbo="true">
<string lang="en"><![CDATA[In which programming language is GIMP written?]]></string>
<string lang="de"><![CDATA[In welcher Programmiersprache wurde GIMP geschrieben?]]></string>
<string lang="es"><![CDATA[¿En qué lenguaje de programación esta programado GIMP?]]></string>
<string lang="it"><![CDATA[In quale linguaggio di programmazione è scritto GIMP?]]></string>
<string lang="fr"><![CDATA[En quel langage de programmation a été écrit GIMP?]]></string>
<string lang="nl"><![CDATA[In welke programmeertaal is GIMP geschreven?]]></string>
<string lang="ro"><![CDATA[În ce limbaj de programare este scris GIMP?]]></string>
<keywords lang="en"><![CDATA[GIMP, programming language]]></keywords>
<keywords lang="de"><![CDATA[GIMP, Programmiersprache]]></keywords>
<keywords lang="es"><![CDATA[GIMP, lenguaje de programación]]></keywords>
<keywords lang="it"><![CDATA[GIMP, linguaggio di programmazione]]></keywords>
<keywords lang="fr"><![CDATA[langage de programmation, GIMP]]></keywords>
<keywords lang="nl"><![CDATA[GIMP, programmeertaal]]></keywords>
<keywords lang="ro"><![CDATA[GIMP, limbaj de programare]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        res:GIMP dbo:programmingLanguage ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/C_(programming_language)]]></answer><answer><![CDATA[http://dbpedia.org/resource/GTK+]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="83" onlydbo="true">
<string lang="en"><![CDATA[Who produced films starring Natalie Portman?]]></string>
<string lang="de"><![CDATA[Wer produzierte Filme, in denen Natalie Portman mitspielt?]]></string>
<string lang="es"><![CDATA[¿Quién ha producido películas en las que actua Natalie Portman?]]></string>
<string lang="it"><![CDATA[Chi ha prodotto i film in cui recita Natalie Portman?]]></string>
<string lang="fr"><![CDATA[Qui a produit des films dans lesquels joue Natalie Portman?]]></string>
<string lang="nl"><![CDATA[Wie produceerde films waarin Natalie Portman speelde?]]></string>
<string lang="ro"><![CDATA[Cine a produs filme cu Natalie Portman în rol principal?]]></string>
<keywords lang="en"><![CDATA[produce, film, starring, Natalie Portman]]></keywords>
<keywords lang="de"><![CDATA[produzieren, Film, mitspielen, Natalie Portman]]></keywords>
<keywords lang="es"><![CDATA[producente, perlículas, actua, Natalie Portman]]></keywords>
<keywords lang="it"><![CDATA[produttore, film, recita, Natalie Portman]]></keywords>
<keywords lang="fr"><![CDATA[produit, films, Natalie Portman]]></keywords>
<keywords lang="nl"><![CDATA[producent, film, Natalie Portman, speelt]]></keywords>
<keywords lang="ro"><![CDATA[produce, film, rol principal, Natalie Portman]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?film rdf:type dbo:Film .
        ?film dbo:starring res:Natalie_Portman .
        ?film dbo:producer ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Natalie_Portman]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dan_Bucatinsky]]></answer><answer><![CDATA[http://dbpedia.org/resource/Marc_E._Platt]]></answer><answer><![CDATA[http://dbpedia.org/resource/Laurence_Mark]]></answer><answer><![CDATA[http://dbpedia.org/resource/Patrice_Ledoux]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rick_McCallum]]></answer><answer><![CDATA[http://dbpedia.org/resource/Susan_Cartsonis]]></answer><answer><![CDATA[http://dbpedia.org/resource/David_McFadzean]]></answer><answer><![CDATA[http://dbpedia.org/resource/Matt_Williams_(TV_producer)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ari_Handel]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mike_Medavoy]]></answer><answer><![CDATA[http://dbpedia.org/resource/Scott_Stuber]]></answer><answer><![CDATA[http://dbpedia.org/resource/Saul_Zaentz]]></answer><answer><![CDATA[http://dbpedia.org/resource/Richard_N._Gladstein]]></answer><answer><![CDATA[http://dbpedia.org/resource/John_Calley]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mike_Nichols]]></answer><answer><![CDATA[http://dbpedia.org/resource/Cary_Brokaw]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ryan_Kavanaugh]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sigurj%C3%B3n_Sighvatsson]]></answer><answer><![CDATA[http://dbpedia.org/resource/Michael_De_Luca]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gary_Gilbert]]></answer><answer><![CDATA[http://dbpedia.org/resource/San_Francisco_Ballet]]></answer><answer><![CDATA[http://dbpedia.org/resource/Michael_Tapuah]]></answer><answer><![CDATA[http://dbpedia.org/resource/Laurent_Truchot]]></answer><answer><![CDATA[http://dbpedia.org/resource/Wong_Kar-wai]]></answer><answer><![CDATA[http://dbpedia.org/resource/Doug_Magallon,_Greg_Strom]]></answer><answer><![CDATA[http://dbpedia.org/resource/Spencer_Susser]]></answer><answer><![CDATA[http://dbpedia.org/resource/Larry_J._Franco]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tim_Burton]]></answer><answer><![CDATA[http://dbpedia.org/resource/Alison_Owen]]></answer><answer><![CDATA[http://dbpedia.org/resource/Scott_Steindorff]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="84" onlydbo="true">
<string lang="en"><![CDATA[Give me all movies with Tom Cruise.]]></string>
<string lang="de"><![CDATA[Gib mir alle Filme mit Tom Cruise.]]></string>
<string lang="es"><![CDATA[Dame todas las películas con Tom Cruise]]></string>
<string lang="it"><![CDATA[Dammi tutti i film con Tom Cruise.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les films avec Tom Cruise.]]></string>
<string lang="nl"><![CDATA[Noem alle films met Tom Cruise.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate filmele cu Tom Cruise.]]></string>
<keywords lang="en"><![CDATA[movie, Tom Cruise]]></keywords>
<keywords lang="de"><![CDATA[Film, Tom Cruise]]></keywords>
<keywords lang="es"><![CDATA[películas, Tom Cruise]]></keywords>
<keywords lang="it"><![CDATA[film, Tom Cruise]]></keywords>
<keywords lang="fr"><![CDATA[films, Tom Cruise]]></keywords>
<keywords lang="nl"><![CDATA[film, Tom Cruise]]></keywords>
<keywords lang="ro"><![CDATA[film, Tom Cruise]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Film.
        ?uri dbo:starring res:Tom_Cruise .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Vanilla_Sky]]></answer><answer><![CDATA[http://dbpedia.org/resource/Interview_with_the_Vampire:_The_Vampire_Chronicles]]></answer><answer><![CDATA[http://dbpedia.org/resource/Eyes_Wide_Shut]]></answer><answer><![CDATA[http://dbpedia.org/resource/Days_of_Thunder]]></answer><answer><![CDATA[http://dbpedia.org/resource/Losin'_It]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jerry_Maguire]]></answer><answer><![CDATA[http://dbpedia.org/resource/Minority_Report_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rain_Man]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Color_of_Money]]></answer><answer><![CDATA[http://dbpedia.org/resource/Top_Gun]]></answer><answer><![CDATA[http://dbpedia.org/resource/A_Few_Good_Men]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mission:_Impossible_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Firm_(1993_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lions_for_Lambs]]></answer><answer><![CDATA[http://dbpedia.org/resource/Cocktail_(1988_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Valkyrie_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Risky_Business]]></answer><answer><![CDATA[http://dbpedia.org/resource/Red_Dawn_(2012_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Magnolia_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Last_Samurai]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mission:_Impossible_%E2%80%93_Ghost_Protocol]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mission:_Impossible_(film_series)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mission:_Impossible_III]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rock_of_Ages_(2012_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jack_Reacher_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Knight_and_Day]]></answer><answer><![CDATA[http://dbpedia.org/resource/Collateral_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Legend_(1985_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Outsiders_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/War_of_the_Worlds_(2005_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Born_on_the_Fourth_of_July_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/All_the_Right_Moves_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Far_and_Away]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="85" onlydbo="true">
<string lang="en"><![CDATA[In which films did Julia Roberts as well as Richard Gere play?]]></string>
<string lang="de"><![CDATA[In welchen Filmen spielen sowohl Julia Roberts als auch Richard Gere mit?]]></string>
<string lang="es"><![CDATA[¿En qué películas actúan Julia Roberts y Richard Gere?]]></string>
<string lang="it"><![CDATA[In quali film recitano sia Julia Roberts che Richard Gere?]]></string>
<string lang="fr"><![CDATA[Dans quels films jouent Julia Roberts et Richard Gere?]]></string>
<string lang="nl"><![CDATA[In welke films speelden zowel Julia Roberts als Richard Gere?]]></string>
<string lang="ro"><![CDATA[În ce filme joacă Julia Roberts precum și Richard Gere?]]></string>
<keywords lang="en"><![CDATA[film, play, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="de"><![CDATA[Film, mitspielen, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="es"><![CDATA[película, actores, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="it"><![CDATA[film, recitare, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="fr"><![CDATA[films, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="nl"><![CDATA[film, speel, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="ro"><![CDATA[film, joacă, Julia Roberts, Richard Gere]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:starring res:Julia_Roberts .
        ?uri dbo:starring res:Richard_Gere.
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Pretty_Woman]]></answer><answer><![CDATA[http://dbpedia.org/resource/Runaway_Bride_(1999_film)]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="87" onlydbo="true">
<string lang="en"><![CDATA[Who wrote the book The Pillars of the Earth?]]></string>
<string lang="de"><![CDATA[Wer schrieb das Buch Die Säulen der Erde?]]></string>
<string lang="es"><![CDATA[¿Quen escribió el libro Los pilares de la Tierra?]]></string>
<string lang="it"><![CDATA[Chi ha scritto il libro I pilastri della Terra?]]></string>
<string lang="fr"><![CDATA[Qui a écrit le livre Les Piliers de la Terre?]]></string>
<string lang="nl"><![CDATA[Wie schreef het boek De Pilaren van de Aarde?]]></string>
<string lang="ro"><![CDATA[Cine e scris cartea Stâlpii Pământului?]]></string>
<keywords lang="en"><![CDATA[wrote, book, The pillars of the Earth]]></keywords>
<keywords lang="de"><![CDATA[schreiben, Buch, Die Säulen der Erde]]></keywords>
<keywords lang="es"><![CDATA[escritor, libro, Pilares de la Tierra]]></keywords>
<keywords lang="it"><![CDATA[scritto, libro, I pilastri della Terra]]></keywords>
<keywords lang="fr"><![CDATA[Les Piliers de la Terre, écrivain]]></keywords>
<keywords lang="nl"><![CDATA[auteur, De Pilaren van de Aarde]]></keywords>
<keywords lang="ro"><![CDATA[scrie, carte, Stâlpii Pământului]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:The_Pillars_of_the_Earth dbo:author ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Ken_Follett]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="88" onlydbo="true">
<string lang="en"><![CDATA[How many films did Leonardo DiCaprio star in?]]></string>
<string lang="de"><![CDATA[In wievielen Filmen hat Leonardo DiCaprio mitgespielt?]]></string>
<string lang="es"><![CDATA[¿En cuántas películas ha actuado Leonardo DiCaprio?]]></string>
<string lang="it"><![CDATA[In quanti film ha recitato Leonardo DiCaprio?]]></string>
<string lang="fr"><![CDATA[Dans combien de films Leonard DiCaprio a-t-il joué?]]></string>
<string lang="nl"><![CDATA[In hoeveel films speelde Leonardo DiCaprio?]]></string>
<string lang="ro"><![CDATA[În câte filme a jucat Leonardo DiCaprio rol principal?]]></string>
<keywords lang="en"><![CDATA[film, star, Leonardo DiCaprio]]></keywords>
<keywords lang="de"><![CDATA[Film, mitspielen, Leonardo DiCaprio]]></keywords>
<keywords lang="es"><![CDATA[películas, cuántas, actúa, Leonardo DiCaprio]]></keywords>
<keywords lang="it"><![CDATA[film, recitare, Leonardo DiCaprio]]></keywords>
<keywords lang="fr"><![CDATA[combien, films, Leonard DiCaprio]]></keywords>
<keywords lang="nl"><![CDATA[film, speelt, Leonardo DiCaprio]]></keywords>
<keywords lang="ro"><![CDATA[film, rol principal, Leonardo DiCaprio]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?uri) 
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:starring res:Leonardo_DiCaprio . 
}
]]></query>
<answers><answer><![CDATA[24]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="89" onlydbo="true">
<string lang="en"><![CDATA[Give me all soccer clubs in the Premier League.]]></string>
<string lang="de"><![CDATA[Gib mir alle Vereine in der Premier League.]]></string>
<string lang="es"><![CDATA[Dame todos los clubs de la Premier League.]]></string>
<string lang="it"><![CDATA[Dammi tutti i club calcistici nella Premier League.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les équipes de la Premier League.]]></string>
<string lang="nl"><![CDATA[Noem alle clubs uit de Premier League.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate cluburile de fotbal din Premier League]]></string>
<keywords lang="en"><![CDATA[Premier League, soccer club]]></keywords>
<keywords lang="de"><![CDATA[Premier League, Verein]]></keywords>
<keywords lang="es"><![CDATA[Premier League, club]]></keywords>
<keywords lang="it"><![CDATA[Premier League, club calcistici]]></keywords>
<keywords lang="fr"><![CDATA[équipes, Premier League]]></keywords>
<keywords lang="nl"><![CDATA[club, Premier League]]></keywords>
<keywords lang="ro"><![CDATA[Premier League, club de fotbal]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:SoccerClub .
        ?uri dbo:league res:Premier_League . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Aston_Villa_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Newcastle_United_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/West_Bromwich_Albion_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/West_Ham_United_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Arsenal_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Chelsea_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Fulham_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Liverpool_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Manchester_United_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Everton_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Southampton_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tottenham_Hotspur_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Cardiff_City_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Crystal_Palace_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Swansea_City_A.F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Manchester_City_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Norwich_City_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Stoke_City_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sunderland_A.F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/History_of_Blackburn_Rovers_F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Melchester_Rovers]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hull_City_A.F.C.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Leicester_City_F.C.]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="9" onlydbo="false">
<string lang="en"><![CDATA[In which U.S. state is Mount McKinley located?]]></string>
<string lang="de"><![CDATA[In welchem US-Bundesstaat befindet sich der Mount McKinley?]]></string>
<string lang="es"><![CDATA[¿En qué estado de los estados unidos se encuentra el monte McKinley?]]></string>
<string lang="it"><![CDATA[In quale stato degli Stati Uniti si trova il Monte McKinley?]]></string>
<string lang="fr"><![CDATA[Dans quel état des Etats-Unis d'Amérique se trouve le mont McKinley?]]></string>
<string lang="nl"><![CDATA[In welke deelstaat van de Verenigde Staten is Mount McKinley gelegen?]]></string>
<string lang="ro"><![CDATA[În ce stat american se află muntele McKinley?]]></string>
<keywords lang="en"><![CDATA[U.S. state, located, Mount McKinley]]></keywords>
<keywords lang="de"><![CDATA[US-Staat, befinden, Mount McKinley]]></keywords>
<keywords lang="es"><![CDATA[estado, estados unidos de américa, encuentra, monte McKinley]]></keywords>
<keywords lang="it"><![CDATA[Stati Uniti d'America, trova, Mount McKinley]]></keywords>
<keywords lang="fr"><![CDATA[états, Etats-Unis d'Amérique, trouve, mont McKinley]]></keywords>
<keywords lang="nl"><![CDATA[deelstaat, Verenigde Staten, gelegen, Mount McKinley]]></keywords>
<keywords lang="ro"><![CDATA[stat american, aflat, muntele McKinley]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type yago:StatesOfTheUnitedStates .
        res:Mount_McKinley dbo:locatedInArea ?uri . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Alaska]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="date" id="90" onlydbo="true">
<string lang="en"><![CDATA[When was Capcom founded?]]></string>
<string lang="de"><![CDATA[Wann wurde Capcom gegründet?]]></string>
<string lang="es"><![CDATA[¿Cúando se fundó Capcom?]]></string>
<string lang="it"><![CDATA[Quando è stata fondata Capcom?]]></string>
<string lang="fr"><![CDATA[Quand a été fondé Capcom?]]></string>
<string lang="nl"><![CDATA[Wanneer werd Capcom opgericht?]]></string>
<string lang="ro"><![CDATA[Când a fost fondat Capcom?]]></string>
<keywords lang="en"><![CDATA[Capcom, founded]]></keywords>
<keywords lang="de"><![CDATA[Capcom, gründen]]></keywords>
<keywords lang="es"><![CDATA[Capcom, fundada]]></keywords>
<keywords lang="it"><![CDATA[Capcom, fondata]]></keywords>
<keywords lang="fr"><![CDATA[fondé, Capcom]]></keywords>
<keywords lang="nl"><![CDATA[Capcom, opgericht]]></keywords>
<keywords lang="ro"><![CDATA[Capcom, fondat]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE {
        res:Capcom dbo:foundingDate ?date .
}
]]></query>
<answers><answer><![CDATA[1983-06-11+02:00]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="92" onlydbo="true">
<string lang="en"><![CDATA[What is the highest mountain?]]></string>
<string lang="de"><![CDATA[Was ist der höchste Berg?]]></string>
<string lang="es"><![CDATA[¿Cuál es la montaña más alta?]]></string>
<string lang="it"><![CDATA[Qual è la montagna più alta?]]></string>
<string lang="fr"><![CDATA[Quelle est la montagne la plus haute?]]></string>
<string lang="nl"><![CDATA[Wat is de hoogste berg?]]></string>
<string lang="ro"><![CDATA[Care este cel mai înalt munte?]]></string>
<keywords lang="en"><![CDATA[mountain, highest]]></keywords>
<keywords lang="de"><![CDATA[höchster, Berg]]></keywords>
<keywords lang="es"><![CDATA[montaña, más alta]]></keywords>
<keywords lang="it"><![CDATA[montagna, più alta]]></keywords>
<keywords lang="fr"><![CDATA[montagne, la plus haute]]></keywords>
<keywords lang="nl"><![CDATA[hoogste berg]]></keywords>
<keywords lang="ro"><![CDATA[munte, cel mai înalt]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Mountain  .
        ?uri dbo:elevation ?elevation .
} 
ORDER BY DESC(?elevation) 
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Mount_Everest]]></answer></answers></question>

