{
  "dataset": {
    "id": "qald-5_train"
  },
  "questions": [
    {
      "id": "229",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all Australian metalcore bands.",
          "keywords": "Australian, metalcore bands"
        },
        {
          "language": "de",
          "string": "Gib mir alle australischen Metalcore-Bands.",
          "keywords": "australisch, Metalcore-Bands"
        },
        {
          "language": "es",
          "string": "Dame todos los grupos australianos de metalcore.",
          "keywords": "grupos australianos metalcore"
        },
        {
          "language": "it",
          "string": "Dammi tutte i gruppi metalcore australiani.",
          "keywords": "gruppi metalcore, australiani"
        },
        {
          "language": "fr",
          "string": "Donnes les groupes de métalcode australiens.",
          "keywords": "groupe, métalcode, australien"
        },
        {
          "language": "nl",
          "string": "Toon alle Australisch metalcore bands.",
          "keywords": "Australisch, metalcore bands"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate trupele metalcore australiene.",
          "keywords": "australian, trupe metalcore"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:Band . ?uri dbo:genre res:Metalcore . { ?uri dbo:hometown res:Australia . } UNION { ?uri dbo:hometown ?h . ?h dbo:country res:Australia . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Confession_(band)"
        },
        {
          "string": "http://dbpedia.org/resource/Our_Last_Enemy"
        },
        {
          "string": "http://dbpedia.org/resource/Buried_in_Verona"
        },
        {
          "string": "http://dbpedia.org/resource/House_vs._Hurricane"
        },
        {
          "string": "http://dbpedia.org/resource/Shoreside"
        },
        {
          "string": "http://dbpedia.org/resource/Wish_for_Wings"
        },
        {
          "string": "http://dbpedia.org/resource/Mindsnare"
        },
        {
          "string": "http://dbpedia.org/resource/Parkway_Drive"
        },
        {
          "string": "http://dbpedia.org/resource/I_Killed_the_Prom_Queen"
        },
        {
          "string": "http://dbpedia.org/resource/The_Amity_Affliction"
        },
        {
          "string": "http://dbpedia.org/resource/Dyscord"
        },
        {
          "string": "http://dbpedia.org/resource/Capture_the_Crown"
        },
        {
          "string": "http://dbpedia.org/resource/Double_Dragon_(band)"
        },
        {
          "string": "http://dbpedia.org/resource/Northlane"
        }
      ]
    },
    {
      "id": "227",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "true",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all actors who were born in Paris after 1950.",
          "keywords": "actors, born, Paris, after 1950"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schauspieler, die nach 1950 in Paris geboren wurden.",
          "keywords": "Schauspieler, geboren, nach 1950, in Paris"
        },
        {
          "language": "es",
          "string": "Dame todos los actores nacidos en Paris después de 1950.",
          "keywords": "actores,nacidos en Paris, después de 1950"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli attori nati a Parigi dopo il 1950.",
          "keywords": "attori, nati, dopo il 1950, a Parigi"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les acteurs nés à Berlin après 1950.",
          "keywords": "acteurs, lieu de naissance, Berlin, date de naissance, après 1950"
        },
        {
          "language": "nl",
          "string": "Toon alle acteurs die na 1950 in Parijs zijn geboren.",
          "keywords": "actuers, geboren, na 1950, in Parijs"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți actorii care s-au născut la Paris după 1950.",
          "keywords": "actori, născut, Paris, după 1950"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Actor . ?uri dbo:birthPlace res:Paris . ?uri dbo:birthDate ?date . FILTER ( ?date >= xsd:dateTime('1950-12-31T0:0:0Z') }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Coralie_Trinh_Thi"
        },
        {
          "string": "http://dbpedia.org/resource/Gr%C3%A9gory_Fitoussi"
        },
        {
          "string": "http://dbpedia.org/resource/Chiara_Mastroianni"
        },
        {
          "string": "http://dbpedia.org/resource/Roxane_Duran"
        },
        {
          "string": "http://dbpedia.org/resource/Chems_Dahmani"
        },
        {
          "string": "http://dbpedia.org/resource/Melvil_Poupaud"
        },
        {
          "string": "http://dbpedia.org/resource/Estelle_Skornik"
        },
        {
          "string": "http://dbpedia.org/resource/C%C3%A9cile_Cassel"
        },
        {
          "string": "http://dbpedia.org/resource/Mehdi_Belhaj_Kacem"
        },
        {
          "string": "http://dbpedia.org/resource/Antoine_de_Caunes"
        },
        {
          "string": "http://dbpedia.org/resource/%C3%89douard_Baer"
        },
        {
          "string": "http://dbpedia.org/resource/Pierre_Boulanger"
        },
        {
          "string": "http://dbpedia.org/resource/Samir_Guesmi"
        },
        {
          "string": "http://dbpedia.org/resource/Nora_Arnezeder"
        },
        {
          "string": "http://dbpedia.org/resource/R%C3%A9gis_Laspal%C3%A8s"
        },
        {
          "string": "http://dbpedia.org/resource/Rebecca_Lord"
        },
        {
          "string": "http://dbpedia.org/resource/Mathilde_Seigner"
        },
        {
          "string": "http://dbpedia.org/resource/Angelique_Morgan"
        },
        {
          "string": "http://dbpedia.org/resource/No%C3%A9mie_Lvovsky"
        },
        {
          "string": "http://dbpedia.org/resource/Christa_Theret"
        },
        {
          "string": "http://dbpedia.org/resource/Lucie_Jeanne"
        },
        {
          "string": "http://dbpedia.org/resource/Nikolai_Kinski"
        },
        {
          "string": "http://dbpedia.org/resource/St%C3%A9phane_Freiss"
        },
        {
          "string": "http://dbpedia.org/resource/Judy_Minx"
        }
      ]
    },
    {
      "id": "252",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give all swimmers that were born in Moscow.",
          "keywords": "swimmer, born, Moscow"
        },
        {
          "language": "de",
          "string": "Zeig mir alle Schwimmer, die in Moskau geboren wurden.",
          "keywords": "Schwimmer, geboren in, Moskau"
        },
        {
          "language": "es",
          "string": "Dame todos los nadadores nacidos en Moscú",
          "keywords": "nadadores, nacidos, Moscú"
        },
        {
          "language": "it",
          "string": "Dammi tutti i nuotatori che sono nati a Mosca.",
          "keywords": "nuotatori, nati, Mosca"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les nageurs nés à Moscou.",
          "keywords": "nageurs, nés, Moscou"
        },
        {
          "language": "nl",
          "string": "Toen alle zwemmers die werden geboren in Moskou.",
          "keywords": "zwemmers, geboren, Moskou"
        },
        {
          "language": "ro",
          "string": "Numește toți înotătorii născuți în Moscova.",
          "keywords": "înotători, născuți, Moscova"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Swimmer . ?uri dbo:birthPlace res:Moscow .}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Aleksandr_Samsonov"
        },
        {
          "string": "http://dbpedia.org/resource/Olesya_Vladykina"
        },
        {
          "string": "http://dbpedia.org/resource/Tamara_Sosnova"
        },
        {
          "string": "http://dbpedia.org/resource/Viktor_Mazanov"
        },
        {
          "string": "http://dbpedia.org/resource/Valentina_Tutayeva"
        },
        {
          "string": "http://dbpedia.org/resource/Valentina_Poznyak"
        },
        {
          "string": "http://dbpedia.org/resource/Maria_Gromova_(swimmer)"
        },
        {
          "string": "http://dbpedia.org/resource/Anastasia_Chaun"
        },
        {
          "string": "http://dbpedia.org/resource/Alexey_Zinovyev"
        },
        {
          "string": "http://dbpedia.org/resource/Oleg_Fotin"
        },
        {
          "string": "http://dbpedia.org/resource/Nina_Zhivanevskaya"
        },
        {
          "string": "http://dbpedia.org/resource/Artem_Lobuzov"
        },
        {
          "string": "http://dbpedia.org/resource/Yekaterina_Vinogradova"
        },
        {
          "string": "http://dbpedia.org/resource/Vladimir_Kravchenko"
        },
        {
          "string": "http://dbpedia.org/resource/Mikhail_Polischuk"
        },
        {
          "string": "http://dbpedia.org/resource/Daniela_In%C3%A1cio"
        },
        {
          "string": "http://dbpedia.org/resource/Nikolay_Suhorukov"
        },
        {
          "string": "http://dbpedia.org/resource/Elena_Sokolova_(swimmer)"
        },
        {
          "string": "http://dbpedia.org/resource/Irina_Pozdnyakova"
        },
        {
          "string": "http://dbpedia.org/resource/Semyon_Belits-Geiman"
        },
        {
          "string": "http://dbpedia.org/resource/Marina_Chepurkova"
        },
        {
          "string": "http://dbpedia.org/resource/Valentin_Kuzmin"
        },
        {
          "string": "http://dbpedia.org/resource/Aleksandr_Pletnev"
        },
        {
          "string": "http://dbpedia.org/resource/Anastasia_Gloushkov"
        },
        {
          "string": "http://dbpedia.org/resource/Danil_Haustov"
        },
        {
          "string": "http://dbpedia.org/resource/Andrey_Dunayev"
        },
        {
          "string": "http://dbpedia.org/resource/Yevgeny_Korotyshkin"
        },
        {
          "string": "http://dbpedia.org/resource/Sergey_Lavrenov"
        }
      ]
    },
    {
      "id": "254",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Show me the book that Muhammad Ali wrote.",
          "keywords": "book, wrote, Muhammad Ali"
        },
        {
          "language": "de",
          "string": "Zeig mir das Buch, das Muhammad Ali geschrieben hat.",
          "keywords": "Buch, geschrieben, Muhammad Ali"
        },
        {
          "language": "es",
          "string": "Muéstrame el libro escrito por Muhammad Ali.",
          "keywords": "libro, autor, Muhammad Ali"
        },
        {
          "language": "it",
          "string": "Mostrami il libro scritto da Muhammad Ali.",
          "keywords": "libro, autore, Muhammad Ali"
        },
        {
          "language": "fr",
          "string": "Donne-moi le livre écrit par Muhammad Ali.",
          "keywords": "livre, par Muhammad Ali"
        },
        {
          "language": "nl",
          "string": "Toen het boek dat Muhammad Ali heeft geschreven.",
          "keywords": "boek, geschreven, Muhammad Ali"
        },
        {
          "language": "ro",
          "string": "Arată-mi cartea pe care a scris-o Muhammad Ali.",
          "keywords": "carte, scris, Muhammad Ali"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book . ?uri dbo:author res:Muhammad_Ali . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/The_Soul_of_a_Butterfly"
        }
      ]
    },
    {
      "id": "258",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all the TV shows with Neil Patrick Harris.",
          "keywords": "TV shows, Neil Patrick Harris"
        },
        {
          "language": "de",
          "string": "Gib mir alle Fernsehserien mit Neil Patrick Harris.",
          "keywords": "Fernsehserien, Neil Patrick Harris"
        },
        {
          "language": "es",
          "string": "Dame todos los programas de televisión con Neil Patrick Harris.",
          "keywords": "programas de televisión, Neil Patrick Harris"
        },
        {
          "language": "it",
          "string": "Dammi tutti i programmi televisivi con Neil Patrick Harris.",
          "keywords": "programmi televisivi, Neil Patrick Harris"
        },
        {
          "language": "fr",
          "string": "Donne-moi toutes les émissions de télé avec Neil Patrick Harris.",
          "keywords": "émissions de télé, Neil Patrick Harris"
        },
        {
          "language": "nl",
          "string": "Toen alle TV programma's met Neil Patrick Harris.",
          "keywords": "TV programma's, Neil Patrick Harris"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate emisiunile TV cu Neil Patrick Harris",
          "keywords": "emisiuni TV, Neil Patrick Harris"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:TelevisionShow . ?uri dbo:starring res:Neil_Patrick_Harris . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Neil's_Puppet_Dreams"
        },
        {
          "string": "http://dbpedia.org/resource/How_I_Met_Your_Mother"
        },
        {
          "string": "http://dbpedia.org/resource/Doogie_Howser,_M.D."
        },
        {
          "string": "http://dbpedia.org/resource/Stark_Raving_Mad_(TV_series)"
        },
        {
          "string": "http://dbpedia.org/resource/Capitol_Critters"
        }
      ]
    },
    {
      "id": "260",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Show a list of soccer clubs that play in the Bundesliga.",
          "keywords": "soccer clubs, play, Bundesliga"
        },
        {
          "language": "de",
          "string": "Zeig mir eine Liste der Fußballvereine, die in der Bundesliga spielen.",
          "keywords": "Fußballvereine, spielen, Bundesliga"
        },
        {
          "language": "es",
          "string": "Dame una lista de los clubs de futbol que juegan en Bundesliga.",
          "keywords": "clubs de futbol, Bundesliga"
        },
        {
          "language": "it",
          "string": "Dammi una lista di club calcistici che giocano nella Bundesliga.",
          "keywords": "club calcistici, Bundesliga"
        },
        {
          "language": "fr",
          "string": "Donne-moi la liste des clubs de football qui jouent dans la Bundesliga.",
          "keywords": "clubs de football, Bundesliga"
        },
        {
          "language": "nl",
          "string": "Toen een lijst van voetbalclubs die in de Bundesliga spelen.",
          "keywords": "voetbalclubs, spelen, Bundesliga"
        },
        {
          "language": "ro",
          "string": "Arată o listă a cluburilor de fotbal care joacă în Bundesliga.",
          "keywords": "cluburi de fotbal, joacă, Bundesliga"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:SoccerClub . ?uri dbo:league res:Bundesliga . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/SC_Freiburg"
        },
        {
          "string": "http://dbpedia.org/resource/FC_Bayern_Munich"
        },
        {
          "string": "http://dbpedia.org/resource/Hannover_96"
        },
        {
          "string": "http://dbpedia.org/resource/Hamburger_SV"
        },
        {
          "string": "http://dbpedia.org/resource/Borussia_Dortmund"
        },
        {
          "string": "http://dbpedia.org/resource/TSG_1899_Hoffenheim"
        },
        {
          "string": "http://dbpedia.org/resource/Bayer_04_Leverkusen"
        },
        {
          "string": "http://dbpedia.org/resource/Eintracht_Frankfurt"
        },
        {
          "string": "http://dbpedia.org/resource/Eintracht_Braunschweig"
        },
        {
          "string": "http://dbpedia.org/resource/SV_Werder_Bremen"
        },
        {
          "string": "http://dbpedia.org/resource/VfL_Wolfsburg"
        },
        {
          "string": "http://dbpedia.org/resource/Borussia_M%C3%B6nchengladbach"
        },
        {
          "string": "http://dbpedia.org/resource/FC_Schalke_04"
        },
        {
          "string": "http://dbpedia.org/resource/VfB_Stuttgart"
        },
        {
          "string": "http://dbpedia.org/resource/1._FC_N%C3%BCrnberg"
        },
        {
          "string": "http://dbpedia.org/resource/FC_Augsburg"
        },
        {
          "string": "http://dbpedia.org/resource/1._FSV_Mainz_05"
        },
        {
          "string": "http://dbpedia.org/resource/Hertha_BSC"
        }
      ]
    },
    {
      "id": "265",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "List all the musicals with music by Elton John.",
          "keywords": "musicals, music by, Elton John"
        },
        {
          "language": "de",
          "string": "Liste alle Musicals mit Musik von Elton John auf.",
          "keywords": "Musicals, Musik von, Elton John"
        },
        {
          "language": "es",
          "string": "Dame todos los musicales con música de Elton John.",
          "keywords": "musicales, música, Elton John"
        },
        {
          "language": "it",
          "string": "Elenca tutti i musicals con musiche di Elton John.",
          "keywords": "musicals, musiche, Elton John"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les musicals avec de la musique de de Elton John.",
          "keywords": "musicals, musique, Elton John"
        },
        {
          "language": "nl",
          "string": "Toen een lijst van alle musicals met muziek van Elton John.",
          "keywords": "musicals, muziek van, Elton John"
        },
        {
          "language": "ro",
          "string": "Listează toate muzicalurile cu muzică de Elton John.",
          "keywords": "muzicaluri, muzică de Elton John"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:Musical . ?uri dbo:musicBy res:Elton_John .}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/The_Lion_King_(musical)"
        },
        {
          "string": "http://dbpedia.org/resource/Lestat_(musical)"
        },
        {
          "string": "http://dbpedia.org/resource/Billy_Elliot_the_Musical"
        },
        {
          "string": "http://dbpedia.org/resource/Aida_(musical)"
        }
      ]
    },
    {
      "id": "277",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Show me all English Gothic buildings in Kent.",
          "keywords": "English Gothic buildings, Kent"
        },
        {
          "language": "de",
          "string": "Zeige mir alle Gebäude in Kent, die im Stil der englischen Gothik erbaut wurden.",
          "keywords": "Gebäude, Kent, englische Gotik"
        },
        {
          "language": "es",
          "string": "Muéstrame todos los edificios góticos en Kent.",
          "keywords": "edificios góticos, Kent"
        },
        {
          "language": "it",
          "string": "Mostrami tutti gli edifici in stile gotico inglese nel Kent.",
          "keywords": "edifici, gotico inglese, Kent"
        },
        {
          "language": "fr",
          "string": "Montre-moi tous les bâtiments dans le style gothique anglais à Kent.",
          "keywords": "bâtiments, gothique anglais, Kent"
        },
        {
          "language": "nl",
          "string": "Toen alle gebouwen in Kent, gebouwd in de stijl van het Engels gotiek.",
          "keywords": "gebouwen, Kent, stijl, Engels gotiek"
        },
        {
          "language": "ro",
          "string": "Arată-mi toate clădirile engleze gotice din Kent.",
          "keywords": "clădiri engleze gotice, Kent"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?uri WHERE { ?uri rdf:type dbo:Building . ?uri dbo:architecturalStyle res:English_Gothic_architecture . ?uri dbo:location res:Kent .}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Church_of_St_Thomas_%C3%A0_Becket,_Capel"
        },
        {
          "string": "http://dbpedia.org/resource/St_James'_Church,_Cooling"
        },
        {
          "string": "http://dbpedia.org/resource/St_Mary's_and_All_Saints_Church,_Boxley"
        },
        {
          "string": "http://dbpedia.org/resource/Canterbury_Cathedral"
        },
        {
          "string": "http://dbpedia.org/resource/St._Mary's_Church,_Hadlow"
        },
        {
          "string": "http://dbpedia.org/resource/St_Bartholomew's_Church,_Goodnestone"
        },
        {
          "string": "http://dbpedia.org/resource/St_Peter's_Church,_Swingfield"
        },
        {
          "string": "http://dbpedia.org/resource/All_Saints_Church,_Waldershare"
        },
        {
          "string": "http://dbpedia.org/resource/St_Mary's_Church,_Eastwell"
        },
        {
          "string": "http://dbpedia.org/resource/St_Mary's_Church,_Higham"
        },
        {
          "string": "http://dbpedia.org/resource/St_Mary's_Church,_Burham"
        },
        {
          "string": "http://dbpedia.org/resource/St_Mary's_Church,_Capel-le-Ferne"
        },
        {
          "string": "http://dbpedia.org/resource/St_Martin_of_Tours_Church,_Detling"
        },
        {
          "string": "http://dbpedia.org/resource/Church_of_St_Mary_the_Virgin,_Fordwich"
        },
        {
          "string": "http://dbpedia.org/resource/St_Mary's_Church,_Luddenham"
        },
        {
          "string": "http://dbpedia.org/resource/St_Mary_Magdalene_Church,_Stockbury"
        },
        {
          "string": "http://dbpedia.org/resource/St_Peter's_Church,_Sandwich"
        },
        {
          "string": "http://dbpedia.org/resource/St_Mary's_Church,_Sandwich"
        },
        {
          "string": "http://dbpedia.org/resource/St_Clement's_Church,_Knowlton"
        }
      ]
    },
    {
      "id": "293",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "body": [
        {
          "language": "en",
          "string": "Give me English actors starring in Lovesick.",
          "keywords": "English actors, starring, Lovesick"
        },
        {
          "language": "de",
          "string": "Gib mir britische Schauspieler, die in Lovesick mitspielen.",
          "keywords": "Schauspieler, britisch, mitspielen, Lovesick"
        },
        {
          "language": "es",
          "string": "Dame actores Ingleses protagonizando Lovesick.",
          "keywords": "actores Ingleses, protagonistas, Lovesick "
        },
        {
          "language": "it",
          "string": "Dammi gli attori inglesi che hanno recitato in Lovesick.",
          "keywords": "attori inglesi, protagonisti, Lovesick"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les acteurs anglais de Lovesick.",
          "keywords": "acteurs, anglais, Lovesick"
        },
        {
          "language": "nl",
          "string": "Toen Brits acteurs met een rol in Lovesick.",
          "keywords": "Brits acteurs, rol in, Lovesick"
        },
        {
          "language": "ro",
          "string": "Dă-mi actori englezi protagoniști în Lovesick.",
          "keywords": "actori englezi, protagoniști, Lovesick"
        }
      ],
      "query": "PREFIX res: <http://dbpedia.org/resource/>PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX yago: <http://dbpedia.org/clas/yago/> SELECT DISTINCT ?uriWHERE { res:Lovesick dbo:starring ?uri . { ?uri dbo:birthPlace res:England . } UNION { ?uri rdf:type yago:EnglishFilmActors . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Dudley_Moore"
        },
        {
          "string": "http://dbpedia.org/resource/Alec_Guinness"
        }
      ]
    },
    {
      "id": "328",
      "hybrid": "true",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "At which college did the only American actor that received the César Award study?"
        }
      ],
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Queens_College,_City_University_of_New_York"
        }
      ]
    },
    {
      "id": "333",
      "hybrid": "true",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "In which city does the former main presenter of the Xposé girls live?"
        }
      ],
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Dublin"
        }
      ]
    }
  ]
}