<?xml version="1.0"?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="273" onlydbo="true">
<string lang="en"><![CDATA[Which bridges cross the Seine?]]></string>
<string lang="de"><![CDATA[Welche Brücken überqueren die Seine?]]></string>
<string lang="es"><![CDATA[¿Cuantos puentes cruzan el Siena?]]></string>
<string lang="it"><![CDATA[Quanti ponti attraversano la Senna?]]></string>
<string lang="fr"><![CDATA[Quels ponts traversent la Seine?]]></string>
<string lang="nl"><![CDATA[Welke bruggen overspannen de Seine?]]></string>
<string lang="ro"><![CDATA[Ce poduri traversează Sena?]]></string>
<keywords lang="en"><![CDATA[bridges, cross, Seine]]></keywords>
<keywords lang="de"><![CDATA[Brücken, überqueren, Seine]]></keywords>
<keywords lang="es"><![CDATA[puentes, cruzan, Siena]]></keywords>
<keywords lang="it"><![CDATA[ponti, attraversare, Senna]]></keywords>
<keywords lang="fr"><![CDATA[ponts, Seine]]></keywords>
<keywords lang="nl"><![CDATA[bruggen, overspannen, Seine]]></keywords>
<keywords lang="ro"><![CDATA[poduri, traversează, Sena]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Bridge .
        ?uri dbo:crosses res:Seine .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Pont_de_la_Concorde_(Paris)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_Marie]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_National]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_des_Invalides]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_Louis-Philippe]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_Notre-Dame]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_d'Austerlitz]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_amont]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_de_l'Archev%C3%AAch%C3%A9]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_Mirabeau]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_Neuf]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_Charles-de-Gaulle]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_Royal]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_Gustave-Flaubert]]></answer><answer><![CDATA[http://dbpedia.org/resource/Viaduc_d'Austerlitz]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_au_Double]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tancarville_Bridge]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_d'I%C3%A9na]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_des_Arts]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_d'Arcole]]></answer><answer><![CDATA[http://dbpedia.org/resource/Port_%C3%A0_l'Anglais_Bridge]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_de_l'Alma]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_Alexandre_III]]></answer><answer><![CDATA[http://dbpedia.org/resource/Passerelle_Debilly]]></answer><answer><![CDATA[http://dbpedia.org/resource/Passerelle_L%C3%A9opold-S%C3%A9dar-Senghor]]></answer><answer><![CDATA[http://dbpedia.org/resource/Passerelle_Simone-de-Beauvoir]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_de_Sully]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_de_la_Tournelle]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_de_Bercy]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_aval]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_de_Tolbiac]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_Rouelle]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_de_Normandie]]></answer><answer><![CDATA[http://dbpedia.org/resource/Petit_Pont]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_au_Change]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_du_Garigliano]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_de_Grenelle]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_du_Carrousel]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_de_Bir-Hakeim]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_de_Brotonne]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pont_Saint-Michel]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="274" onlydbo="true">
<string lang="en"><![CDATA[Who is the mayor of the capital of French Polynesia?]]></string>
<string lang="de"><![CDATA[Wer ist der Bürgermeister der Hauptstadt von Französisch-Polynesien?]]></string>
<string lang="es"><![CDATA[¿Quien es el alcalde de la capital de la Polinesia Francesa?]]></string>
<string lang="it"><![CDATA[Chi è il sindaco della capitale della Polinesia Francese?]]></string>
<string lang="fr"><![CDATA[Qui est le maire de la capitale de la Polynésie Francaise?]]></string>
<string lang="nl"><![CDATA[Wie is de burgermeester van de hoofdstad van Frans-Polynesië?]]></string>
<string lang="ro"><![CDATA[Cine este primarul capitaliei Polineziei Franceze?]]></string>
<keywords lang="en"><![CDATA[mayor, capital, French Polynesia]]></keywords>
<keywords lang="de"><![CDATA[Bürgermeister, Hauptstadt, Französisch-Polynesien]]></keywords>
<keywords lang="es"><![CDATA[alcalde, capital Polinesia Francesa]]></keywords>
<keywords lang="it"><![CDATA[sindaco, capitale, Polinesia Francese]]></keywords>
<keywords lang="fr"><![CDATA[maire, capitale, Polynésie Francaise]]></keywords>
<keywords lang="nl"><![CDATA[burgermeester, hoofdstad, Frans-Polynesië]]></keywords>
<keywords lang="ro"><![CDATA[primar, capitală, Polinezia Franceză]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        res:French_Polynesia dbo:capital ?x .
        ?x dbo:mayor ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Michel_Buillard]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="275" onlydbo="true">
<string lang="en"><![CDATA[When did Dracula's creator die?]]></string>
<string lang="de"><![CDATA[Wann ist Draculas Schöpfer gestorben?]]></string>
<string lang="es"><![CDATA[¿Cuando murió el creador de Drácula?]]></string>
<string lang="it"><![CDATA[Quando è morto il creatore di Dracula?]]></string>
<string lang="fr"><![CDATA[Quand est mort le créateur de Dracula?]]></string>
<string lang="nl"><![CDATA[Wanneer stierf de bedenker van Dracula?]]></string>
<string lang="ro"><![CDATA[Când a murit creatorul Dracula?]]></string>
<keywords lang="en"><![CDATA[Dracula, creator, die]]></keywords>
<keywords lang="de"><![CDATA[Dracula, Schöpfer, gestorben]]></keywords>
<keywords lang="es"><![CDATA[muerte, creador, Drácula]]></keywords>
<keywords lang="it"><![CDATA[Dracula, creatore, morire]]></keywords>
<keywords lang="fr"><![CDATA[mort, créateur, Dracula]]></keywords>
<keywords lang="nl"><![CDATA[stierf, bedenker, Dracula]]></keywords>
<keywords lang="ro"><![CDATA[Dracula, creator, a muri]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date
WHERE { 
        res:Count_Dracula dbo:creator ?x . 
        ?x dbo:deathDate ?date .
}
]]></query>
<answers><answer><![CDATA[1912-04-20+02:00]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="276" onlydbo="true">
<string lang="en"><![CDATA[What is the location of the Houses of Parliament?]]></string>
<string lang="de"><![CDATA[Wo ist der Westminster-Palast?]]></string>
<string lang="es"><![CDATA[¿Donde están situadas las Casas del Parlamento?]]></string>
<string lang="it"><![CDATA[Dove si trova il Palazzo di Westminster?]]></string>
<string lang="fr"><![CDATA[Où se trouve le palais de Westminster?]]></string>
<string lang="nl"><![CDATA[Waar is de Palace of Westminster?]]></string>
<string lang="ro"><![CDATA[Care este locația Palatului Westminster?]]></string>
<keywords lang="en"><![CDATA[location, Houses of Parliament]]></keywords>
<keywords lang="de"><![CDATA[Ort, Westminster-Palast]]></keywords>
<keywords lang="es"><![CDATA[localización, casas del parlamento]]></keywords>
<keywords lang="it"><![CDATA[luogo, Palazzo di Westminster]]></keywords>
<keywords lang="fr"><![CDATA[location, palais de Westminster]]></keywords>
<keywords lang="nl"><![CDATA[plaats, Palace of Westminster]]></keywords>
<keywords lang="ro"><![CDATA[locație, Palatul Westminster]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT ?uri 
WHERE { 
         res:Palace_of_Westminster dbo:location ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/City_of_Westminster]]></answer><answer><![CDATA[http://dbpedia.org/resource/England]]></answer><answer><![CDATA[http://dbpedia.org/resource/Greater_London]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="277" onlydbo="true">
<string lang="en"><![CDATA[Show me all English Gothic buildings in Kent.]]></string>
<string lang="de"><![CDATA[Zeige mir alle Gebäude in Kent, die im Stil der englischen Gothik erbaut wurden.]]></string>
<string lang="es"><![CDATA[Muéstrame todos los edificios góticos en Kent.]]></string>
<string lang="it"><![CDATA[Mostrami tutti gli edifici in stile gotico inglese nel Kent.]]></string>
<string lang="fr"><![CDATA[Montre-moi tous les bâtiments dans le style gothique anglais à Kent.]]></string>
<string lang="nl"><![CDATA[Toen alle gebouwen in Kent, gebouwd in de stijl van het Engels gotiek.]]></string>
<string lang="ro"><![CDATA[Arată-mi toate clădirile engleze gotice din Kent.]]></string>
<keywords lang="en"><![CDATA[English Gothic buildings, Kent]]></keywords>
<keywords lang="de"><![CDATA[Gebäude, Kent, englische Gotik]]></keywords>
<keywords lang="es"><![CDATA[edificios góticos, Kent]]></keywords>
<keywords lang="it"><![CDATA[edifici, gotico inglese, Kent]]></keywords>
<keywords lang="fr"><![CDATA[bâtiments, gothique anglais, Kent]]></keywords>
<keywords lang="nl"><![CDATA[gebouwen, Kent, stijl, Engels gotiek]]></keywords>
<keywords lang="ro"><![CDATA[clădiri engleze gotice, Kent]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT ?uri 
WHERE { 
         ?uri rdf:type dbo:Building . 
         ?uri dbo:architecturalStyle res:English_Gothic_architecture .
         ?uri dbo:location res:Kent .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Church_of_St_Thomas_%C3%A0_Becket,_Capel]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_James'_Church,_Cooling]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Mary's_and_All_Saints_Church,_Boxley]]></answer><answer><![CDATA[http://dbpedia.org/resource/Canterbury_Cathedral]]></answer><answer><![CDATA[http://dbpedia.org/resource/St._Mary's_Church,_Hadlow]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Bartholomew's_Church,_Goodnestone]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Peter's_Church,_Swingfield]]></answer><answer><![CDATA[http://dbpedia.org/resource/All_Saints_Church,_Waldershare]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Mary's_Church,_Eastwell]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Mary's_Church,_Higham]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Mary's_Church,_Burham]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Mary's_Church,_Capel-le-Ferne]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Martin_of_Tours_Church,_Detling]]></answer><answer><![CDATA[http://dbpedia.org/resource/Church_of_St_Mary_the_Virgin,_Fordwich]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Mary's_Church,_Luddenham]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Mary_Magdalene_Church,_Stockbury]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Peter's_Church,_Sandwich]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Mary's_Church,_Sandwich]]></answer><answer><![CDATA[http://dbpedia.org/resource/St_Clement's_Church,_Knowlton]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="278" onlydbo="true">
<string lang="en"><![CDATA[Who was the pope that founded the Vatican Television?]]></string>
<string lang="de"><![CDATA[Welcher Papst hat das Vatikanische Fernsehen gegründet?]]></string>
<string lang="es"><![CDATA[¿Quien fue el papa que fundo la televisión Vaticana?]]></string>
<string lang="it"><![CDATA[Quale papa ha fondato la televisione vaticana?]]></string>
<string lang="fr"><![CDATA[Quel pape est le fondateur de la télé du Vatican?]]></string>
<string lang="nl"><![CDATA[Welk paus richtte de Vaticaanse televisie op?]]></string>
<string lang="ro"><![CDATA[Cine a fost papa care a creat televiziunea din Vatican?]]></string>
<keywords lang="en"><![CDATA[pope, founded, Vatican Television]]></keywords>
<keywords lang="de"><![CDATA[Papst, gegründet, Vatikanisches Fernsehen]]></keywords>
<keywords lang="es"><![CDATA[papa, fundo, televisión Vaticana]]></keywords>
<keywords lang="it"><![CDATA[papa, fondare, televisione vaticana]]></keywords>
<keywords lang="fr"><![CDATA[pape, fondateur, télé du Vatican]]></keywords>
<keywords lang="nl"><![CDATA[paus, oprichter, Vaticaanse televisie]]></keywords>
<keywords lang="ro"><![CDATA[papa, fondat, televiziunea din Vatican]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT ?uri 
WHERE { 
         ?uri rdf:type dbo:Pope . 
         res:Vatican_Television_Center dbo:foundedBy ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Pope_John_Paul_II]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="279" onlydbo="false">
<string lang="en"><![CDATA[What airlines are part of the SkyTeam alliance?]]></string>
<string lang="de"><![CDATA[Welche Fluggesellschaften sind Teil der SkyTeam-Allianz?]]></string>
<string lang="es"><![CDATA[¿Qué aerolíneas forman parte del la alianza SkyTeam?]]></string>
<string lang="it"><![CDATA[Quali compagnie aeree fanno parte dell'alleanza SkyTeam?]]></string>
<string lang="fr"><![CDATA[Quels companies aériennes sont membre de l'alliance SkyTeam?]]></string>
<string lang="nl"><![CDATA[Welke luchtvaartmaatschappijen zijn lid van de SkyTeam alliantie?]]></string>
<string lang="ro"><![CDATA[Ce companii aeriene fac parte din alianța SkyTeam?]]></string>
<keywords lang="en"><![CDATA[airlines, part of, SkyTeam alliance]]></keywords>
<keywords lang="de"><![CDATA[Fluggesellschaften, Teil von, SkyTeam-Allianz]]></keywords>
<keywords lang="es"><![CDATA[aerolíneas, alianza SkyTeam]]></keywords>
<keywords lang="it"><![CDATA[compagnie aeree, alleanza SkyTeam]]></keywords>
<keywords lang="fr"><![CDATA[alliance SkyTeam, companies aériennes, membre]]></keywords>
<keywords lang="nl"><![CDATA[luchtvaartmaatschappijen, lid van, SkyTeam alliantie]]></keywords>
<keywords lang="ro"><![CDATA[companii aeriene, parte din, alianța SkyTeam]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
          ?uri rdf:type dbo:Airline .
        { ?uri dbp:alliance res:SkyTeam . }
        UNION
        { ?uri dbo:Alliance res:SkyTeam . }
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Chautauqua_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/Delta_Connection]]></answer><answer><![CDATA[http://dbpedia.org/resource/Delta_Express]]></answer><answer><![CDATA[http://dbpedia.org/resource/KLM]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aerom%C3%A9xico_Travel]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aeroflot]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aerol%C3%ADneas_Argentinas]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aerom%C3%A9xico]]></answer><answer><![CDATA[http://dbpedia.org/resource/Delta_Air_Lines]]></answer><answer><![CDATA[http://dbpedia.org/resource/Saudia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Compass_Airlines_(North_America)]]></answer><answer><![CDATA[http://dbpedia.org/resource/R%C3%A9gional_Compagnie_A%C3%A9rienne_Europ%C3%A9enne]]></answer><answer><![CDATA[http://dbpedia.org/resource/CityJet]]></answer><answer><![CDATA[http://dbpedia.org/resource/Freedom_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/China_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/Alitalia-Linee_Aeree_Italiane]]></answer><answer><![CDATA[http://dbpedia.org/resource/Garuda_Indonesia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kenya_Airways]]></answer><answer><![CDATA[http://dbpedia.org/resource/Northwest_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/TAROM]]></answer><answer><![CDATA[http://dbpedia.org/resource/Air_Europa]]></answer><answer><![CDATA[http://dbpedia.org/resource/China_Southern_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/Korean_Air]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mandarin_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/KLM_Cityhopper]]></answer><answer><![CDATA[http://dbpedia.org/resource/Austral_L%C3%ADneas_A%C3%A9reas]]></answer><answer><![CDATA[http://dbpedia.org/resource/Alitalia]]></answer><answer><![CDATA[http://dbpedia.org/resource/China_Eastern_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/Comair]]></answer><answer><![CDATA[http://dbpedia.org/resource/Endeavor_Air]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mesaba_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/SkyWest_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/Czech_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/Vietnam_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/Brit_Air]]></answer><answer><![CDATA[http://dbpedia.org/resource/Donavia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aerom%C3%A9xico_Connect]]></answer><answer><![CDATA[http://dbpedia.org/resource/Xiamen_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/Air_France]]></answer><answer><![CDATA[http://dbpedia.org/resource/Middle_East_Airlines]]></answer><answer><![CDATA[http://dbpedia.org/resource/Song_(airline)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Alitalia_Express]]></answer><answer><![CDATA[http://dbpedia.org/resource/Alitalia_CityLiner]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="280" onlydbo="true">
<string lang="en"><![CDATA[What is the total population of Melbourne, Florida?]]></string>
<string lang="de"><![CDATA[Was ist die Gesamteinwohnerzahl von Melbourne, Florida?]]></string>
<string lang="es"><![CDATA[¿Cuál es la población total de Melbourne, Florida?]]></string>
<string lang="it"><![CDATA[Qual è la popolazione totale di Melbourne, Florida?]]></string>
<string lang="fr"><![CDATA[Quelle est la population totale de Melbourne, Floride?]]></string>
<string lang="nl"><![CDATA[Wat is de bevolking van Melbourne, Florida?]]></string>
<string lang="ro"><![CDATA[Care este populația totală a Melbourne, Florida?]]></string>
<keywords lang="en"><![CDATA[total population, Melbourne Florida]]></keywords>
<keywords lang="de"><![CDATA[Gesamteinwohnerzahl, Melbourne Florida]]></keywords>
<keywords lang="es"><![CDATA[población total, Melbourne Florida]]></keywords>
<keywords lang="it"><![CDATA[popolazione totale, Melbourne, Florida]]></keywords>
<keywords lang="fr"><![CDATA[population totale, Melbourne, Floride]]></keywords>
<keywords lang="nl"><![CDATA[bevolking, Melbourne Florida]]></keywords>
<keywords lang="ro"><![CDATA[populația totală, Melbourne Florida]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT ?uri 
WHERE { 
        <http://dbpedia.org/resource/Melbourne,_Florida> dbo:populationTotal ?uri .
}
]]></query>
<answers><answer><![CDATA[76068]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="281" onlydbo="true">
<string lang="en"><![CDATA[Which airports does Air China serve?]]></string>
<string lang="de"><![CDATA[Welche Flughäfen fliegt Air China an?]]></string>
<string lang="es"><![CDATA[¿Qué aeropuertos sirve Air China?]]></string>
<string lang="it"><![CDATA[Quali aeroporti sono serviti da Air China?]]></string>
<string lang="fr"><![CDATA[Quels sont les aéroports servis par Air Chine?]]></string>
<string lang="nl"><![CDATA[Naar welke luchthavens vliegt Air China?]]></string>
<string lang="ro"><![CDATA[Ce aeroporturi deservește Air China?]]></string>
<keywords lang="en"><![CDATA[airports, Air China]]></keywords>
<keywords lang="de"><![CDATA[Flughäfen, anfliegen, Air China]]></keywords>
<keywords lang="es"><![CDATA[aeropuertos, Air China]]></keywords>
<keywords lang="it"><![CDATA[aeroporti, Air China]]></keywords>
<keywords lang="fr"><![CDATA[Air Chine, aéroports]]></keywords>
<keywords lang="nl"><![CDATA[luchthavens, Air China]]></keywords>
<keywords lang="ro"><![CDATA[aeroporturi, Air China]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri 
WHERE {
        res:Air_China dbo:targetAirport ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Guiyang_Longdongbao_International_Airport]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lhasa_Gonggar_Airport]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hohhot_Baita_International_Airport]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hangzhou_Xiaoshan_International_Airport]]></answer><answer><![CDATA[http://dbpedia.org/resource/Wuhan_Tianhe_International_Airport]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tianjin_Binhai_International_Airport]]></answer><answer><![CDATA[http://dbpedia.org/resource/Guangzhou_Baiyun_International_Airport]]></answer><answer><![CDATA[http://dbpedia.org/resource/Chongqing_Jiangbei_International_Airport]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="date" id="282" onlydbo="true">
<string lang="en"><![CDATA[In which year was Rachel Stevens born?]]></string>
<string lang="de"><![CDATA[In welchem Jahr wurde Rachel Stevens geboren?]]></string>
<string lang="es"><![CDATA[¿En que año nació Rachel Stevens?]]></string>
<string lang="it"><![CDATA[In quale anno è nata Rachel Stevens?]]></string>
<string lang="fr"><![CDATA[Quand est née Rachel Stevens?]]></string>
<string lang="nl"><![CDATA[In welk jaar word Rachel Stevens geboren?]]></string>
<string lang="ro"><![CDATA[În ce an s-a născut Rachel Stevens?]]></string>
<keywords lang="en"><![CDATA[year, born, Rachel Stevens]]></keywords>
<keywords lang="de"><![CDATA[Jahr, geboren, Rachel Stevens]]></keywords>
<keywords lang="es"><![CDATA[año, nació, Rachel Stevens]]></keywords>
<keywords lang="it"><![CDATA[anno nascita, Rachel Stevens]]></keywords>
<keywords lang="fr"><![CDATA[année de naissance, Rachel Stevens]]></keywords>
<keywords lang="nl"><![CDATA[jaar, geboren, Rachel Stevens]]></keywords>
<keywords lang="ro"><![CDATA[an, născut, Rachel Stevens]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri 
WHERE {
        res:Rachel_Stevens dbo:birthYear ?uri .
}
]]></query>
<answers><answer><![CDATA[1978-01-01+02:00]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="283" onlydbo="true">
<string lang="en"><![CDATA[Where was JFK assassinated?]]></string>
<string lang="de"><![CDATA[Wo wurde JFK ermordet?]]></string>
<string lang="es"><![CDATA[¿Dónde fue JFK asesinado?]]></string>
<string lang="it"><![CDATA[Dove è stato assassinato JFK?]]></string>
<string lang="fr"><![CDATA[A été tué John Kennedy?]]></string>
<string lang="nl"><![CDATA[Waar word JFK vermoord?]]></string>
<string lang="ro"><![CDATA[Unde a fost asasinat JFK?]]></string>
<keywords lang="en"><![CDATA[JFK, assassinated]]></keywords>
<keywords lang="de"><![CDATA[JFK, ermordet]]></keywords>
<keywords lang="es"><![CDATA[JFK, asesinado]]></keywords>
<keywords lang="it"><![CDATA[JFK, assassinato]]></keywords>
<keywords lang="fr"><![CDATA[John Kennedy, assassinat]]></keywords>
<keywords lang="nl"><![CDATA[JFK, vermoord]]></keywords>
<keywords lang="ro"><![CDATA[JFK, asasinat]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri 
WHERE {
        res:John_F._Kennedy dbo:deathPlace ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Dallas]]></answer><answer><![CDATA[http://dbpedia.org/resource/Texas]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="284" onlydbo="true">
<string lang="en"><![CDATA[How many politicians graduated from Columbia University?]]></string>
<string lang="de"><![CDATA[Wieviele Politiker haben einen Abschluss von der Columbia University?]]></string>
<string lang="es"><![CDATA[¿Cuántos políticos se han graduado en la universidad de Columbia?]]></string>
<string lang="it"><![CDATA[Quanti politici si sono laureati alla Columbia University?]]></string>
<string lang="fr"><![CDATA[Combien d'hommes politiques ont étudié à la Columbia University?]]></string>
<string lang="nl"><![CDATA[Hoeveel politici zijn aan de Columbia University afgestudeerd?]]></string>
<string lang="ro"><![CDATA[Câți politicieni au absolvit la Universitatea Columbia?]]></string>
<keywords lang="en"><![CDATA[how many, politicians, graduated, Columbia University]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Politiker, Abschluss, Columbia University]]></keywords>
<keywords lang="es"><![CDATA[cuántos, políticos, graduados, universidad de Columbia]]></keywords>
<keywords lang="it"><![CDATA[quanti, politici, laureati, Columbia University]]></keywords>
<keywords lang="fr"><![CDATA[nombre, hommes politiques, étudier, Columbia University]]></keywords>
<keywords lang="nl"><![CDATA[hoeveel, politici afgestudeert aan, Columbia University]]></keywords>
<keywords lang="ro"><![CDATA[câți, politicieni, absolvit, Universitatea Columbia?]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT COUNT(?uri) 
WHERE {
        ?uri dbo:profession res:Politician .
        ?uri dbo:almaMater res:Columbia_University .
}
]]></query>
<answers><answer><![CDATA[14]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="285" onlydbo="true">
<string lang="en"><![CDATA[Which scientist is known for the Manhattan Project and the Nobel Peace Prize?]]></string>
<string lang="de"><![CDATA[Welcher Wissenschaftler ist bekannt für das Manhattan-Projekt und den Friedensnobelpreis?]]></string>
<string lang="es"><![CDATA[¿Qué científicos son conocidos por el proyecto Manhattan y el premio Nobel de la Paz?]]></string>
<string lang="it"><![CDATA[Quale scienziato è conosciuto per il progetto Manhattan e per il premio Nobel per la pace?]]></string>
<string lang="fr"><![CDATA[Quel chercheur est connu pour le projet Manhattan et le prix Nobel de la paix?]]></string>
<string lang="nl"><![CDATA[Welke wetenschaper staat bekend om het Manhattan Project en de Nobelprijs voor de Vrede?]]></string>
<string lang="ro"><![CDATA[Care om de știință este cunoscut pentru proiectul Manhattan și pentru premiul Nobel pentru pace?]]></string>
<keywords lang="en"><![CDATA[scientist, known for, Manhattan Project, Nobel Peace Prize]]></keywords>
<keywords lang="de"><![CDATA[Wissenschaftler, bekannt für, Manhattan-Projekt, Friedensnobelpreis]]></keywords>
<keywords lang="es"><![CDATA[científico, conocidos, proyecto Manhattan, premio Nobel de la Paz]]></keywords>
<keywords lang="it"><![CDATA[scienziato, conosciuto, progetto Manhattan, premio Nobel per la pace]]></keywords>
<keywords lang="fr"><![CDATA[chercheur, projet Manhattan, prix Nobel de la paix]]></keywords>
<keywords lang="nl"><![CDATA[wetenschaper, bekend om, Manhattan Project, Nobelprijs voor de Vrede]]></keywords>
<keywords lang="ro"><![CDATA[om de știință, cunoscut pentru, proiect Manhattan, premiul Nobel pentru pace]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:knownFor res:Manhattan_Project .
        ?uri rdf:type dbo:Scientist .
        ?uri dbo:knownFor res:Nobel_Peace_Prize .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Joseph_Rotblat]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="286" onlydbo="false">
<string lang="en"><![CDATA[What is the highest volcano in Africa?]]></string>
<string lang="de"><![CDATA[Was ist der höchste Vulkan in Afrika?]]></string>
<string lang="es"><![CDATA[¿Cuál es el volcán mas alto en África?]]></string>
<string lang="it"><![CDATA[Qual è il vulcano più alto in Africa?]]></string>
<string lang="fr"><![CDATA[Quel est le volcan le plus haut d'Afrique?]]></string>
<string lang="nl"><![CDATA[Wat is de hoogste vulkaan in Afrika?]]></string>
<string lang="ro"><![CDATA[Care este cel mai înalt vulcan din Africa?]]></string>
<keywords lang="en"><![CDATA[highest, volcano, Africa]]></keywords>
<keywords lang="de"><![CDATA[höchste, Vulkan, Afrika]]></keywords>
<keywords lang="es"><![CDATA[volcán, mas alto, África]]></keywords>
<keywords lang="it"><![CDATA[vulcano, più alto, Africa]]></keywords>
<keywords lang="fr"><![CDATA[volcan, plus haut, Afrique]]></keywords>
<keywords lang="nl"><![CDATA[hoogste, vulkaan, Afrika]]></keywords>
<keywords lang="ro"><![CDATA[cel mai înalt, vulcan, Africa?]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX yago: <http://dbpedia.org/class/yago/> 
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Volcano .
        ?uri dbo:locatedInArea ?area .        
        ?area rdf:type yago:AfricanCountries . 
        ?uri dbo:elevation ?elevation .
}
ORDER BY DESC(?elevation) 
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Mount_Kilimanjaro]]></answer></answers></question>

