{
  "dataset": {
    "id": "qald-5_train"
  },
  "questions": [
    {
      "id": "106",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all professional skateboarders from Sweden.",
          "keywords": "professional, skateboarder, Sweden"
        },
        {
          "language": "de",
          "string": "Gib mir alle Profiskateboarder aus Schweden.",
          "keywords": "Profiskateboarder, Schweden"
        },
        {
          "language": "es",
          "string": "Dame todos las skateboarders profesionales de Suecia.",
          "keywords": "skateboarder profesional, Suecia"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli skateboarders professionisti della Svezia.",
          "keywords": "skateboarders professionisti, Svezia"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les skateboarders professionnels de Suède.",
          "keywords": "skateboarders professionnels, Suède"
        },
        {
          "language": "nl",
          "string": "Noem alle professionele skateboarders uit Zweden.",
          "keywords": "skateboarder, professioneel, Zweden"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți skateboarderii profesioniști din Suedia.",
          "keywords": "profesionist, skateboarder, Suedia"
        }
      ],
      "query": " PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Skateboarding . { ?uri dbo:birthPlace res:Sweden . } UNION { ?uri dbo:birthPlace ?place . ?place dbo:country res:Sweden . } } ",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Ali_Boulala"
        },
        {
          "string": "http://dbpedia.org/resource/Tony_Magnusson"
        }
      ]
    },
    {
      "id": "114",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all members of Prodigy.",
          "keywords": "member, Prodigy"
        },
        {
          "language": "de",
          "string": "Gib mir alle Bandmitglieder von Prodigy.",
          "keywords": "Bandmitglied, Prodigy"
        },
        {
          "language": "es",
          "string": "Dame todos los miembros de la banda Prodigy.",
          "keywords": "miembros de la banda Prodigy"
        },
        {
          "language": "it",
          "string": "Dammi tutti i membri dei Prodigy.",
          "keywords": "membri, Prodigy"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les membres de Prodigy.",
          "keywords": "members, Prodigy"
        },
        {
          "language": "nl",
          "string": "Noem alle leden van Prodigy.",
          "keywords": "leden, Prodigy"
        },
        {
          "language": "ro",
          "string": "Dă-mi toții membrii Prodigy.",
          "keywords": "membru, Prodigy"
        }
      ],
      "query": " PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri . } ",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Keith_Flint"
        },
        {
          "string": "http://dbpedia.org/resource/Maxim_Reality"
        },
        {
          "string": "http://dbpedia.org/resource/Liam_Howlett"
        }
      ]
    },
    {
      "id": "119",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all people that were born in Vienna and died in Berlin.",
          "keywords": "people, born, Vienna, die, Berlin"
        },
        {
          "language": "de",
          "string": "Gib mir alle Personen, die in Wien geboren wurden und in Berlin gestorben sind.",
          "keywords": "Person, geboren, Wien, gestorben, Berlin"
        },
        {
          "language": "es",
          "string": "Dame todas las personas que hayan nacido en Viena y hayan muerto en Berlin.",
          "keywords": "personas, nacidas en Viena, muertas en Berlin"
        },
        {
          "language": "it",
          "string": "Dammi tutte le persone che sono nate a Vienna e morte a Berlino.",
          "keywords": "persona, nata, Vienna, morta, Berlino"
        },
        {
          "language": "fr",
          "string": "Donne-moi toutes les personnes qui sont nées à Vienne et mortes à Berlin.",
          "keywords": "personnes, nées, Vienne, mortes, Berlin"
        },
        {
          "language": "nl",
          "string": "Noem alle personen die geboren zijn in Wenen en gestorven zijn in Berlijn.",
          "keywords": "persoon, geboren, Wenen, gestorven, Berlijn"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți oamenii care s-au născut în Viena și au murit în Berlin.",
          "keywords": "oameni, născut, Viena, murit, Berlin"
        }
      ],
      "query": " PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:birthPlace res:Vienna . ?uri dbo:deathPlace res:Berlin . } ",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Alfred_Halm"
        },
        {
          "string": "http://dbpedia.org/resource/Richard_Thurnwald"
        },
        {
          "string": "http://dbpedia.org/resource/Grete_von_Zieritz"
        },
        {
          "string": "http://dbpedia.org/resource/Eduard_von_Winterstein"
        },
        {
          "string": "http://dbpedia.org/resource/Karl_Hellmer"
        },
        {
          "string": "http://dbpedia.org/resource/Hilde_K%C3%B6rber"
        },
        {
          "string": "http://dbpedia.org/resource/Adolf_Klein"
        },
        {
          "string": "http://dbpedia.org/resource/Michael_von_Newlinsky"
        },
        {
          "string": "http://dbpedia.org/resource/Hugo_Flink"
        },
        {
          "string": "http://dbpedia.org/resource/Erik_Jan_Hanussen"
        },
        {
          "string": "http://dbpedia.org/resource/Therese_Gr%C3%BCnbaum"
        },
        {
          "string": "http://dbpedia.org/resource/Karl_Etlinger"
        },
        {
          "string": "http://dbpedia.org/resource/Steffie_Spira"
        }
      ]
    },
    {
      "id": "128",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all movies directed by Francis Ford Coppola.",
          "keywords": "movie, direct, Francis Ford Coppola"
        },
        {
          "language": "de",
          "string": "Gib mir alle Filme, bei denen Francis Ford Coppola Regie geführt hat.",
          "keywords": "Film, Regie, Francis Ford Coppola"
        },
        {
          "language": "es",
          "string": "Dame todas las películas que haya dirigido Francis Ford Coppola.",
          "keywords": "película, director, Francis Ford Coppola"
        },
        {
          "language": "it",
          "string": "Dammi tutti i film diretti da Francis Ford Coppola.",
          "keywords": "film, dirigere, Francis Ford Coppola"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les films dont Francis réalisés par Francis Ford Coppola.",
          "keywords": "film, directeur, Francis Ford Coppola"
        },
        {
          "language": "nl",
          "string": "Geef alle films die werden geregisseerd door Francis Ford Coppola.",
          "keywords": "films, regisseur, Francis Ford Coppola"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate filmele regizate de Francis Ford Coppola.",
          "keywords": "film, regizat, Francis Ford Coppola"
        }
      ],
      "query": " PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film . ?uri dbo:director res:Francis_Ford_Coppola . } ",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Hammett_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/The_Rain_People"
        },
        {
          "string": "http://dbpedia.org/resource/Twixt_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/The_Conversation"
        },
        {
          "string": "http://dbpedia.org/resource/The_Godfather_Part_II"
        },
        {
          "string": "http://dbpedia.org/resource/The_Godfather_Part_III"
        },
        {
          "string": "http://dbpedia.org/resource/The_Terror_(1963_film)"
        },
        {
          "string": "http://dbpedia.org/resource/The_Cotton_Club_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/The_Rainmaker_(1997_film)"
        },
        {
          "string": "http://dbpedia.org/resource/Apocalypse_Now"
        },
        {
          "string": "http://dbpedia.org/resource/Dementia_13"
        },
        {
          "string": "http://dbpedia.org/resource/Tucker:_The_Man_and_His_Dream"
        },
        {
          "string": "http://dbpedia.org/resource/Tonight_for_Sure"
        },
        {
          "string": "http://dbpedia.org/resource/The_Bellboy_and_the_Playgirls"
        },
        {
          "string": "http://dbpedia.org/resource/Peggy_Sue_Got_Married"
        },
        {
          "string": "http://dbpedia.org/resource/Bram_Stoker's_Dracula"
        },
        {
          "string": "http://dbpedia.org/resource/Battle_Beyond_the_Sun"
        },
        {
          "string": "http://dbpedia.org/resource/Gardens_of_Stone"
        },
        {
          "string": "http://dbpedia.org/resource/Rumble_Fish"
        },
        {
          "string": "http://dbpedia.org/resource/You're_a_Big_Boy_Now"
        },
        {
          "string": "http://dbpedia.org/resource/Jack_(1996_film)"
        },
        {
          "string": "http://dbpedia.org/resource/The_Godfather"
        },
        {
          "string": "http://dbpedia.org/resource/The_Godfather_(film_series)"
        },
        {
          "string": "http://dbpedia.org/resource/The_Godfather_Saga"
        },
        {
          "string": "http://dbpedia.org/resource/Tetro"
        },
        {
          "string": "http://dbpedia.org/resource/The_Outsiders_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/Youth_Without_Youth_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/One_from_the_Heart"
        },
        {
          "string": "http://dbpedia.org/resource/Apocalypse_Now_Redux"
        },
        {
          "string": "http://dbpedia.org/resource/New_York_Stories"
        }
      ]
    },
    {
      "id": "129",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all actors starring in movies directed by William Shatner.",
          "keywords": "actor, starring, movie, direct, William Shatner"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schauspieler von Filmen, in denen William Shatner Regie geführt hat.",
          "keywords": "Schauspieler, Film, Regie, William Shatner"
        },
        {
          "language": "es",
          "string": "Dame todos los actores de películas dirigidas por William Shatner.",
          "keywords": "actor, película, director, William Shatner"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli attori che recitano in film diretti da William Shatner.",
          "keywords": "attore, recitare, film, diretto, William Shatner"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les acteurs qui ont joué dans des films réalisés par Williams Shatner.",
          "keywords": "acteur, film, réalisé, William Shatner"
        },
        {
          "language": "nl",
          "string": "Geef alle acteurs van films waar William Shatner de regie van voerde.",
          "keywords": "acteur, film, regisseur, William Shatner"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți actorii care joacă roluri principale în filme regizate de William Shatner.",
          "keywords": "actor, rol principal, film, regiza, William Shatner"
        }
      ],
      "query": " PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner . ?x dbo:starring ?uri . } ",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Leonard_Nimoy"
        },
        {
          "string": "http://dbpedia.org/resource/DeForest_Kelley"
        },
        {
          "string": "http://dbpedia.org/resource/James_Doohan"
        },
        {
          "string": "http://dbpedia.org/resource/Nichelle_Nichols"
        },
        {
          "string": "http://dbpedia.org/resource/Walter_Koenig"
        },
        {
          "string": "http://dbpedia.org/resource/George_Takei"
        },
        {
          "string": "http://dbpedia.org/resource/Dan_Gauthier"
        },
        {
          "string": "http://dbpedia.org/resource/Duane_Whitaker"
        },
        {
          "string": "http://dbpedia.org/resource/William_Shatner"
        },
        {
          "string": "http://dbpedia.org/resource/Dick_Van_Patten"
        },
        {
          "string": "http://dbpedia.org/resource/Rickey_Medlocke"
        },
        {
          "string": "http://dbpedia.org/resource/Amy_Acker"
        },
        {
          "string": "http://dbpedia.org/resource/John_Prosky"
        },
        {
          "string": "http://dbpedia.org/resource/Brenda_Bakke"
        },
        {
          "string": "http://dbpedia.org/resource/Tom_Towles"
        },
        {
          "string": "http://dbpedia.org/resource/J.T._Colosa"
        },
        {
          "string": "http://dbpedia.org/resource/Dan_Martin_(actor)"
        },
        {
          "string": "http://dbpedia.org/resource/Chuck_Williams_(actor)"
        }
      ]
    },
    {
      "id": "133",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all Australian nonprofit organizations.",
          "keywords": "nonprofit organization, Australia"
        },
        {
          "language": "de",
          "string": "Gib mir alle gemeinnützigen Organisationen in Australien.",
          "keywords": "gemeinnützige Organisation, Australien"
        },
        {
          "language": "es",
          "string": "Dame todas las organizaciones benéficas de Australia.",
          "keywords": "organizaciones benéficas, Australia"
        },
        {
          "language": "it",
          "string": "Dammi tutte le organizzazioni australiane non a scopo di lucro.",
          "keywords": "organizzazioni non a scopo di lucro, Australia"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les associations australiennes à but non lucratif.",
          "keywords": "Association à but non lucratif, Australie"
        },
        {
          "language": "nl",
          "string": "Noem alle Australische organisaties zonder winstoogmerk.",
          "keywords": "organisatie zonder winstoogmerk, Australië"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate organizațiile non-profit din Australia.",
          "keywords": "organizație non-profit, Australia"
        }
      ],
      "query": " PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:type res:Nonprofit_organization . { ?uri dbo:locationCountry res:Australia . } UNION { ?uri dbo:location ?x . ?x dbo:country res:Australia . } } ",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/The_Conversation_(website)"
        },
        {
          "string": "http://dbpedia.org/resource/YourView"
        },
        {
          "string": "http://dbpedia.org/resource/Arc_@_UNSW_Limited"
        },
        {
          "string": "http://dbpedia.org/resource/The_Co-op_Bookshop"
        },
        {
          "string": "http://dbpedia.org/resource/Aboriginal_Literacy_Foundation"
        },
        {
          "string": "http://dbpedia.org/resource/Cooperative_Research_Centre_for_Advanced_Composite_Structures"
        },
        {
          "string": "http://dbpedia.org/resource/Fair_Trade_Association_of_Australia_and_New_Zealand"
        },
        {
          "string": "http://dbpedia.org/resource/Victorian_Employers'_Chamber_of_Commerce_and_Industry"
        },
        {
          "string": "http://dbpedia.org/resource/Australia_21"
        },
        {
          "string": "http://dbpedia.org/resource/Forum_for_European%E2%80%93Australian_Science_and_Technology_Cooperation"
        },
        {
          "string": "http://dbpedia.org/resource/National_Science_Summer_School_Inc."
        },
        {
          "string": "http://dbpedia.org/resource/National_Youth_Science_Forum"
        },
        {
          "string": "http://dbpedia.org/resource/Snow_Foundation"
        },
        {
          "string": "http://dbpedia.org/resource/GMHBA_Limited"
        },
        {
          "string": "http://dbpedia.org/resource/Sustainable_Tourism_CRC"
        },
        {
          "string": "http://dbpedia.org/resource/Outward_Bound_Australia"
        },
        {
          "string": "http://dbpedia.org/resource/Poultry_CRC"
        },
        {
          "string": "http://dbpedia.org/resource/LIXI"
        },
        {
          "string": "http://dbpedia.org/resource/Currency_House"
        },
        {
          "string": "http://dbpedia.org/resource/HBF_Health_Fund"
        }
      ]
    },
    {
      "id": "140",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "List all games by GMT.",
          "keywords": "game, GMT"
        },
        {
          "language": "de",
          "string": "Liste alle Spiele von GMT auf.",
          "keywords": "Spiel, GMT"
        },
        {
          "language": "es",
          "string": "Dame todos los juegos de GMT.",
          "keywords": "juegos, GMT"
        },
        {
          "language": "it",
          "string": "Elenca tutti i giochi di GMT.",
          "keywords": "gioco, GMT"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les jeux de GMT.",
          "keywords": "jeux, GMT"
        },
        {
          "language": "nl",
          "string": "Noem alle spelen van GMT.",
          "keywords": "spel, GMT"
        },
        {
          "language": "ro",
          "string": "Enumeră toate jocurile de GMT",
          "keywords": "joc, GMT"
        }
      ],
      "query": " PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games . } ",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Fields_of_Fire_(game)"
        },
        {
          "string": "http://dbpedia.org/resource/Commands_&amp;_Colors:_Ancients"
        },
        {
          "string": "http://dbpedia.org/resource/Chandragupta_(board_game)"
        },
        {
          "string": "http://dbpedia.org/resource/Sword_of_Rome"
        },
        {
          "string": "http://dbpedia.org/resource/Paths_of_Glory_(board_game)"
        },
        {
          "string": "http://dbpedia.org/resource/Washington's_War"
        },
        {
          "string": "http://dbpedia.org/resource/Twilight_Struggle"
        }
      ]
    },
    {
      "id": "143",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "body": [
        {
          "language": "en",
          "string": "Give me all breeds of the German Shepherd dog.",
          "keywords": "breed, German Shepherd dog"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schäferhundrassen.",
          "keywords": "Schäferhundrasse"
        },
        {
          "language": "es",
          "string": "Dame todas las razas de pastor alemán.",
          "keywords": "razas de pastor alemán"
        },
        {
          "language": "it",
          "string": "Dammi tutte le razze del pastore tedesco.",
          "keywords": "razza, pastore tedesco"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les races de bergers allemands.",
          "keywords": "races, bergers allemands"
        },
        {
          "language": "nl",
          "string": "Noem alle soorten Duitse herders.",
          "keywords": "Duitse herder, soort"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate rasele câinelui Ciobănesc German.",
          "keywords": "rasă, câine Ciobănesc German"
        }
      ],
      "query": " PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbp:bred res:German_Shepherd . } ",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Antis_(dog)"
        },
        {
          "string": "http://dbpedia.org/resource/Lightning_(dog)"
        },
        {
          "string": "http://dbpedia.org/resource/Mancs_(dog)"
        },
        {
          "string": "http://dbpedia.org/resource/Appollo_(dog)"
        },
        {
          "string": "http://dbpedia.org/resource/Nemo_A534"
        },
        {
          "string": "http://dbpedia.org/resource/Trakr"
        },
        {
          "string": "http://dbpedia.org/resource/Jet_of_Iada"
        },
        {
          "string": "http://dbpedia.org/resource/Crumstone_Irma"
        },
        {
          "string": "http://dbpedia.org/resource/Strongheart"
        },
        {
          "string": "http://dbpedia.org/resource/Rifleman_Khan"
        }
      ]
    },
    {
      "id": "160",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "body": [
        {
          "language": "en",
          "string": "Give me a list of all lakes in Denmark.",
          "keywords": "lake, Denmark"
        },
        {
          "language": "de",
          "string": "Gib mir eine Liste aller Seen in Dänemark.",
          "keywords": "See, Dänemark"
        },
        {
          "language": "es",
          "string": "Dame una lista de todos los lagos en Dinamarca.",
          "keywords": "lista, lagos, Dinamarca"
        },
        {
          "language": "it",
          "string": "Dammi una lista di tutti i laghi della Danimarca.",
          "keywords": "lago, Danimarca"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les lacs du Danemark.",
          "keywords": "lacs, Danemark"
        },
        {
          "language": "nl",
          "string": "Noem alle meren in Denemarken.",
          "keywords": "meer, Denemarken"
        },
        {
          "language": "ro",
          "string": "Dă-mi o listă a tuturor lacurilor din Danemarca.",
          "keywords": "lac, Danemarca"
        }
      ],
      "query": " PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX yago: <http://dbpedia.org/clas/yago/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { { ?uri rdf:type dbo:Lake . ?uri dbo:country res:Denmark . } UNION { ?uri rdf:type yago:LakesOfDenmark . } } ",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/The_Lakes,_Copenhagen"
        },
        {
          "string": "http://dbpedia.org/resource/Lake_Bagsv%C3%A6rd"
        },
        {
          "string": "http://dbpedia.org/resource/B%C3%B8lling_lake"
        },
        {
          "string": "http://dbpedia.org/resource/Fures%C3%B8_(lake)"
        },
        {
          "string": "http://dbpedia.org/resource/Lake_Esrum"
        },
        {
          "string": "http://dbpedia.org/resource/Lake_Madum"
        },
        {
          "string": "http://dbpedia.org/resource/Arres%C3%B8"
        },
        {
          "string": "http://dbpedia.org/resource/Eg%C3%A5_Engs%C3%B8"
        }
      ]
    },
    {
      "id": "164",
      "hybrid": "false",
      "answertype": "list",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all launch pads operated by NASA.",
          "keywords": "launch pad, operate, NASA"
        },
        {
          "language": "de",
          "string": "Gib mir alle von der NASA betriebenen Startrampen.",
          "keywords": "Startrampe, betreiben, NASA"
        },
        {
          "language": "es",
          "string": "Dame todas las plataformas de lanzamiento operadas por la NASA.",
          "keywords": "plataforma de lanzamiento, operada por la NASA"
        },
        {
          "language": "it",
          "string": "Dammi tutte le rampe di lancio gestite dalla NASA.",
          "keywords": "rampa di lancio, gestire, NASA"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les rampes de lancements des Etats-unis.",
          "keywords": "rampes de lancements, Etats-unis"
        },
        {
          "language": "nl",
          "string": "Noem alle lanceerplatformen van de NASA.",
          "keywords": "lanceerplatform, NASA"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate rampele de lansare operate de către NASA.",
          "keywords": "rampă de lansare, operat, NASA"
        }
      ],
      "query": " PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad . ?uri dbo:operator res:NASA . } ",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0"
        },
        {
          "string": "http://dbpedia.org/resource/Broglio_Space_Centre"
        },
        {
          "string": "http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39"
        },
        {
          "string": "http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13"
        },
        {
          "string": "http://dbpedia.org/resource/Keweenaw_Rocket_Range"
        },
        {
          "string": "http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36"
        },
        {
          "string": "http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3"
        }
      ]
    },
    {
      "id": "17",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "true",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all cities in New Jersey with more than 100000 inhabitants.",
          "keywords": "New Jersey, city, inhabitants, more than 100000"
        },
        {
          "language": "de",
          "string": "Gib mir alle Städte in New Jersey, die mehr als 100000 Einwohner haben.",
          "keywords": "New Jersey, Stadt, Einwohner, mehr als 100000"
        },
        {
          "language": "es",
          "string": "Dame todas las cuidades en New Jersey que tengan más de 100000 habitantes.",
          "keywords": "New Jersey, ciudad, habitantes, más de 100000"
        },
        {
          "language": "it",
          "string": "Dammi tutte le città del New Jersey con più di 100000 abitanti.",
          "keywords": "New Jersey, città, abitanti, più di 100000"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les villes du New Jersey avec plus de 100000 habitants.",
          "keywords": "New Jersey, villes, habitants, plus de 100000"
        },
        {
          "language": "nl",
          "string": "Geef alle steden in New Jersey met meer dan 100000 inwoners.",
          "keywords": "New Jersey, stad, inwoners, meer dan 100000"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate orașele din New Jersey cu mai mult de 100000 de locuitori.",
          "keywords": "New Jersey, oraș, locuitori, mai mult de 100000"
        }
      ],
      "query": " PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City . ?uri dbo:isPartOf res:New_Jersey . ?uri dbo:populationTotal ?inhabitants . FILTER (?inhabitants > 10) . } ",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Newark,_New_Jersey"
        },
        {
          "string": "http://dbpedia.org/resource/Elizabeth,_New_Jersey"
        },
        {
          "string": "http://dbpedia.org/resource/Jersey_City,_New_Jersey"
        },
        {
          "string": "http://dbpedia.org/resource/Paterson,_New_Jersey"
        }
      ]
    },
    {
      "id": "176",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "List the children of Margaret Thatcher.",
          "keywords": "Margaret Thatcher, child"
        },
        {
          "language": "de",
          "string": "Liste die Kinder von Margaret Thatcher auf.",
          "keywords": "Margaret Thatcher, Kind"
        },
        {
          "language": "es",
          "string": "Dame una lista de los hijos de Margaret Thatcher.",
          "keywords": "Margaret Thatcher, hijos"
        },
        {
          "language": "it",
          "string": "Elenca i figli di Margaret Thatcher.",
          "keywords": "Margaret Thatcher, figlio"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les enfants de Margaret Thatcher.",
          "keywords": "enfants, Margaret Thatcher"
        },
        {
          "language": "nl",
          "string": "Noem alle kinderen van Margaret Thatcher.",
          "keywords": "kinderen, Margaret Thatcher"
        },
        {
          "language": "ro",
          "string": "Enumeră copiii lui Margaret Thatcher.",
          "keywords": "Margaret Thatcher, copil"
        }
      ],
      "query": " PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri . } ",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Carol_Thatcher"
        },
        {
          "string": "http://dbpedia.org/resource/Mark_Thatcher"
        }
      ]
    }
  ]
}