<?xml version="1.0"?>
<dataset id="qald-5_train">

<question id="133" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all Australian nonprofit organizations.]]></string>
<string lang="de"><![CDATA[Gib mir alle gemeinnützigen Organisationen in Australien.]]></string>
<string lang="es"><![CDATA[Dame todas las organizaciones benéficas de Australia.]]></string>
<string lang="it"><![CDATA[Dammi tutte le organizzazioni australiane non a scopo di lucro.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les associations australiennes à but non lucratif.]]></string>
<string lang="nl"><![CDATA[Noem alle Australische organisaties zonder winstoogmerk.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate organizațiile non-profit din Australia.]]></string>
<keywords lang="en"><![CDATA[nonprofit organization, Australia]]></keywords>
<keywords lang="de"><![CDATA[gemeinnützige Organisation, Australien]]></keywords>
<keywords lang="es"><![CDATA[organizaciones benéficas, Australia]]></keywords>
<keywords lang="it"><![CDATA[organizzazioni non a scopo di lucro, Australia]]></keywords>
<keywords lang="fr"><![CDATA[Association à but non lucratif, Australie]]></keywords>
<keywords lang="nl"><![CDATA[organisatie zonder winstoogmerk, Australië]]></keywords>
<keywords lang="ro"><![CDATA[organizație non-profit, Australia]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:type res:Nonprofit_organization . 
      { ?uri dbo:locationCountry res:Australia . } 
      UNION 
      { ?uri dbo:location ?x . 
        ?x dbo:country res:Australia . } 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/The_Conversation_(website)]]></answer><answer><![CDATA[http://dbpedia.org/resource/YourView]]></answer><answer><![CDATA[http://dbpedia.org/resource/Arc_@_UNSW_Limited]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Co-op_Bookshop]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aboriginal_Literacy_Foundation]]></answer><answer><![CDATA[http://dbpedia.org/resource/Cooperative_Research_Centre_for_Advanced_Composite_Structures]]></answer><answer><![CDATA[http://dbpedia.org/resource/Fair_Trade_Association_of_Australia_and_New_Zealand]]></answer><answer><![CDATA[http://dbpedia.org/resource/Victorian_Employers'_Chamber_of_Commerce_and_Industry]]></answer><answer><![CDATA[http://dbpedia.org/resource/Australia_21]]></answer><answer><![CDATA[http://dbpedia.org/resource/Forum_for_European%E2%80%93Australian_Science_and_Technology_Cooperation]]></answer><answer><![CDATA[http://dbpedia.org/resource/National_Science_Summer_School_Inc.]]></answer><answer><![CDATA[http://dbpedia.org/resource/National_Youth_Science_Forum]]></answer><answer><![CDATA[http://dbpedia.org/resource/Snow_Foundation]]></answer><answer><![CDATA[http://dbpedia.org/resource/GMHBA_Limited]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sustainable_Tourism_CRC]]></answer><answer><![CDATA[http://dbpedia.org/resource/Outward_Bound_Australia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Poultry_CRC]]></answer><answer><![CDATA[http://dbpedia.org/resource/LIXI]]></answer><answer><![CDATA[http://dbpedia.org/resource/Currency_House]]></answer><answer><![CDATA[http://dbpedia.org/resource/HBF_Health_Fund]]></answer></answers></question>

<question id="134" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[In which military conflicts did Lawrence of Arabia participate?]]></string>
<string lang="de"><![CDATA[An welchen militärischen Auseinandersetzungen war Lawrence von Arabien beteiligt?]]></string>
<string lang="es"><![CDATA[¿En qué conflictos militares participó Lawrence de Arabia?]]></string>
<string lang="it"><![CDATA[A quali conflitti militari ha partecipato Lawrence d'Arabia?]]></string>
<string lang="fr"><![CDATA[Dans quels conflits militaires a participé Lawrence d'Arabie?]]></string>
<string lang="nl"><![CDATA[Bij welke militaire conflicten was Lawrence of Arabia betrokken?]]></string>
<string lang="ro"><![CDATA[În care conflicte militare a participat Lawrence al Arabiei?]]></string>
<keywords lang="en"><![CDATA[Lawrence of Arabia, military conflict]]></keywords>
<keywords lang="de"><![CDATA[Lawrence von Arabien, militärische Auseinandersetzung]]></keywords>
<keywords lang="es"><![CDATA[Lawrence de Arabia, conflicto militar]]></keywords>
<keywords lang="it"><![CDATA[Lawrence d'Arabia, conflitto militare]]></keywords>
<keywords lang="fr"><![CDATA[Lawrence d'Arabie, conflits militaires]]></keywords>
<keywords lang="nl"><![CDATA[militair conflict, Lawrence of Arabia]]></keywords>
<keywords lang="ro"><![CDATA[Lawrence al Arabiei, conflict militar]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:T._E._Lawrence dbo:battle ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Capture_of_Damascus_(1918)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Arab_Revolt]]></answer><answer><![CDATA[http://dbpedia.org/resource/Battle_of_Megiddo_(1918)]]></answer><answer><![CDATA[http://dbpedia.org/resource/World_War_I]]></answer><answer><![CDATA[http://dbpedia.org/resource/Battle_of_Aqaba]]></answer><answer><![CDATA[http://dbpedia.org/resource/Siege_of_Medina]]></answer><answer><![CDATA[http://dbpedia.org/resource/Battle_of_Aba_el_Lissan]]></answer><answer><![CDATA[http://dbpedia.org/resource/Battle_of_Deraa]]></answer><answer><![CDATA[http://dbpedia.org/resource/Battle_of_Fwelia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Battle_of_Talifeh]]></answer></answers></question>

<question id="135" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who developed Minecraft?]]></string>
<string lang="de"><![CDATA[Wer hat Minecraft entwickelt?]]></string>
<string lang="es"><![CDATA[¿Quién desarrolló Minecraft?]]></string>
<string lang="it"><![CDATA[Chi ha sviluppato Minecraft?]]></string>
<string lang="fr"><![CDATA[Qui a dévelopé Minecraft?]]></string>
<string lang="nl"><![CDATA[Wie ontwikkelde Minecraft?]]></string>
<string lang="ro"><![CDATA[Cine a dezvoltat Minecraft?]]></string>
<keywords lang="en"><![CDATA[Minecraft, develop]]></keywords>
<keywords lang="de"><![CDATA[Minecraft, Entwickler]]></keywords>
<keywords lang="es"><![CDATA[Minecraft, desarrolló]]></keywords>
<keywords lang="it"><![CDATA[Minecraft, sviluppare]]></keywords>
<keywords lang="fr"><![CDATA[dévelopé, Minecraft]]></keywords>
<keywords lang="nl"><![CDATA[Minecraft, ontwikkeld]]></keywords>
<keywords lang="ro"><![CDATA[Minecraft, dezvolta]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Minecraft dbo:developer ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/4J_Studios]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mojang]]></answer></answers></question>

<question id="138" onlydbo="true" answertype="number" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[How many inhabitants does Maribor have?]]></string>
<string lang="de"><![CDATA[Wieviele Einwohner hat Maribor?]]></string>
<string lang="es"><![CDATA[¿Cuántos habitantes tiene Maribor?]]></string>
<string lang="it"><![CDATA[Quanti abitanti ha Maribor?]]></string>
<string lang="fr"><![CDATA[Combien d'habitants a Maribor?]]></string>
<string lang="nl"><![CDATA[Hoeveel inwoners heeft Maribor?]]></string>
<string lang="ro"><![CDATA[Câți locuitori are Maribor?]]></string>
<keywords lang="en"><![CDATA[Maribor, inhabitants]]></keywords>
<keywords lang="de"><![CDATA[Maribor, Einwohner]]></keywords>
<keywords lang="es"><![CDATA[Maribor, habitantes]]></keywords>
<keywords lang="it"><![CDATA[Maribor, abitanti]]></keywords>
<keywords lang="fr"><![CDATA[nombre d'habitants, Maribor]]></keywords>
<keywords lang="nl"><![CDATA[Maribor, inwoners]]></keywords>
<keywords lang="ro"><![CDATA[Maribor, locuitori]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?num 
WHERE { 
        res:Maribor dbo:populationTotal ?num . 
} 
]]>
</query>
<answers><answer><![CDATA[114487]]></answer></answers></question>

<question id="14" onlydbo="true" answertype="number" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[How tall is Claudia Schiffer?]]></string>
<string lang="de"><![CDATA[Wie groß ist Claudia Schiffer?]]></string>
<string lang="es"><![CDATA[¿Cómo de alta es Claudia Schiffer?]]></string>
<string lang="it"><![CDATA[Quanto è alta Claudia Schiffer?]]></string>
<string lang="fr"><![CDATA[Quelle est la taille de Claudia Schiffer?]]></string>
<string lang="nl"><![CDATA[Hoe lang is Claudia Schiffer?]]></string>
<string lang="ro"><![CDATA[Ce înălțime are Claudia Schiffer?]]></string>
<keywords lang="en"><![CDATA[Claudia Schiffer, tall]]></keywords>
<keywords lang="de"><![CDATA[Claudia Schiffer, groß]]></keywords>
<keywords lang="es"><![CDATA[Claudia Schiffer, altura]]></keywords>
<keywords lang="it"><![CDATA[Claudia Schiffer, altezza]]></keywords>
<keywords lang="fr"><![CDATA[taille, Claudia Schiffer]]></keywords>
<keywords lang="nl"><![CDATA[lengte, Claudia Schiffer]]></keywords>
<keywords lang="ro"><![CDATA[Claudia Schiffer, înălțime]]></keywords>
<query><![CDATA[ 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?height 
WHERE { 
        res:Claudia_Schiffer dbo:height ?height . 
} 
]]>
</query>
<answers><answer><![CDATA[1.81]]></answer></answers></question>

<question id="140" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[List all games by GMT.]]></string>
<string lang="de"><![CDATA[Liste alle Spiele von GMT auf.]]></string>
<string lang="es"><![CDATA[Dame todos los juegos de GMT.]]></string>
<string lang="it"><![CDATA[Elenca tutti i giochi di GMT.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les jeux de GMT.]]></string>
<string lang="nl"><![CDATA[Noem alle spelen van GMT.]]></string>
<string lang="ro"><![CDATA[Enumeră toate jocurile de GMT]]></string>
<keywords lang="en"><![CDATA[game, GMT]]></keywords>
<keywords lang="de"><![CDATA[Spiel, GMT]]></keywords>
<keywords lang="es"><![CDATA[juegos, GMT]]></keywords>
<keywords lang="it"><![CDATA[gioco, GMT]]></keywords>
<keywords lang="fr"><![CDATA[jeux, GMT]]></keywords>
<keywords lang="nl"><![CDATA[spel, GMT]]></keywords>
<keywords lang="ro"><![CDATA[joc, GMT]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:publisher res:GMT_Games . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Fields_of_Fire_(game)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Commands_&amp;_Colors:_Ancients]]></answer><answer><![CDATA[http://dbpedia.org/resource/Chandragupta_(board_game)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sword_of_Rome]]></answer><answer><![CDATA[http://dbpedia.org/resource/Paths_of_Glory_(board_game)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Washington's_War]]></answer><answer><![CDATA[http://dbpedia.org/resource/Twilight_Struggle]]></answer></answers></question>

<question id="141" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who founded Intel?]]></string>
<string lang="de"><![CDATA[Wer hat Intel gegründet?]]></string>
<string lang="es"><![CDATA[¿Quién fundó Intel?]]></string>
<string lang="it"><![CDATA[Chi ha fondato Intel?]]></string>
<string lang="fr"><![CDATA[Qui a fondé Intel?]]></string>
<string lang="nl"><![CDATA[Wie is de oprichter van Intel?]]></string>
<string lang="ro"><![CDATA[Cine a fondat Intel?]]></string>
<keywords lang="en"><![CDATA[Intel, founded]]></keywords>
<keywords lang="de"><![CDATA[Intel, gründen]]></keywords>
<keywords lang="es"><![CDATA[Intel, fundación]]></keywords>
<keywords lang="it"><![CDATA[Intel, fondatore]]></keywords>
<keywords lang="fr"><![CDATA[fondé, Intel]]></keywords>
<keywords lang="nl"><![CDATA[oprichter, Intel]]></keywords>
<keywords lang="ro"><![CDATA[Intel, fondat]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Intel dbo:foundedBy ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Robert_Noyce]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gordon_Moore]]></answer></answers></question>

<question id="142" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who is the husband of Amanda Palmer?]]></string>
<string lang="de"><![CDATA[Wer ist der Mann von Amanda Palmer?]]></string>
<string lang="es"><![CDATA[¿Quién es el marido de Amanda Palmer?]]></string>
<string lang="it"><![CDATA[Chi è il marito di Amanda Palmer?]]></string>
<string lang="fr"><![CDATA[Qui est l'épou d'Amanda Palmer?]]></string>
<string lang="nl"><![CDATA[Wie is de echtgenoot van Amanda Palmer?]]></string>
<string lang="ro"><![CDATA[Cine este soțul Amandei Palmer?]]></string>
<keywords lang="en"><![CDATA[Amanda Palmer, husband]]></keywords>
<keywords lang="de"><![CDATA[Amanda Palmer, Mann]]></keywords>
<keywords lang="es"><![CDATA[Amanda Palmer, marido]]></keywords>
<keywords lang="it"><![CDATA[Amanda Palmer, marito]]></keywords>
<keywords lang="fr"><![CDATA[épou, Amanda Palmer]]></keywords>
<keywords lang="nl"><![CDATA[Amanda Palmer, echtgenoot]]></keywords>
<keywords lang="ro"><![CDATA[Amanda Palmer, soț]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Amanda_Palmer dbp:spouse ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Neil_Gaiman]]></answer></answers></question>

<question id="143" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all breeds of the German Shepherd dog.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schäferhundrassen.]]></string>
<string lang="es"><![CDATA[Dame todas las razas de pastor alemán.]]></string>
<string lang="it"><![CDATA[Dammi tutte le razze del pastore tedesco.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les races de bergers allemands.]]></string>
<string lang="nl"><![CDATA[Noem alle soorten Duitse herders.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate rasele câinelui Ciobănesc German.]]></string>
<keywords lang="en"><![CDATA[breed, German Shepherd dog]]></keywords>
<keywords lang="de"><![CDATA[Schäferhundrasse]]></keywords>
<keywords lang="es"><![CDATA[razas de pastor alemán]]></keywords>
<keywords lang="it"><![CDATA[razza, pastore tedesco]]></keywords>
<keywords lang="fr"><![CDATA[races, bergers allemands]]></keywords>
<keywords lang="nl"><![CDATA[Duitse herder, soort]]></keywords>
<keywords lang="ro"><![CDATA[rasă, câine Ciobănesc German]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbp:breed res:German_Shepherd . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Antis_(dog)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lightning_(dog)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mancs_(dog)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Appollo_(dog)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nemo_A534]]></answer><answer><![CDATA[http://dbpedia.org/resource/Trakr]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jet_of_Iada]]></answer><answer><![CDATA[http://dbpedia.org/resource/Crumstone_Irma]]></answer><answer><![CDATA[http://dbpedia.org/resource/Strongheart]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rifleman_Khan]]></answer></answers></question>

<question id="144" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which cities does the Weser flow through?]]></string>
<string lang="de"><![CDATA[Durch welche Städte fließt die Weser?]]></string>
<string lang="es"><![CDATA[¿Por qué ciudades pasa el río Weser?]]></string>
<string lang="it"><![CDATA[Attraverso quali città scorre il fiume Weser?]]></string>
<string lang="fr"><![CDATA[Quels sont les villes traversées par la Weser?]]></string>
<string lang="nl"><![CDATA[Door welke steden loopt de Weser?]]></string>
<string lang="ro"><![CDATA[Ce orașe străbate Weserul?]]></string>
<keywords lang="en"><![CDATA[Weser, flow through, city]]></keywords>
<keywords lang="de"><![CDATA[Weser, fließen, Stadt]]></keywords>
<keywords lang="es"><![CDATA[cuidad, pasa, Weser]]></keywords>
<keywords lang="it"><![CDATA[città, scorrere, fiume Weser]]></keywords>
<keywords lang="fr"><![CDATA[villes, traverser, Weser]]></keywords>
<keywords lang="nl"><![CDATA[stad, loopt door, Weser]]></keywords>
<keywords lang="ro"><![CDATA[Weser, străbate, oraș]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Weser dbo:city ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Kassel]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hamelin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Fulda_(river)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Minden]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bremen]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bremerhaven]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hann._M%C3%BCnden]]></answer></answers></question>

<question id="145" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which countries are connected by the Rhine?]]></string>
<string lang="de"><![CDATA[Welche Länder verbindet der Rhein?]]></string>
<string lang="es"><![CDATA[¿Qué países une el Rhin?]]></string>
<string lang="it"><![CDATA[Quali stati sono collegati dal Reno?]]></string>
<string lang="fr"><![CDATA[Quels sont les pays connectés pas le Rhin?]]></string>
<string lang="nl"><![CDATA[Welke landen worden door de Rijn verbonden?]]></string>
<string lang="ro"><![CDATA[Ce țări sunt unite de Rin?]]></string>
<keywords lang="en"><![CDATA[Rhine, country]]></keywords>
<keywords lang="de"><![CDATA[Rhein, Land]]></keywords>
<keywords lang="es"><![CDATA[Rhin, une, países]]></keywords>
<keywords lang="it"><![CDATA[Reno, collegare, stati]]></keywords>
<keywords lang="fr"><![CDATA[pays connectés, Rhin]]></keywords>
<keywords lang="nl"><![CDATA[land, Rijn]]></keywords>
<keywords lang="ro"><![CDATA[Rin, țară]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Rhine dbp:country ?string .  
        ?uri rdf:type dbo:Country .  
        ?uri rdfs:label ?string . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Germany]]></answer><answer><![CDATA[http://dbpedia.org/resource/Liechtenstein]]></answer><answer><![CDATA[http://dbpedia.org/resource/Netherlands]]></answer><answer><![CDATA[http://dbpedia.org/resource/Switzerland]]></answer><answer><![CDATA[http://dbpedia.org/resource/Austria]]></answer><answer><![CDATA[http://dbpedia.org/resource/France]]></answer></answers></question>

<question id="146" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which professional surfers were born in Australia?]]></string>
<string lang="de"><![CDATA[Welche Profisurfer wurden in Australien geboren?]]></string>
<string lang="es"><![CDATA[¿Qué surfistas profesionales nacieron en Australia?]]></string>
<string lang="it"><![CDATA[Quali surfisti professionisti sono nati in Australia?]]></string>
<string lang="fr"><![CDATA[Quels surfeurs professionels sont nés en Australie?]]></string>
<string lang="nl"><![CDATA[Welke professionele surfers werden geboren in Australië?]]></string>
<string lang="ro"><![CDATA[Ce surferi profesioniști s-au născut în Australia?]]></string>
<keywords lang="en"><![CDATA[professional surfer, born, Australia]]></keywords>
<keywords lang="de"><![CDATA[Profisurfer, geboren, Australien]]></keywords>
<keywords lang="es"><![CDATA[surfista profesional, nacido, Australia]]></keywords>
<keywords lang="it"><![CDATA[surfista professionista, nato, Australia]]></keywords>
<keywords lang="fr"><![CDATA[surfeurs professionels, Australie]]></keywords>
<keywords lang="nl"><![CDATA[professionele surfer, Australië]]></keywords>
<keywords lang="ro"><![CDATA[surfer profesionist, născut, Australia]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:occupation res:Surfing .  
       { ?uri dbo:birthPlace res:Australia . }
       UNION 
       { ?uri dbo:birthPlace ?x . 
         ?x dbo:country res:Australia . }
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Midget_Farrelly]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ian_Cairns]]></answer><answer><![CDATA[http://dbpedia.org/resource/Koby_Abberton]]></answer></answers></question>

<question id="148" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[In which UK city are the headquarters of the MI6?]]></string>
<string lang="de"><![CDATA[In welcher Stadt im Vereinigten Königreich ist das Hauptquartier des MI6?]]></string>
<string lang="es"><![CDATA[¿En qué ciudad del reino unido se encuentra el cuartel genetal del MI6?]]></string>
<string lang="it"><![CDATA[In quale città del Regno Unito si trova il quartier generale del MI6?]]></string>
<string lang="fr"><![CDATA[Dans quelle ville anglaise se trouvent les quartiers genéraux du MI6?]]></string>
<string lang="nl"><![CDATA[In welke Britse stad is het hoofdkwartier van MI6 gevestigd?]]></string>
<string lang="ro"><![CDATA[În care oraș din Regatul Unit se află cartierul general al MI6?]]></string>
<keywords lang="en"><![CDATA[MI6, headquarters, city, UK]]></keywords>
<keywords lang="de"><![CDATA[MI6, Hauptquartier, Stadt, Vereinigtes Königreich]]></keywords>
<keywords lang="es"><![CDATA[MI6, cuartel general, ciudad, reino unido]]></keywords>
<keywords lang="it"><![CDATA[MI6, quartier generale, città, Regno Unito]]></keywords>
<keywords lang="fr"><![CDATA[ville anglaise, quartiers genéraux, MI6]]></keywords>
<keywords lang="nl"><![CDATA[MI6, hoofdkwartier, Britse stad]]></keywords>
<keywords lang="ro"><![CDATA[MI6, cartier general, oraș, Regatul Unit]]></keywords>
<query><![CDATA[ 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        res:Secret_Intelligence_Service dbo:headquarter ?uri . 
        ?uri dbo:country res:United_Kingdom . 
}  
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/London]]></answer></answers></question>

<question id="149" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which other weapons did the designer of the Uzi develop?]]></string>
<string lang="de"><![CDATA[Welche anderen Waffen hat der Erfinder der Uzi entwickelt?]]></string>
<string lang="es"><![CDATA[¿Qué otras armas desarrolló el inventor del Uzi?]]></string>
<string lang="it"><![CDATA[Quali altre armi sono state progettate dall'inventore dell'Uzi?]]></string>
<string lang="fr"><![CDATA[Quels autres armes ont été developées par l'inventeur de l'Uzi?]]></string>
<string lang="nl"><![CDATA[Welke andere wapens heeft de uitvinder van de Uzi ontwikkeld?]]></string>
<string lang="ro"><![CDATA[Ce alte arme a realizat proiectantul Uzi?]]></string>
<keywords lang="en"><![CDATA[Uzi, designer, develop, weapon]]></keywords>
<keywords lang="de"><![CDATA[Uzi, Erfinder, Waffe]]></keywords>
<keywords lang="es"><![CDATA[Uzi, inventor, otras armas]]></keywords>
<keywords lang="it"><![CDATA[Uzi, inventore, progettare, arma]]></keywords>
<keywords lang="fr"><![CDATA[armes, developées, inventeur de l'Uzi]]></keywords>
<keywords lang="nl"><![CDATA[Uzi, uitvinder, wapens]]></keywords>
<keywords lang="ro"><![CDATA[Uzi, proiectant, realiza, armă]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Weapon .  
        ?uri dbp:designer ?x . 
        res:Uzi dbp:designer ?x . 
        FILTER (?uri != res:Uzi) 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Minebea_PM-9]]></answer></answers></question>

<question id="15" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who created Goofy?]]></string>
<string lang="de"><![CDATA[Wer hat Goofy erfunden?]]></string>
<string lang="es"><![CDATA[¿Quién es el creador de Goofy?]]></string>
<string lang="it"><![CDATA[Chi è il creatore di Pippo?]]></string>
<string lang="fr"><![CDATA[Qui est le créateur de Goofy?]]></string>
<string lang="nl"><![CDATA[Wie bedacht Goofy?]]></string>
<string lang="ro"><![CDATA[Cine l-a creat pe Goofy?]]></string>
<keywords lang="en"><![CDATA[created, Goofy]]></keywords>
<keywords lang="de"><![CDATA[erfinden, Goofy]]></keywords>
<keywords lang="es"><![CDATA[creador, Goofy]]></keywords>
<keywords lang="it"><![CDATA[creatore, Pippo]]></keywords>
<keywords lang="fr"><![CDATA[Goofy, créateur]]></keywords>
<keywords lang="nl"><![CDATA[bedenker, Goofy]]></keywords>
<keywords lang="ro"><![CDATA[creat, Goofy]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Goofy dbo:creator ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Walt_Disney]]></answer><answer><![CDATA[http://dbpedia.org/resource/Paul_Murry]]></answer><answer><![CDATA[http://dbpedia.org/resource/Del_Connell]]></answer></answers></question>

<question id="150" onlydbo="true" answertype="boolean" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Was the Cuban Missile Crisis earlier than the Bay of Pigs Invasion?]]></string>
<string lang="de"><![CDATA[War die Kubakrise vor der Schweinebuchtinvasion?]]></string>
<string lang="es"><![CDATA[¿Fué la crisis de cuba antes de la invasión de bahía de cochinos?]]></string>
<string lang="it"><![CDATA[La crisi dei missili di Cuba avvenne prima dello sbarco nella Baia dei Porci?]]></string>
<string lang="fr"><![CDATA[La crise des missiles de Cuba a-t-elle eu lieu avant the débarquement de la baie des Cochons?]]></string>
<string lang="nl"><![CDATA[Was de Cubacrisis eerder dan de invasie in de Varkensbaai?]]></string>
<string lang="ro"><![CDATA[A avut loc mai devreme Criza rachetelor din Cuba decât Invazia din Golful Porcilor?]]></string>
<keywords lang="en"><![CDATA[Cuban Missile Crisis, earlier, Bay of Pigs Invasion]]></keywords>
<keywords lang="de"><![CDATA[Kubakrise, vor, Schweinebuchtinvasion]]></keywords>
<keywords lang="es"><![CDATA[crísis de cuba, anterior a la invasión de bahía de cochinos?]]></keywords>
<keywords lang="it"><![CDATA[Crisi dei missili di Cuba, precedente, sbarco nella Baia dei Porci]]></keywords>
<keywords lang="fr"><![CDATA[Débarquement de la baie des Cochons, crise des missiles de Cuba]]></keywords>
<keywords lang="nl"><![CDATA[Cubacrisis, eerder dan, invasie in de Varkensbaai]]></keywords>
<keywords lang="ro"><![CDATA[Criza rachetelor din Cuba, mai devreme, Invazia din Golful Porcilor]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Cuban_missile_crisis dbo:date ?x . 
        res:Bay_of_Pigs_Invasion dbo:date ?y . 
        FILTER (?x < ?y) 
} 
]]>
</query>
<answers><answer><![CDATA[false]]></answer></answers></question>

<question id="153" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[What is the ruling party in Lisbon?]]></string>
<string lang="de"><![CDATA[Welche Partei regiert in Lissabon?]]></string>
<string lang="es"><![CDATA[¿Qué partido gobierna en Lisboa?]]></string>
<string lang="it"><![CDATA[Qual è il partito che governa Lisbona?]]></string>
<string lang="fr"><![CDATA[Quel est le parti au pouvoir à Lisbonne?]]></string>
<string lang="nl"><![CDATA[Welke partij is aan de macht in Lissabon?]]></string>
<string lang="ro"><![CDATA[Care este partidul la putere în Lisabona?]]></string>
<keywords lang="en"><![CDATA[Lisbon, ruling party]]></keywords>
<keywords lang="de"><![CDATA[Lissabon, regieren, Partei]]></keywords>
<keywords lang="es"><![CDATA[Lisboa, gobierna, partido]]></keywords>
<keywords lang="it"><![CDATA[Lisbona, governa, partito]]></keywords>
<keywords lang="fr"><![CDATA[parti au pouvoir, Lisbonne]]></keywords>
<keywords lang="nl"><![CDATA[Lissabon, partij, aan de macht]]></keywords>
<keywords lang="ro"><![CDATA[Lisabona, partid la putere]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Lisbon dbp:leaderParty ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Socialist_Party_(Portugal)]]></answer></answers></question>

<question id="154" onlydbo="false" answertype="string" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[What are the nicknames of San Francisco?]]></string>
<string lang="de"><![CDATA[Was sind die Spitznamen von San Francisco?]]></string>
<string lang="es"><![CDATA[¿Cuál es el apodo de San Francisco?]]></string>
<string lang="it"><![CDATA[Quali sono i soprannomi di San Francisco?]]></string>
<string lang="fr"><![CDATA[Quels sont les surnoms de San Francisco?]]></string>
<string lang="nl"><![CDATA[Wat zijn bijnamen van San Francisco?]]></string>
<string lang="ro"><![CDATA[Care sunt poreclele pentru San Francisco?]]></string>
<keywords lang="en"><![CDATA[San Francisco, nickname]]></keywords>
<keywords lang="de"><![CDATA[San Francisco, Spitzname]]></keywords>
<keywords lang="es"><![CDATA[San Francisco, apodo]]></keywords>
<keywords lang="it"><![CDATA[San Francisco, soprannome]]></keywords>
<keywords lang="fr"><![CDATA[surnoms, San Francisco]]></keywords>
<keywords lang="nl"><![CDATA[bijnaam, San Francisco]]></keywords>
<keywords lang="ro"><![CDATA[San Francisco, poreclă]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?string 
WHERE { 
        res:San_Francisco dbp:nickname ?string . 
} 
]]>
</query>
<answers><answer><![CDATA[The City by the Bay; Fog City; San Fran; Frisco; The City that Knows How ; Baghdad by the Bay ; The Paris of the West]]></answer></answers></question>

