<?xml version="1.0"?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="287" onlydbo="false">
<string lang="en"><![CDATA[Which beer originated in Ireland?]]></string>
<string lang="de"><![CDATA[Welches Bier kommt aus Irland?]]></string>
<string lang="es"><![CDATA[¿Qué cerveza se ha originado en Irlanda?]]></string>
<string lang="it"><![CDATA[Quale birra è originaria dell'Irlanda?]]></string>
<string lang="fr"><![CDATA[Quelles bières viennent de l'Irlande?]]></string>
<string lang="nl"><![CDATA[Welke bieren komen uit Ierland?]]></string>
<string lang="ro"><![CDATA[Ce bere este originară din Irlanda?]]></string>
<keywords lang="en"><![CDATA[beer, originated, Ireland]]></keywords>
<keywords lang="de"><![CDATA[Bier, kommen aus, Irland]]></keywords>
<keywords lang="es"><![CDATA[cerveza, originado, Irlanda]]></keywords>
<keywords lang="it"><![CDATA[birra, origine, Irlanda]]></keywords>
<keywords lang="fr"><![CDATA[bières, Irlande?]]></keywords>
<keywords lang="nl"><![CDATA[bieren, komen uit, Ierland]]></keywords>
<keywords lang="ro"><![CDATA[bere, originară, Irlanda]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE {
        ?uri dbp:type res:Beer .
        ?uri dbp:origin "Ireland"@en .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Guinness]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="288" onlydbo="false">
<string lang="en"><![CDATA[What are the specialities of the UNC Health Care?]]></string>
<string lang="de"><![CDATA[Worauf ist die UNC Health Care spezialisiert?]]></string>
<string lang="es"><![CDATA[¿Cuáles son las especialidades del UNC Health Care?]]></string>
<string lang="it"><![CDATA[Quali sono le specialità della UNC Health Care?]]></string>
<string lang="fr"><![CDATA[Quelles sont les spécialités de l'UNC Health Care?]]></string>
<string lang="nl"><![CDATA[Wat zijn de specialiteiten van de UNC Health Care?]]></string>
<string lang="ro"><![CDATA[Care sunt specializările UNC Health Care?]]></string>
<keywords lang="en"><![CDATA[specialities, UNC Health Care]]></keywords>
<keywords lang="de"><![CDATA[Spezialisierung, UNC Health Care]]></keywords>
<keywords lang="es"><![CDATA[especialidades, UNC Health Care]]></keywords>
<keywords lang="it"><![CDATA[specialità, UNC Health Care?]]></keywords>
<keywords lang="fr"><![CDATA[spécialités, UNC Health Care?]]></keywords>
<keywords lang="nl"><![CDATA[specialiteiten, UNC Health Care]]></keywords>
<keywords lang="ro"><![CDATA[specializări, UNC Health Care]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        res:UNC_Health_Care dbp:speciality ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Cancer]]></answer><answer><![CDATA[http://dbpedia.org/resource/Trauma_center]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="289" onlydbo="true">
<string lang="en"><![CDATA[Who is the owner of Facebook?]]></string>
<string lang="de"><![CDATA[Wem gehört Facebook?]]></string>
<string lang="es"><![CDATA[¿Quién es el dueño de Facebook?]]></string>
<string lang="it"><![CDATA[Chi è il proprietario di Facebook?]]></string>
<string lang="fr"><![CDATA[À qui appartient Facebook?]]></string>
<string lang="nl"><![CDATA[Wie is de eigenaar van Facebook?]]></string>
<string lang="ro"><![CDATA[Cine este proprietarul Facebook?]]></string>
<keywords lang="en"><![CDATA[owner, Facebook]]></keywords>
<keywords lang="de"><![CDATA[gehört, Facebook]]></keywords>
<keywords lang="es"><![CDATA[dueño, Facebook]]></keywords>
<keywords lang="it"><![CDATA[proprietario, Facebook]]></keywords>
<keywords lang="fr"><![CDATA[propriétaire, Facebook]]></keywords>
<keywords lang="nl"><![CDATA[eigenaar, Facebook]]></keywords>
<keywords lang="ro"><![CDATA[proprietar, Facebook?]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Facebook dbo:foundedBy ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Mark_Zuckerberg]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="290" onlydbo="true">
<string lang="en"><![CDATA[From which region is the Melon de Bourgogne?]]></string>
<string lang="de"><![CDATA[Aus welcher Region ist der Melon de Bourgogne?]]></string>
<string lang="es"><![CDATA[¿De que región es el vino Melon de Bourgogne?]]></string>
<string lang="it"><![CDATA[Da quale regione proviene il Melon de Bourgogne?]]></string>
<string lang="fr"><![CDATA[De quelle région vient le Melon de Bourgogne?]]></string>
<string lang="nl"><![CDATA[Vanuit welke regio is de Melon de Bourgogne?]]></string>
<string lang="ro"><![CDATA[Din ce regiune provine Melon-ul de Bourgogne?]]></string>
<keywords lang="en"><![CDATA[region, Melon de Bourgogne]]></keywords>
<keywords lang="de"><![CDATA[Region, Melon de Bourgogne]]></keywords>
<keywords lang="es"><![CDATA[región, Melon de Bourgogne]]></keywords>
<keywords lang="it"><![CDATA[regione, Melon de Bourgogne]]></keywords>
<keywords lang="fr"><![CDATA[région, Melon de Bourgogne]]></keywords>
<keywords lang="nl"><![CDATA[regio, Melon de Bourgogne]]></keywords>
<keywords lang="ro"><![CDATA[regiune, Melon de Bourgogne]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        res:Melon_de_Bourgogne dbo:wineRegion ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Loire_Valley_(wine)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Oregon]]></answer><answer><![CDATA[http://dbpedia.org/resource/Washington_(state)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Southern_Ontario]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="291" onlydbo="true">
<string lang="en"><![CDATA[Who was influenced by Socrates?]]></string>
<string lang="de"><![CDATA[Wer wurde von Sokrates beeinflusst?]]></string>
<string lang="es"><![CDATA[¿Quién fue influenciado por Socrates?]]></string>
<string lang="it"><![CDATA[Chi fu influenzato da Socrate?]]></string>
<string lang="fr"><![CDATA[Qui a été influencé par Socrates?]]></string>
<string lang="nl"><![CDATA[Wie werd beïnvloed door Socrates?]]></string>
<string lang="ro"><![CDATA[Cine a fost influențat de către Socrate?]]></string>
<keywords lang="en"><![CDATA[influenced, Socrated]]></keywords>
<keywords lang="de"><![CDATA[beeinflusst, Sokrates]]></keywords>
<keywords lang="es"><![CDATA[influenciado, Socrates]]></keywords>
<keywords lang="it"><![CDATA[influenzato, Socrate]]></keywords>
<keywords lang="fr"><![CDATA[influencé, par Socrates]]></keywords>
<keywords lang="nl"><![CDATA[beïnvloed, Socrates]]></keywords>
<keywords lang="ro"><![CDATA[influențat, Socrate]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:influencedBy res:Socrates .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Epictetus]]></answer><answer><![CDATA[http://dbpedia.org/resource/Plato]]></answer><answer><![CDATA[http://dbpedia.org/resource/Allan_Bloom]]></answer><answer><![CDATA[http://dbpedia.org/resource/Antisthenes]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hannah_Arendt]]></answer><answer><![CDATA[http://dbpedia.org/resource/Stefan_Molyneux]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lucian]]></answer><answer><![CDATA[http://dbpedia.org/resource/Diogenes_of_Sinope]]></answer><answer><![CDATA[http://dbpedia.org/resource/Leo_Strauss]]></answer><answer><![CDATA[http://dbpedia.org/resource/Peter_Kreeft]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aristippus]]></answer><answer><![CDATA[http://dbpedia.org/resource/Seyhan_Kurt]]></answer><answer><![CDATA[http://dbpedia.org/resource/Euclid_of_Megara]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="292" onlydbo="false">
<string lang="en"><![CDATA[Who was president of Pakistan in 1978?]]></string>
<string lang="de"><![CDATA[Wer war 1978 Präsident von Pakistan?]]></string>
<string lang="es"><![CDATA[¿Quién fue el presidente de Pakistán en 1978?]]></string>
<string lang="it"><![CDATA[Chi fu presidente del Pakistan nel 1978?]]></string>
<string lang="fr"><![CDATA[Qui était le président du Pakistan en 1978?]]></string>
<string lang="nl"><![CDATA[Wie was president van Pakistan in 1978?]]></string>
<string lang="ro"><![CDATA[Cine a fost preşedintele Pakistanului în 1978?]]></string>
<keywords lang="en"><![CDATA[president, Pakistan, 1978]]></keywords>
<keywords lang="de"><![CDATA[Präsident, Pakistan, 1978]]></keywords>
<keywords lang="es"><![CDATA[presidente, Pakistán, 1978]]></keywords>
<keywords lang="it"><![CDATA[presidente, Pakistan, 1978]]></keywords>
<keywords lang="fr"><![CDATA[président, Pakistan, 1978]]></keywords>
<keywords lang="nl"><![CDATA[president, Pakistan, 1978]]></keywords>
<keywords lang="ro"><![CDATA[preşedinte, Pakistan, 1978]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE {
        ?uri dbp:title res:President_of_Pakistan .
        ?uri dbp:years 1978 .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Muhammad_Zia-ul-Haq]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="293" onlydbo="false">
<string lang="en"><![CDATA[Give me English actors starring in Lovesick.]]></string>
<string lang="de"><![CDATA[Gib mir britische Schauspieler, die in Lovesick mitspielen.]]></string>
<string lang="es"><![CDATA[Dame actores Ingleses protagonizando Lovesick.]]></string>
<string lang="it"><![CDATA[Dammi gli attori inglesi che hanno recitato in Lovesick.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les acteurs anglais de Lovesick.]]></string>
<string lang="nl"><![CDATA[Toen Brits acteurs met een rol in Lovesick.]]></string>
<string lang="ro"><![CDATA[Dă-mi actori englezi protagoniști în Lovesick.]]></string>
<keywords lang="en"><![CDATA[English actors, starring, Lovesick]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, britisch, mitspielen, Lovesick]]></keywords>
<keywords lang="es"><![CDATA[actores Ingleses, protagonistas, Lovesick ]]></keywords>
<keywords lang="it"><![CDATA[attori inglesi, protagonisti, Lovesick]]></keywords>
<keywords lang="fr"><![CDATA[acteurs, anglais, Lovesick]]></keywords>
<keywords lang="nl"><![CDATA[Brits acteurs, rol in, Lovesick]]></keywords>
<keywords lang="ro"><![CDATA[actori englezi, protagoniști, Lovesick]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX yago: <http://dbpedia.org/class/yago/> 
SELECT DISTINCT ?uri
WHERE {
          res:Lovesick dbo:starring ?uri .
        { ?uri dbo:birthPlace res:England . }
        UNION
        { ?uri rdf:type yago:EnglishFilmActors . }
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Dudley_Moore]]></answer><answer><![CDATA[http://dbpedia.org/resource/Alec_Guinness]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="295" onlydbo="true">
<string lang="en"><![CDATA[Who was married to president Chirac?]]></string>
<string lang="de"><![CDATA[Wer war mit Präsident Chirac verheiratet?]]></string>
<string lang="es"><![CDATA[¿Quién estuvo casado con el presidente Chirac?]]></string>
<string lang="it"><![CDATA[Chi è stato sposato con il presidente Chirac?]]></string>
<string lang="fr"><![CDATA[Qui était marrié avec le président Chirac?]]></string>
<string lang="nl"><![CDATA[Wie was met president Chirac getrouwd?]]></string>
<string lang="ro"><![CDATA[Cine a fost căsătorit cu președintele Chirac?]]></string>
<keywords lang="en"><![CDATA[married to, president Chirac]]></keywords>
<keywords lang="de"><![CDATA[verheiratet mit, Päsident Chirac]]></keywords>
<keywords lang="es"><![CDATA[casado con, presidented Chirac]]></keywords>
<keywords lang="it"><![CDATA[sposato con, presidente Chirac]]></keywords>
<keywords lang="fr"><![CDATA[épouse, président Chirac]]></keywords>
<keywords lang="nl"><![CDATA[getrouwd met, president Chirac]]></keywords>
<keywords lang="ro"><![CDATA[căsătorit cu, președintele Chirac]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri
WHERE { 
         res:Jacques_Chirac dbo:spouse ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Bernadette_Chirac]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="296" onlydbo="false">
<string lang="en"><![CDATA[What is the largest metropolitan area in Washington state?]]></string>
<string lang="de"><![CDATA[Was ist das größte Ballungsgebiet im Staat Washington?]]></string>
<string lang="es"><![CDATA[¿Cuál es el área metropolitana mas larga en el estado de Washington?]]></string>
<string lang="it"><![CDATA[Qual è la più grande area metropolitana nello stato di Washington?]]></string>
<string lang="fr"><![CDATA[Quelle est l'aire urbaine la pöus grande dans l'état de Washington?]]></string>
<string lang="nl"><![CDATA[Wat is het grootste stedelijke gebied in de staat Washington?]]></string>
<string lang="ro"><![CDATA[Care este cea mai mare zonă metropolitană din statul Washington?]]></string>
<keywords lang="en"><![CDATA[largest metropolitan area, Washington state]]></keywords>
<keywords lang="de"><![CDATA[größtes Ballungsgebiet, Staat Washington]]></keywords>
<keywords lang="es"><![CDATA[área metropolitana, mas larga, estado de Washington]]></keywords>
<keywords lang="it"><![CDATA[area metropolitana, più grande, stato di Washington]]></keywords>
<keywords lang="fr"><![CDATA[aire urbaine, plus grance, état de Washington]]></keywords>
<keywords lang="nl"><![CDATA[grootste stedelijke gebied, staat Washington]]></keywords>
<keywords lang="ro"><![CDATA[cea mai mare zonă metropolitană, statul Washington]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri
WHERE {
        <http://dbpedia.org/resource/Washington_(state)> dbp:largestmetro ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Seattle_metropolitan_area]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="297" onlydbo="true">
<string lang="en"><![CDATA[Where in France is sparkling wine produced?]]></string>
<string lang="de"><![CDATA[Wo in Frankreich wird Schaumwein hergestellt?]]></string>
<string lang="es"><![CDATA[¿Dónde en Francia se produce el vino espumoso?]]></string>
<string lang="it"><![CDATA[Dove si produce vino frizzante in Francia?]]></string>
<string lang="fr"><![CDATA[Où produit-on du vin mousseux en France?]]></string>
<string lang="nl"><![CDATA[Waar in Frankrijk word mousserende wijn geproduceerd?]]></string>
<string lang="ro"><![CDATA[Unde în Franța este produs vinul spumant?]]></string>
<keywords lang="en"><![CDATA[produced, France, sparkling wine]]></keywords>
<keywords lang="de"><![CDATA[Frankreich, hergestellt, Schaumwein]]></keywords>
<keywords lang="es"><![CDATA[produce, Francia, vino espumoso]]></keywords>
<keywords lang="it"><![CDATA[produrre, Francia, vino frizzante]]></keywords>
<keywords lang="fr"><![CDATA[france, produit, vin mousseux]]></keywords>
<keywords lang="nl"><![CDATA[Frankrijk, mousserende wijn, geproduceerd]]></keywords>
<keywords lang="ro"><![CDATA[produs, Franța, vin spumant]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:wineProduced res:Sparkling_wine .
        ?uri dbo:location res:France .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Loire_Valley_(wine)]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="298" onlydbo="true">
<string lang="en"><![CDATA[Where did Hillel Slovak die?]]></string>
<string lang="de"><![CDATA[Wo ist Hillel Slovak gestorben?]]></string>
<string lang="es"><![CDATA[¿Dónde murió Hillel Slovak?]]></string>
<string lang="it"><![CDATA[Dove è morto Hillel Slovak?]]></string>
<string lang="fr"><![CDATA[Donne moi le lieu de décès de Hillel Slovak.]]></string>
<string lang="nl"><![CDATA[Waar is Hillel Slovak gestorven?]]></string>
<string lang="ro"><![CDATA[Unde a murit Hillel Slovak?]]></string>
<keywords lang="en"><![CDATA[Hillel Slovak, death place]]></keywords>
<keywords lang="de"><![CDATA[Hillel Slovak, Todesort]]></keywords>
<keywords lang="es"><![CDATA[Hillel Slovak, donde murió]]></keywords>
<keywords lang="it"><![CDATA[Hillel Slovak, dove è morto]]></keywords>
<keywords lang="fr"><![CDATA[lieu, décès, Hillel Slovak]]></keywords>
<keywords lang="nl"><![CDATA[Hillel Slovak, doodsplaats]]></keywords>
<keywords lang="ro"><![CDATA[Hillel Slovak, locul morții]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        res:Hillel_Slovak dbo:deathPlace ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Hollywood]]></answer><answer><![CDATA[http://dbpedia.org/resource/California]]></answer><answer><![CDATA[http://dbpedia.org/resource/Los_Angeles]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="299" onlydbo="true">
<string lang="en"><![CDATA[What is the timezone in San Pedro de Atacama?]]></string>
<string lang="de"><![CDATA[In welcher Zeitzone liegt San Pedro de Atacama?]]></string>
<string lang="es"><![CDATA[¿Cuál es la zona horaria en San Pedro de Atacama?]]></string>
<string lang="it"><![CDATA[Qual è il fuso orario di San Pedro de Atacama?]]></string>
<string lang="fr"><![CDATA[Quel est le fuseau horaire de San Pedro de Atacama?]]></string>
<string lang="nl"><![CDATA[Wat is de tijdzone in San Pedro de Atacama?]]></string>
<string lang="ro"><![CDATA[Care este fusul orar din San Pedro de Atacama?]]></string>
<keywords lang="en"><![CDATA[timezone, San Pedro de Atacama]]></keywords>
<keywords lang="de"><![CDATA[Zeitzone, San Pedro de Atacama]]></keywords>
<keywords lang="es"><![CDATA[zona horaria, San Pedro de Atacama]]></keywords>
<keywords lang="it"><![CDATA[fuso orario, San Pedro de Atacama]]></keywords>
<keywords lang="fr"><![CDATA[fuseau horaire, San Pedro de Atacama]]></keywords>
<keywords lang="nl"><![CDATA[tijdzone, San Pedro de Atacama]]></keywords>
<keywords lang="ro"><![CDATA[fus orar, San Pedro de Atacama]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/timezone/> 
SELECT DISTINCT ?uri
WHERE {
        res:San_Pedro_de_Atacama dbo:timezone ?uri .
}
]]></query>
<answers/></question>

<question aggregation="false" hybrid="false" answertype="resource" id="300" onlydbo="true">
<string lang="en"><![CDATA[In which city does the Chile Route 68 end?]]></string>
<string lang="de"><![CDATA[In welcher Stadt hört die Ruta 68 auf?]]></string>
<string lang="es"><![CDATA[¿En que ciudad termina la ruta Chilena 68?]]></string>
<string lang="it"><![CDATA[In quale città termina la Route 68 in Cile?]]></string>
<string lang="fr"><![CDATA[Dans quelle ville se termine la route 68 chilienne?]]></string>
<string lang="nl"><![CDATA[In welke stad eindigt de Route 68 in Chili?]]></string>
<string lang="ro"><![CDATA[În ce oraș se termină Route 68 din Chile?]]></string>
<keywords lang="en"><![CDATA[city, Chile Route 68, ends]]></keywords>
<keywords lang="de"><![CDATA[Stadt, aufhören, Ruta 68]]></keywords>
<keywords lang="es"><![CDATA[ciudad, termina, ruta Chilena 68]]></keywords>
<keywords lang="it"><![CDATA[città, termina, Route 68, Cile]]></keywords>
<keywords lang="fr"><![CDATA[route 68, chili, ville, terminaison]]></keywords>
<keywords lang="nl"><![CDATA[stad, eindigt, Route 68, Chili]]></keywords>
<keywords lang="ro"><![CDATA[oraș, termină, Route 68, Chile]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        res:Chile_Route_68 dbo:routeEnd ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Valpara%C3%ADso]]></answer></answers></question>

<question id="301" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Who was vice president under the president who authorized atomic weapons against Japan during World War II?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?x text:"authorized" text:"atomic weapons against Japan" .
        ?x dbo:vicePresident ?uri .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Alben_W._Barkley]]></answer>
</answers>
</question>

<question id="302" answertype="resource" aggregation="false" onlydbo="false" hybrid="true">
<string lang="en"><![CDATA[In which town was the assassin of Martin Luther King born?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Martin_Luther_King,_Jr. text:"assassin" ?x . 
        ?x dbo:birthPlace ?uri .
        ?uri dbp:districtType "Township"@en .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Alton,_Illinois]]></answer>
</answers>
</question>

<question id="303" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Which anti-apartheid activist was born in Mvezo?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type text:"anti-apartheid activist" .
        ?uri dbo:birthPlace res:Mvezo .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Nelson_Mandela]]></answer>
</answers>
</question>

<question id="304" answertype="number" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[How many Golden Globe awards did the daughter of Henry Fonda win?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT ?n
WHERE {
        ?uri dbo:parent res:Henry_Fonda .
        ?uri text:"number of Golden Globe awards" ?n .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[7]]></answer>
</answers>
</question>

<question id="305" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Which recipients of the Victoria Cross died in the Battle of Arnhem?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
    ?uri dbo:award res:Victoria_Cross .
    ?uri text:"died in" text:"Battle of Arnhem" .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/John_Hollington_Grayburn]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/John_Baskeyfield]]></answer>
</answers>
</question>

<question id="306" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Where did the first man in space die?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        ?x text:"is" text:"first man in space" .
        ?x dbo:deathPlace ?uri .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Kirzhach]]></answer>
</answers>
</question>

<question id="307" answertype="number" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[How old was Steve Jobs' sister when she first met him?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT ?n 
WHERE {
        res:Steve_Jobs dbo:relative ?uri .
        ?uri text:"first met him when she was" ?n .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[25]]></answer>
</answers>
</question>

<question id="308" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Which members of the Wu-Tang Clan took their stage name from a movie?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        res:Wu-Tang_Clan dbo:bandMember ?uri .
        ?uri text:"stage name" ?x .
        ?x text:"from" text:"movie" .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Ghostface_Killah]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Method_Man]]></answer>
</answers>
</question>

<question id="309" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Which writers had influenced the philosopher that refused a Nobel Prize?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?x rdf:type dbo:Philosopher .
        ?x text:"refuse" text:"Nobel Prize" .
        ?x dbo:influencedBy ?uri .
        ?uri rdf:type dbo:Writer .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Gustave_Flaubert]]></answer>
</answers>
</question>

<question id="310" answertype="resource" aggregation="false" onlydbo="false" hybrid="true">
<string lang="en"><![CDATA[Under which king did the British prime minister that signed the Munich agreement serve?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX yago: <http://dbpedia.org/class/yago/>
SELECT DISTINCT ?uri 
WHERE {
        ?x rdf:type yago:PrimeMinistersOfTheUnitedKingdom .
        ?x text:"sign" text:"Munich Agreement" .
        ?x dbo:monarch ?uri .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/George_VI]]></answer>
</answers>
</question>

<question id="311" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Who composed the music for the film that depicts the early life of Jane Austin?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?x rdf:type dbo:Film .
        ?x text:"depicts the early life of" text:"Jane Austin" .
        ?x dbo:musicComposer ?uri .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Adrian_Johnston]]></answer>
</answers>
</question>

<question id="312" answertype="resource" aggregation="false" onlydbo="false" hybrid="true">
<string lang="en"><![CDATA[Who succeeded the pope that reigned only 33 days?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?x rdf:type dbo:Pope .
        ?x text:"reign" text:"33 days" .
        ?x dbp:predecessor ?uri .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Pope_John_Paul_II]]></answer>
</answers>
</question>

<question id="313" answertype="resource" aggregation="false" onlydbo="false" hybrid="true">
<string lang="en"><![CDATA[On which island did the national poet of Greece die?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX yago: <http://dbpedia.org/class/yago/>
SELECT DISTINCT ?uri 
WHERE {
        ?x text:"considered" text:"national poet of Greece" .
        ?x dbo:deathPlace ?uri .
        ?uri rdf:type yago:Island109316454 .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Corfu]]></answer>
</answers>
</question>

<question id="314" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Which horses did The Long Fellow ride?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?x text:"known as" text:"The Long Fellow" .
        ?x dbo:raceHorse ?uri .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/St._Paddy]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Petite_Etoile]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Alleged_(horse)]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Crepello]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Sir_Ivor]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Empery]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Nijinsky_(horse)]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/The_Minstrel]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Roberto_(horse)]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Never_Say_Die_(horse)]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Teenoso]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Royal_Academy_(horse)]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Rodrigo_de_Triano]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Shadeed]]></answer>
</answers>
</question>

<question id="315" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Of the people that died of radiation in Los Alamos, whose death was an accident?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?rui dbo:deathPlace <http://dbpedia.org/resource/Los_Alamos,_New_Mexico> .
        ?uri dbo:deathCause res:Acute_radiation_syndrome .
        ?uri text:"death circumstance" text:"accident" .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Louis_Slotin]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Harry_K._Daghlian,_Jr.]]></answer>
</answers>
</question>

<question id="316" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Which building owned by the Bank of America was featured in the TV series MegaStructures?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT ?uri 
WHERE {
        ?uri rdf:type dbo:Building.
        ?uri dbo:owner res:Bank_of_America . 
        ?uri text:"featured in" text:"MegaStructures" .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/page/Bank_of_America_Tower_(New_York_City)]]></answer>
</answers>
</question>

