{
  "dataset": {
    "id": "qald-5_train"
  },
  "questions": [
    {
      "id": "180",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "true",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all books by William Goldman with more than 300 pages.",
          "keywords": "book, William Goldman, pages, more than 300"
        },
        {
          "language": "de",
          "string": "Gib mir alle Bücher von William Goldman mit mehr als 300 Seiten.",
          "keywords": "Buch, William Goldman, Seiten, mehr als 300"
        },
        {
          "language": "es",
          "string": "Dame todos los libros de Wiliam Goldman con más de 300 páginas.",
          "keywords": "libro, William Goldman, más de 300 páginas"
        },
        {
          "language": "it",
          "string": "Dammi tutti i libri di Wiliam Goldman con più di 300 pagine.",
          "keywords": "libro, Wiliam Goldman, pagine, più di 300"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les livres de William Goldman avec plus de 300 pages.",
          "keywords": "livres, William Goldman, plus de 300 pages"
        },
        {
          "language": "nl",
          "string": "Geef alle boeken van William Goldman met meer dan 300 pagina's.",
          "keywords": "boeken, William Goldman, meer dan 300 pagina's"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate carțile de William Glodman cu mai mult de 300 de pagini.",
          "keywords": "carte, William Goldman, pagini, mai mult de 300"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book . ?uri dbo:author res:William_Goldman . ?uri dbo:numberOfPages ?x . FILTER (?x > 30)}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Wait_Till_Next_Year"
        },
        {
          "string": "http://dbpedia.org/resource/Control_(novel)"
        },
        {
          "string": "http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F"
        },
        {
          "string": "http://dbpedia.org/resource/Marathon_Man_(novel)"
        },
        {
          "string": "http://dbpedia.org/resource/Brothers_(Goldman_novel)"
        },
        {
          "string": "http://dbpedia.org/resource/Tinsel_(novel)"
        },
        {
          "string": "http://dbpedia.org/resource/Boys_and_Girls_Together"
        },
        {
          "string": "http://dbpedia.org/resource/Hype_and_Glory"
        },
        {
          "string": "http://dbpedia.org/resource/The_Princess_Bride"
        },
        {
          "string": "http://dbpedia.org/resource/The_Color_of_Light"
        }
      ]
    },
    {
      "id": "192",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "true",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Show me all songs from Bruce Springsteen released between 1980 and 1990.",
          "keywords": "song, Bruce Springsteen, release, between 1980 and 1990"
        },
        {
          "language": "de",
          "string": "Zeige mir alle Lieder von Bruce Springsteen, die zwischen 1980 und 1990 herausgebracht wurden.",
          "keywords": "Lied, Bruce Springsteen, herausbringen, zwischen 1980 und 1990"
        },
        {
          "language": "es",
          "string": "¿Enseñame todas las canciones de Bruce Springsteen que aparecieron entre 1980 y 1990.",
          "keywords": "canción, Bruce Springsteen, aparecida entre 1980 y 1990"
        },
        {
          "language": "it",
          "string": "Dammi tutte le canzoni di Bruce Springsteen rilasciate tra il 1980 e il 1990.",
          "keywords": "canzone, Bruce Springsteen, rilasciare, tra il 1980 e il 1990"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les morceaux de Bruce Springsteen qui ont été publiés entre 1980 et 1990.",
          "keywords": "morceaux, Bruce Springsteen, publiés entre 1980 et 1990"
        },
        {
          "language": "nl",
          "string": "Geef alle songs van Bruce Springsteen die werden uitgebracht tussen 1980 en 1990.",
          "keywords": "song, Bruce Springsteen, uitgebracht tussen 1980 en 1990"
        },
        {
          "language": "ro",
          "string": "Arată-mi toate melodiile de Bruce Springsten apărute între 1980 și 1990",
          "keywords": "melodie, Bruce Springsteen, apărut, între 1980 și 1990"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>PREFIX xsd: <http://w.w3.org/201/XMLSchema#>SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Song . ?uri dbo:artist res:Bruce_Springsteen . ?uri dbo:releaseDate ?date . FILTER (?date >= '1980-01-01'^xsd:date & ?date <= '190-12-31'^xsd:date)}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/No_Surrender_(song)"
        },
        {
          "string": "http://dbpedia.org/resource/Bobby_Jean"
        },
        {
          "string": "http://dbpedia.org/resource/Downbound_Train"
        },
        {
          "string": "http://dbpedia.org/resource/Darlington_County_(song)"
        },
        {
          "string": "http://dbpedia.org/resource/Johnny_99_(song)"
        },
        {
          "string": "http://dbpedia.org/resource/Working_on_the_Highway"
        }
      ]
    },
    {
      "id": "196",
      "hybrid": "false",
      "answertype": "string",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all B-sides of the Ramones.",
          "keywords": "Ramones, B-sides"
        },
        {
          "language": "de",
          "string": "Gib mir alle B-Seiten der Ramones.",
          "keywords": "Ramones, B-Seiten"
        },
        {
          "language": "es",
          "string": "Dame todas las caras B de los Ramones.",
          "keywords": "Ramones, cara B"
        },
        {
          "language": "it",
          "string": "Dammi tutti i lati B dei Ramones.",
          "keywords": "Ramones, lato B"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les faces B des Ramones.",
          "keywords": "faces B, Ramones"
        },
        {
          "language": "nl",
          "string": "Geef alle B-kantjes van singles van de Ramones.",
          "keywords": "B-kant, single, de Ramones"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate laturile B ale Ramones",
          "keywords": "Ramones, laturi B"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?string WHERE { ?x dbo:musicalArtist res:Ramones . ?x dbo:bSide ?string . }",
      "answers": [
        {
          "string": "\"Daytime Dilemma (Dangers of Love)\""
        },
        {
          "string": "\"Go Home Ann\" (12\" only)"
        },
        {
          "string": "\"Babysitter\""
        },
        {
          "string": "\"No-One Could Ever Love You More\" (Norway)"
        },
        {
          "string": "\"Saturday Night Out\""
        },
        {
          "string": "\"She's the One\""
        },
        {
          "string": "Censorshit"
        },
        {
          "string": "\"Do You Wanna Dance?\""
        },
        {
          "string": "\"I Don't Care\""
        }
      ]
    },
    {
      "id": "2",
      "hybrid": "false",
      "answertype": "date",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me the birthdays of all actors of the television show Charmed.",
          "keywords": "television show, Charmed, actor, birthday"
        },
        {
          "language": "de",
          "string": "Gib mir die Geburtstage von allen Darstellern der Fernsehserie Charmed.",
          "keywords": "Fernsehserie, Charmed, Darsteller, Geburtstag"
        },
        {
          "language": "es",
          "string": "Dame los cumpleaños de los actores de la serie de televisión Charmed.",
          "keywords": "serie televisiva, Charmed, actores, cumpleaños"
        },
        {
          "language": "it",
          "string": "Dammi le date dei compleanni di tutti gli attori della serie televisiva Charmed.",
          "keywords": "serie televisiva, Charmed, attore, compleanno"
        },
        {
          "language": "fr",
          "string": "Donnes-moi les dates de naissance des acteurs de la série télévisée Charmed.",
          "keywords": "série télévisée, Charmed, acteurs, date de naissance"
        },
        {
          "language": "nl",
          "string": "Noem de verjaardag van alle acteurs uit de televisieserie Charmed.",
          "keywords": "verjaardag, acteur, televisieserie, Charmed"
        },
        {
          "language": "ro",
          "string": "Dă-mi zilele de naștere a tuturor actorilor din serialul de televiziune Charmed",
          "keywords": "serial de televiziune, Charmed, actor, zi de naștere"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?date WHERE { res:Charmed dbo:starring ?actor . ?actor dbo:birthDate ?date .}",
      "answers": [
        {
          "string": "1985-11-30+02:00"
        },
        {
          "string": "1971-01-26+02:00"
        },
        {
          "string": "1973-12-03+02:00"
        },
        {
          "string": "1969-02-01+02:00"
        },
        {
          "string": "1969-02-08+02:00"
        },
        {
          "string": "1980-05-19+02:00"
        },
        {
          "string": "1968-07-27+02:00"
        },
        {
          "string": "1965-10-01+02:00"
        },
        {
          "string": "1971-04-12+02:00"
        },
        {
          "string": "1973-09-05+02:00"
        },
        {
          "string": "1972-12-19+02:00"
        },
        {
          "string": "1973-06-15+02:00"
        }
      ]
    },
    {
      "id": "28",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "body": [
        {
          "language": "en",
          "string": "Give me all communist countries.",
          "keywords": "communist countries"
        },
        {
          "language": "de",
          "string": "Gib mir alle kommunistischen Länder.",
          "keywords": "kommunistische Länder"
        },
        {
          "language": "es",
          "string": "Dame todos los países comunistas.",
          "keywords": "países comunistas"
        },
        {
          "language": "it",
          "string": "Dammi tutti i paesi comunisti.",
          "keywords": "paesi comunisti"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les pays communistes.",
          "keywords": "pays communistes"
        },
        {
          "language": "nl",
          "string": "Geef alle communistische landen.",
          "keywords": "communistische landen"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate țările comuniste.",
          "keywords": "țări comuniste"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:Country . { ?uri dbo:governmentType res:Communism . } UNION { ?uri dbo:governmentType res:Communist_state . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Mongolian_People's_Republic"
        },
        {
          "string": "http://dbpedia.org/resource/Division_of_Korea"
        },
        {
          "string": "http://dbpedia.org/resource/Provisional_People's_Committee_for_North_Korea"
        },
        {
          "string": "http://dbpedia.org/resource/Azerbaijan_People's_Government"
        },
        {
          "string": "http://dbpedia.org/resource/Republic_of_Mahabad"
        },
        {
          "string": "http://dbpedia.org/resource/Finnish_Democratic_Republic"
        }
      ]
    },
    {
      "id": "49",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "body": [
        {
          "language": "en",
          "string": "Give me all companies in the advertising industry.",
          "keywords": "company, advertising industry"
        },
        {
          "language": "de",
          "string": "Gib mir alle Unternehmen, die in der Werbebranche tätig sind.",
          "keywords": "Unternehmen, Werbebranche"
        },
        {
          "language": "es",
          "string": "Dame todas las empresas publicitarias.",
          "keywords": "empresas publicitarias"
        },
        {
          "language": "it",
          "string": "Dammi tutte le aziende pubblicitarie.",
          "keywords": "aziende pubblicitarie"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les agences de publicité.",
          "keywords": "agences de publicité"
        },
        {
          "language": "nl",
          "string": "Noem alle bedrijven die in de reclamebranche actief zijn.",
          "keywords": "bedrijf, reclamebranche"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate companiile din industria publicitară.",
          "keywords": "companii, industria publicitară"
        }
      ],
      "query": "PREFIX dbp: <http://dbpedia.org/property/>PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT COUNT(DISTINCT ?uri)WHERE { ?uri rdf:type dbo:Company . { ?uri dbo:industry res:Advertising } UNION { ?uri dbo:industry ?industry . FILTER regex(?industry,'advertising','i') . }",
      "answers": [
        {
          "string": "310"
        }
      ]
    },
    {
      "id": "51",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "true",
      "onlydbo": "false",
      "body": [
        {
          "language": "en",
          "string": "Give me all libraries established earlier than 1400.",
          "keywords": "libraries, established, earlier than 1400"
        },
        {
          "language": "de",
          "string": "Gib mir alle Bibliotheken, die vor 1400 gegründet worden.",
          "keywords": "Bibliotheken, gegründet, vor 1400"
        },
        {
          "language": "es",
          "string": "Dame todas las bibliotecas que fueron establecidas antes de 1400.",
          "keywords": "bibliotecas, establecidas, antes de 1400"
        },
        {
          "language": "it",
          "string": "Dammi tutte le biblioteche fondate prima del 1400.",
          "keywords": "biblioteche, fondate, prima del 1400"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les bibliothèques établies avant 1400.",
          "keywords": "bibliothèques, établies, avant 1400"
        },
        {
          "language": "nl",
          "string": "Geef me alle bibliotheken die voor 1400 werden opgericht.",
          "keywords": "bibliotheken, opgericht, voor 1400"
        },
        {
          "language": "ro",
          "string": "Dă-mi tote bibliotecile înființate înainte de 1400",
          "keywords": "biblioteci, înființat, înainte de 1400"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX dbp: <http://dbpedia.org/property/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:Library . ?uri dbp:established ?year . FILTER (?year < 140)}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Jagiellonian_Library"
        },
        {
          "string": "http://dbpedia.org/resource/Library_of_Ashurbanipal"
        },
        {
          "string": "http://dbpedia.org/resource/Cambridge_University_Library"
        },
        {
          "string": "http://dbpedia.org/resource/Austrian_National_Library"
        },
        {
          "string": "http://dbpedia.org/resource/Heidelberg_University_Library"
        },
        {
          "string": "http://dbpedia.org/resource/Mother_Irene_Gill_Memorial_Library"
        },
        {
          "string": "http://dbpedia.org/resource/National_and_University_Library_of_the_Republika_Srpska"
        },
        {
          "string": "http://dbpedia.org/resource/Maughan_Library"
        }
      ]
    },
    {
      "id": "53",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all federal chancellors of Germany.",
          "keywords": "Germany, federal chancellors"
        },
        {
          "language": "de",
          "string": "Gib mir alle Bundeskanzler.",
          "keywords": "Bundeskanzler"
        },
        {
          "language": "es",
          "string": "Dame todos los cancilleres alemanos.",
          "keywords": "cancilleres, alemanos"
        },
        {
          "language": "it",
          "string": "Dammi tutti i cancellieri tedeschi.",
          "keywords": "cancellieri, tedeschi"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les chancelièrs allemands.",
          "keywords": "chanceliers, allemands"
        },
        {
          "language": "nl",
          "string": "Noem alle Duitse bondskanseliers.",
          "keywords": "Duits, bondskanseliers"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți cancelarii federali ai Germaniei",
          "keywords": "Germania, cancelar federal"
        }
      ],
      "query": "PREFIX dbp: <http://dbpedia.org/property/>PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:Person . { ?uri dbo:office 'Chancelor of Germany' . } UNION { ?uri dbp:ofice res:Chancellor_of_Germany . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Helmut_Kohl"
        },
        {
          "string": "http://dbpedia.org/resource/Helmut_Schmidt"
        },
        {
          "string": "http://dbpedia.org/resource/Ludwig_Erhard"
        },
        {
          "string": "http://dbpedia.org/resource/Willy_Brandt"
        },
        {
          "string": "http://dbpedia.org/resource/Konrad_Adenauer"
        },
        {
          "string": "http://dbpedia.org/resource/Kurt_Georg_Kiesinger"
        },
        {
          "string": "http://dbpedia.org/resource/Otto_von_Bismarck"
        },
        {
          "string": "http://dbpedia.org/resource/Angela_Merkel"
        },
        {
          "string": "http://dbpedia.org/resource/Gerhard_Schr%C3%B6der"
        },
        {
          "string": "http://dbpedia.org/resource/Leo_von_Caprivi"
        },
        {
          "string": "http://dbpedia.org/resource/Chlodwig,_Prince_of_Hohenlohe-Schillingsf%C3%BCrst"
        },
        {
          "string": "http://dbpedia.org/resource/Adolf_Hitler"
        }
      ]
    },
    {
      "id": "57",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "List all episodes of the first season of the HBO television series The Sopranos.",
          "keywords": "HBO, television series, Sopranos, first season, episode"
        },
        {
          "language": "de",
          "string": "Liste alle Episoden der ersten Staffel der HBO-Fernsehserie Die Sopranos auf.",
          "keywords": "HBO-Fernsehserie, Sopranos, erste Staffel, Episode"
        },
        {
          "language": "es",
          "string": "Dame todos los episodios de la prímera época de la serie de HBO Los Sporanos.",
          "keywords": "serie televisiva de HBO, Los Sopranos, primera época, episodios"
        },
        {
          "language": "it",
          "string": "Elenca tutti gli episodi della prima stagione della serie televisiva di HBO i Sopranos.",
          "keywords": "serie televisiva di HBO, i Sopranos, prima stagione, episodio"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les épisodes de la première saison de la série télévisée de HBO les Sopranos.",
          "keywords": "épisodes de la première saison, HBO, les Sopranos"
        },
        {
          "language": "nl",
          "string": "Noem alle afleveringen van het eerste seizoen van de HBO-serie The Sopranos.",
          "keywords": "HBO-serie, The Sopranos, eerste seizoen, aflevering"
        },
        {
          "language": "ro",
          "string": "Listează toate episodele din primul sezon al serialului HBO de televiziune The Sopranos",
          "keywords": "HBO, serial de televiziune, Sopranos, primul sezon, episod"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos . ?uri dbo:seasonNumber 1 .}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/College_(The_Sopranos)"
        },
        {
          "string": "http://dbpedia.org/resource/Isabella_(The_Sopranos)"
        },
        {
          "string": "http://dbpedia.org/resource/Nobody_Knows_Anything"
        },
        {
          "string": "http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti"
        },
        {
          "string": "http://dbpedia.org/resource/The_Sopranos_(episode)"
        },
        {
          "string": "http://dbpedia.org/resource/Boca_(The_Sopranos)"
        },
        {
          "string": "http://dbpedia.org/resource/Meadowlands_(The_Sopranos)"
        },
        {
          "string": "http://dbpedia.org/resource/Down_Neck"
        },
        {
          "string": "http://dbpedia.org/resource/Denial,_Anger,_Acceptance"
        },
        {
          "string": "http://dbpedia.org/resource/Pax_Soprana"
        },
        {
          "string": "http://dbpedia.org/resource/A_Hit_Is_a_Hit"
        },
        {
          "string": "http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano"
        },
        {
          "string": "http://dbpedia.org/resource/46_Long"
        }
      ]
    },
    {
      "id": "63",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all actors starring in Last Action Hero.",
          "keywords": "actor, starring, Last Action Hero"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.",
          "keywords": "Schauspieler, mitspielen, Last Action Hero"
        },
        {
          "language": "es",
          "string": "Dame todos los actores que hayan actuado en Last Action Hero.",
          "keywords": "actores, Last Action Hero"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli attori che hanno recitato in Last Action Hero.",
          "keywords": "attori, Last Action Hero"
        },
        {
          "language": "fr",
          "string": "Noem alle acteurs uit de film Last Action Hero.",
          "keywords": "acteurs, Last Action Hero"
        },
        {
          "language": "nl",
          "string": "Noem alle acteurs uit de film Last Action Hero.",
          "keywords": "acteur, Last Action Hero"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți actorii cu roluri principale în Last Action Hero.",
          "keywords": "actor, rol principal, Last Action Hero"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uriWHERE { res:Last_Action_Hero dbo:starring ?uri . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Robert_Prosky"
        },
        {
          "string": "http://dbpedia.org/resource/Anthony_Quinn"
        },
        {
          "string": "http://dbpedia.org/resource/Arnold_Schwarzenegger"
        },
        {
          "string": "http://dbpedia.org/resource/Austin_O'Brien"
        },
        {
          "string": "http://dbpedia.org/resource/Art_Carney"
        },
        {
          "string": "http://dbpedia.org/resource/F._Murray_Abraham"
        },
        {
          "string": "http://dbpedia.org/resource/Charles_Dance"
        },
        {
          "string": "http://dbpedia.org/resource/Tom_Noonan"
        },
        {
          "string": "http://dbpedia.org/resource/Bridgette_Wilson"
        }
      ]
    },
    {
      "id": "67",
      "hybrid": "false",
      "answertype": "string",
      "aggregation": "true",
      "onlydbo": "false",
      "body": [
        {
          "language": "en",
          "string": "Give me the websites of companies with more than 500000 employees.",
          "keywords": "website, company, employee, more than 500000"
        },
        {
          "language": "de",
          "string": "Gib mir alle Webseiten von Unternehmen mit mehr als 500000 Angestellten.",
          "keywords": "Webseite, Unternehmen, Angestellte, mehr als 500000"
        },
        {
          "language": "es",
          "string": "Dame todas las páginas de Web de empresas con más de 500000 empleados.",
          "keywords": "página de Web, empreasas, empleados, más de 500000"
        },
        {
          "language": "it",
          "string": "Dammi tutti i siti internet di aziende con più di 500000 dipendenti.",
          "keywords": "sito internet, azienda, dipendenti, più di 500000"
        },
        {
          "language": "fr",
          "string": "Donnes-moi les sites webs de companies avec plus de 500000 employés.",
          "keywords": "sites webs, companies, plus de 500000 employés"
        },
        {
          "language": "nl",
          "string": "Geef me de websites van alle ondernemingen met meer dan 500000 werknemers.",
          "keywords": "website, onderneming, werknemers, meer dan 500000"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate website-urile de la companiile cu mai mult de 500000 de angajați",
          "keywords": "website, companie, angajat, mai mult de 500000"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX dbp: <http://dbpedia.org/property/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>PREFIX xsd: <http://w.w3.org/201/XMLSchema#>SELECT DISTINCT ?stringWHERE { ?c rdf:type dbo:Company . { ?c dbo:numberOfEmployees ?employes . } UNION { ?c dbp:numEmployes ?employes . } FILTER( xsd:integer(?employes) > 50 ) . ?c dbp:homepage ?string .}",
      "answers": [
        {
          "string": "http://volkswagenag.com"
        },
        {
          "string": "http://www.centro.co.id/"
        },
        {
          "string": "http://www.parkson.com.cn/"
        },
        {
          "string": "http://www.parkson.com.sg/"
        },
        {
          "string": "http://www.parkson.com.vn/"
        },
        {
          "string": "http://www.parkson.my/"
        },
        {
          "string": "http://www.wistron.com"
        },
        {
          "string": "http://www.g4s.com/"
        },
        {
          "string": "http://www.spb.gov.cn/"
        },
        {
          "string": "http://www.karsan.com/"
        },
        {
          "string": "http://www.crec.cn/"
        },
        {
          "string": "http://www.petrochina.com.cn/ptr/"
        },
        {
          "string": "http://www.sgcc.com.cn/ywlm/default.shtml"
        },
        {
          "string": "http://www.foxconn.com"
        },
        {
          "string": "http://www.issworld.com/"
        },
        {
          "string": "http://www.veritaslanguagesolutions.com"
        },
        {
          "string": "http://www.cnpc.com.cn/en/"
        },
        {
          "string": "http://www.koelnmesse.com"
        },
        {
          "string": "http://rostec.ru"
        },
        {
          "string": "http://www.walmart.com/"
        },
        {
          "string": "http://www.corporate.walmart.com"
        },
        {
          "string": "http://www.ixys.com/"
        },
        {
          "string": "http://www.zilog.com/"
        },
        {
          "string": "http://www.samsungcnt.com/"
        },
        {
          "string": "http://www.ringpower.com/"
        },
        {
          "string": "http://lamborghini.com/en/home/"
        },
        {
          "string": "http://www.slimmingworld.com"
        },
        {
          "string": "http://www.brother.com/"
        },
        {
          "string": "http://www.redcross.fi/en_GB/"
        },
        {
          "string": "http://www.jtekt.co.jp/e/index.html"
        },
        {
          "string": "http://www.servpro.com/"
        },
        {
          "string": "http://portlandgeneral.com/"
        },
        {
          "string": "http://www.verabradley.com/"
        },
        {
          "string": "http://www.nippon1.co.jp/index.html"
        },
        {
          "string": "http://www.nisamerica.com/"
        },
        {
          "string": "http://www.babcockborsigservice.com/index.php?id=27&amp;L=1"
        },
        {
          "string": "http://www.ohe-transport.de/"
        },
        {
          "string": "http://www.stx.co.kr"
        }
      ]
    }
  ]
}