<?xml version="1.0"?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="boolean" id="27" onlydbo="true">
<string lang="en"><![CDATA[Was U.S. president Jackson involved in a war?]]></string>
<string lang="de"><![CDATA[War US-Präsident Jackson in einen Krieg verwickelt?]]></string>
<string lang="es"><![CDATA[¿Estuvo el el presidente de los estados unidos Jackson involucrado en una guerra?]]></string>
<string lang="it"><![CDATA[Il presidente degli Stati Uniti Jackson è stato coinvolto in una guerra?]]></string>
<string lang="fr"><![CDATA[Le président Jackson a-t-il participé à une guerre?]]></string>
<string lang="nl"><![CDATA[Was president Jackson van de Verenigde Staten betrokken bij een oorlog?]]></string>
<string lang="ro"><![CDATA[A fost președintele american Jackson implicat într-un război?]]></string>
<keywords lang="en"><![CDATA[U.S. president, Jackson, war]]></keywords>
<keywords lang="de"><![CDATA[US-Präsident, Jackson, Krieg]]></keywords>
<keywords lang="es"><![CDATA[presidente de los estados unidos, Jackson, guerra]]></keywords>
<keywords lang="it"><![CDATA[presidente degli Stati Uniti, Jackson, guerra]]></keywords>
<keywords lang="fr"><![CDATA[président Jackson, guerre, participé]]></keywords>
<keywords lang="nl"><![CDATA[president van de Verenigde Staten, Jackson, oorlog, betrokken bij]]></keywords>
<keywords lang="ro"><![CDATA[președinte american, Jackson, război]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        res:Andrew_Jackson dbo:battle ?battle .    
}
]]></query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="28" onlydbo="false">
<string lang="en"><![CDATA[Give me all communist countries.]]></string>
<string lang="de"><![CDATA[Gib mir alle kommunistischen Länder.]]></string>
<string lang="es"><![CDATA[Dame todos los países comunistas.]]></string>
<string lang="it"><![CDATA[Dammi tutti i paesi comunisti.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les pays communistes.]]></string>
<string lang="nl"><![CDATA[Geef alle communistische landen.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate țările comuniste.]]></string>
<keywords lang="en"><![CDATA[communist countries]]></keywords>
<keywords lang="de"><![CDATA[kommunistische Länder]]></keywords>
<keywords lang="es"><![CDATA[países comunistas]]></keywords>
<keywords lang="it"><![CDATA[paesi comunisti]]></keywords>
<keywords lang="fr"><![CDATA[pays communistes]]></keywords>
<keywords lang="nl"><![CDATA[communistische landen]]></keywords>
<keywords lang="ro"><![CDATA[țări comuniste]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Country .
      { ?uri dbo:governmentType res:Communism . }
        UNION
      { ?uri dbo:governmentType res:Communist_state . }
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Mongolian_People's_Republic]]></answer><answer><![CDATA[http://dbpedia.org/resource/Division_of_Korea]]></answer><answer><![CDATA[http://dbpedia.org/resource/Provisional_People's_Committee_for_North_Korea]]></answer><answer><![CDATA[http://dbpedia.org/resource/Azerbaijan_People's_Government]]></answer><answer><![CDATA[http://dbpedia.org/resource/Republic_of_Mahabad]]></answer><answer><![CDATA[http://dbpedia.org/resource/Finnish_Democratic_Republic]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="29" onlydbo="true">
<string lang="en"><![CDATA[Which awards did Douglas Hofstadter win?]]></string>
<string lang="de"><![CDATA[Welche Preise hat Douglas Hofstadter gewonnen?]]></string>
<string lang="es"><![CDATA[¿Qué premios ha ganado Douglas Hofstadter?]]></string>
<string lang="it"><![CDATA[Quali premi ha vinto Douglas Hofstadter?]]></string>
<string lang="fr"><![CDATA[Quels prix ont été gagnés par Douglas Hofstadter?]]></string>
<string lang="nl"><![CDATA[Welke prijzen heeft Douglas Hofstadter gewonnen?]]></string>
<string lang="ro"><![CDATA[Ce premii a câștigat Douglas Hofstadter?]]></string>
<keywords lang="en"><![CDATA[Douglas Hofstadter, award]]></keywords>
<keywords lang="de"><![CDATA[Douglas Hofstadter, Preise]]></keywords>
<keywords lang="es"><![CDATA[Douglas Hofstadter, premios]]></keywords>
<keywords lang="it"><![CDATA[Douglas Hofstadter, premio]]></keywords>
<keywords lang="fr"><![CDATA[Douglas Hofstadter, prix]]></keywords>
<keywords lang="nl"><![CDATA[Douglas Hofstadter, prijs]]></keywords>
<keywords lang="ro"><![CDATA[Douglas Hofstadter, premii]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri
WHERE {
        res:Douglas_Hofstadter dbo:award ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/National_Book_Award]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pulitzer_Prize]]></answer><answer><![CDATA[http://dbpedia.org/resource/American_Academy_of_Arts_and_Sciences]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="3" onlydbo="true">
<string lang="en"><![CDATA[Who is the daughter of Robert Kennedy married to?]]></string>
<string lang="de"><![CDATA[Mit wem ist die Tochter von Robert Kennedy verheiratet?]]></string>
<string lang="es"><![CDATA[¿Con quién está casada la hija de Robert Kennedy?]]></string>
<string lang="it"><![CDATA[Con chi è sposata la figlia di Robert Kennedy?]]></string>
<string lang="fr"><![CDATA[Qui est l'époux de la fille de Robert Kennedy?]]></string>
<string lang="nl"><![CDATA[Met wie is de dochter van Robert Kennedy getrouwd?]]></string>
<string lang="ro"><![CDATA[Cu cine este căsătorită fiica lui Robert Kennedy?]]></string>
<keywords lang="en"><![CDATA[Robert Kennedy, daughter, married]]></keywords>
<keywords lang="de"><![CDATA[Robert Kennedy, Tochter, verheiratet]]></keywords>
<keywords lang="es"><![CDATA[Robert Kennedy, hija, casada]]></keywords>
<keywords lang="it"><![CDATA[Robert Kennedy, figlia, sposata]]></keywords>
<keywords lang="fr"><![CDATA[épou, fille, Ingrid Bergman]]></keywords>
<keywords lang="nl"><![CDATA[Robert Kennedy, dochter, getrouwd]]></keywords>
<keywords lang="ro"><![CDATA[Robert Kennedy, fiică, căsătorită]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:Robert_F._Kennedy dbo:child ?child .
        ?child dbo:spouse ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Andrew_Cuomo]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="30" onlydbo="false">
<string lang="en"><![CDATA[Which U.S. state has the highest population density?]]></string>
<string lang="de"><![CDATA[Welcher Staat in den USA hat die höchste Bevölkerungsdichte?]]></string>
<string lang="es"><![CDATA[¿Que estado de los estados unidos de america tiene la mayor densidad de población?]]></string>
<string lang="it"><![CDATA[Quale stato americano ha la densità di popolazione maggiore?]]></string>
<string lang="fr"><![CDATA[Quel état des Etats-Unis a la plus haute densité de population?]]></string>
<string lang="nl"><![CDATA[Welke deelstaat van de Verenigde Staten heeft de hoogste bevolkingsdichtheid?]]></string>
<string lang="ro"><![CDATA[Ce stat American are cea mai mare densitate a populației?]]></string>
<keywords lang="en"><![CDATA[state, USA, population density, highest]]></keywords>
<keywords lang="de"><![CDATA[Staat, USA, Bevölkerungsdichte, höchste]]></keywords>
<keywords lang="es"><![CDATA[estado, estados unidos de america, densidad de población]]></keywords>
<keywords lang="it"><![CDATA[stato, Stati Uniti d'America, maggiore densità di popolazione]]></keywords>
<keywords lang="fr"><![CDATA[densité de population, état des Etats-Unis]]></keywords>
<keywords lang="nl"><![CDATA[deelstaat van de Verenigde Staten, hoogste bevolkingsdichtheid]]></keywords>
<keywords lang="ro"><![CDATA[stat, Statele Unite ale Americii, densitatea populației, cea mai mare]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type yago:StatesOfTheUnitedStates .
        ?uri dbp:densityrank ?rank .
} 
ORDER BY ASC(?rank) 
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Wisconsin]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="31" onlydbo="true">
<string lang="en"><![CDATA[What is the currency of the Czech Republic?]]></string>
<string lang="de"><![CDATA[Was ist die Währung der Tschechischen Republik?]]></string>
<string lang="es"><![CDATA[¿Cuál es la moneda de la república checa?]]></string>
<string lang="it"><![CDATA[Qual è la valuta della Repubblica Ceca?]]></string>
<string lang="fr"><![CDATA[Quel est la devise de la Tchéquie?]]></string>
<string lang="nl"><![CDATA[Wat is de munteenheid van Tsjechië?]]></string>
<string lang="ro"><![CDATA[Care este moneda națională a Cehiei?]]></string>
<keywords lang="en"><![CDATA[Czech republic, currency]]></keywords>
<keywords lang="de"><![CDATA[Tschechischen Republik, Währung]]></keywords>
<keywords lang="es"><![CDATA[moneda, república checa]]></keywords>
<keywords lang="it"><![CDATA[valuta, Repubblica Ceca]]></keywords>
<keywords lang="fr"><![CDATA[devise, Tchéquie]]></keywords>
<keywords lang="nl"><![CDATA[Tsjechië, munteenheid]]></keywords>
<keywords lang="ro"><![CDATA[Cehia, monedă națională]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
       res:Czech_Republic dbo:currency ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Czech_koruna]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="32" onlydbo="false">
<string lang="en"><![CDATA[Which countries adopted the Euro?]]></string>
<string lang="de"><![CDATA[Welche Länder haben den Euro übernommen?]]></string>
<string lang="es"><![CDATA[¿Qué países han introducido el Euro?]]></string>
<string lang="it"><![CDATA[Quali stati hanno introdotto l'Euro?]]></string>
<string lang="fr"><![CDATA[Quels pays ont adopté l'Euro?]]></string>
<string lang="nl"><![CDATA[Welke landen hebben de Euro geïntroduceerd?]]></string>
<string lang="ro"><![CDATA[În ce țări a fost introdus euro?]]></string>
<keywords lang="en"><![CDATA[country, adopt, Euro]]></keywords>
<keywords lang="de"><![CDATA[Land, übernehmen, Euro]]></keywords>
<keywords lang="es"><![CDATA[países, introducido, Euro]]></keywords>
<keywords lang="it"><![CDATA[stato, introdurre, Euro]]></keywords>
<keywords lang="fr"><![CDATA[pays, adopté, Euro]]></keywords>
<keywords lang="nl"><![CDATA[land, Euro, geïntroduceerd]]></keywords>
<keywords lang="ro"><![CDATA[țară, introdus, euro]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
          ?uri rdf:type dbo:Country .
        { ?uri dbo:currency res:Euro . } 
        UNION 
        { ?uri dbp:currencyCode 'EUR'@en . }
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/United_Nations_Interim_Administration_Mission_in_Kosovo]]></answer><answer><![CDATA[http://dbpedia.org/resource/Belgium]]></answer><answer><![CDATA[http://dbpedia.org/resource/Cyprus]]></answer><answer><![CDATA[http://dbpedia.org/resource/European_Union]]></answer><answer><![CDATA[http://dbpedia.org/resource/Finland]]></answer><answer><![CDATA[http://dbpedia.org/resource/French_Southern_and_Antarctic_Lands]]></answer><answer><![CDATA[http://dbpedia.org/resource/Germany]]></answer><answer><![CDATA[http://dbpedia.org/resource/Greece]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kerguelen_Islands]]></answer><answer><![CDATA[http://dbpedia.org/resource/Latvia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Luxembourg]]></answer><answer><![CDATA[http://dbpedia.org/resource/Macedonia_(region)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mayotte]]></answer><answer><![CDATA[http://dbpedia.org/resource/Montenegro]]></answer><answer><![CDATA[http://dbpedia.org/resource/Netherlands]]></answer><answer><![CDATA[http://dbpedia.org/resource/Portugal]]></answer><answer><![CDATA[http://dbpedia.org/resource/Republic_of_Ireland]]></answer><answer><![CDATA[http://dbpedia.org/resource/Saint_Pierre_and_Miquelon]]></answer><answer><![CDATA[http://dbpedia.org/resource/San_Marino]]></answer><answer><![CDATA[http://dbpedia.org/resource/Serbia_and_Montenegro]]></answer><answer><![CDATA[http://dbpedia.org/resource/Slovenia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Spain]]></answer><answer><![CDATA[http://dbpedia.org/resource/Akrotiri_and_Dhekelia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Austria]]></answer><answer><![CDATA[http://dbpedia.org/resource/Estonia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Twente]]></answer><answer><![CDATA[http://dbpedia.org/resource/French_Fifth_Republic]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ad%C3%A9lie_Land]]></answer><answer><![CDATA[http://dbpedia.org/resource/Saint_Barth%C3%A9lemy]]></answer><answer><![CDATA[http://dbpedia.org/resource/Collectivity_of_Saint_Martin]]></answer><answer><![CDATA[http://dbpedia.org/resource/%C3%8Eles_des_Saintes]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kingdom_of_Wallachia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Republic_of_Saugeais]]></answer><answer><![CDATA[http://dbpedia.org/resource/Community_of_Serbian_municipalities,_Kosovo]]></answer><answer><![CDATA[http://dbpedia.org/resource/Vatican_City]]></answer><answer><![CDATA[http://dbpedia.org/resource/Andorra]]></answer><answer><![CDATA[http://dbpedia.org/resource/Italy]]></answer><answer><![CDATA[http://dbpedia.org/resource/Malta]]></answer><answer><![CDATA[http://dbpedia.org/resource/Monaco]]></answer><answer><![CDATA[http://dbpedia.org/resource/%C3%85land_Islands]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="33" onlydbo="true">
<string lang="en"><![CDATA[What is the area code of Berlin?]]></string>
<string lang="de"><![CDATA[Was ist die Vorwahl von Berlin?]]></string>
<string lang="es"><![CDATA[¿Cuál es el prefijo de Berlin?]]></string>
<string lang="it"><![CDATA[Qual è il prefisso di Berlino?]]></string>
<string lang="fr"><![CDATA[Quel est l'indicatif téléphonique de Berlin?]]></string>
<string lang="nl"><![CDATA[Wat is het kengetal van Berlijn?]]></string>
<string lang="ro"><![CDATA[Care este prefixul telephonic pentru Berlin?]]></string>
<keywords lang="en"><![CDATA[Berlin, area code]]></keywords>
<keywords lang="de"><![CDATA[Berlin, Vorwahl]]></keywords>
<keywords lang="es"><![CDATA[prefijo, Berlin]]></keywords>
<keywords lang="it"><![CDATA[prefisso, Berlino]]></keywords>
<keywords lang="fr"><![CDATA[indicatif téléphonique, Berlin]]></keywords>
<keywords lang="nl"><![CDATA[kengetal, Berlijn]]></keywords>
<keywords lang="ro"><![CDATA[Berlin, prefix telefonic]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?string 
WHERE {
        res:Berlin dbo:areaCode ?string .
}
]]></query>
<answers><answer><![CDATA[030]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="34" onlydbo="true">
<string lang="en"><![CDATA[Which countries have more than two official languages?]]></string>
<string lang="de"><![CDATA[Welche Länder haben mehr als zwei Amtssprachen?]]></string>
<string lang="es"><![CDATA[¿Qué países tienes más de dos lenguas oficiales?]]></string>
<string lang="it"><![CDATA[Quali stati hanno più di due lingue ufficiali?]]></string>
<string lang="fr"><![CDATA[Quels pays ont plus de deux langues officielles?]]></string>
<string lang="nl"><![CDATA[Welke landen hebben meer dan twee officiële talen?]]></string>
<string lang="ro"><![CDATA[Ce țări au mai mult de două limbi oficiale?]]></string>
<keywords lang="en"><![CDATA[country, official language, more than two]]></keywords>
<keywords lang="de"><![CDATA[Land, Amtssprache, mehr als zwei]]></keywords>
<keywords lang="es"><![CDATA[país, lengua oficial, más de dos]]></keywords>
<keywords lang="it"><![CDATA[stato, lingua ufficiale, più di due]]></keywords>
<keywords lang="fr"><![CDATA[pays, langues officielles, plus de deux]]></keywords>
<keywords lang="nl"><![CDATA[land, officiële taal, meer dan twee]]></keywords>
<keywords lang="ro"><![CDATA[țară, limbă oficială, mai mult de două]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Country  .
        ?uri dbo:officialLanguage ?language .
} 
GROUP BY ?uri
HAVING (COUNT(?language) > 2)
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Republic_of_Molossia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Equatorial_Guinea]]></answer><answer><![CDATA[http://dbpedia.org/resource/Principality_of_Hutt_River]]></answer><answer><![CDATA[http://dbpedia.org/resource/Vojvodina]]></answer><answer><![CDATA[http://dbpedia.org/resource/Eritrea]]></answer><answer><![CDATA[http://dbpedia.org/resource/Organization_for_Security_and_Co-operation_in_Europe]]></answer><answer><![CDATA[http://dbpedia.org/resource/Frisia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dominion_of_Melchizedek]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nineveh_plains]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="35" onlydbo="true">
<string lang="en"><![CDATA[Who is the owner of Rolls-Royce?]]></string>
<string lang="de"><![CDATA[Wem gehört Rolls-Royce?]]></string>
<string lang="es"><![CDATA[¿Quién es el dueño de Rolls-Royce?]]></string>
<string lang="it"><![CDATA[Chi è il proprietario di Rolls-Royce?]]></string>
<string lang="fr"><![CDATA[À qui appartient Rolls-Royce?]]></string>
<string lang="nl"><![CDATA[Wie is de eigenaar van Rolls-Royce?]]></string>
<string lang="ro"><![CDATA[Cine este proprietarul Rolls-Royce?]]></string>
<keywords lang="en"><![CDATA[Rolls-Royce, owner]]></keywords>
<keywords lang="de"><![CDATA[Rolls-Royce, gehören]]></keywords>
<keywords lang="es"><![CDATA[Rolls-Royce, dueño]]></keywords>
<keywords lang="it"><![CDATA[Rolls-Royce, proprietario]]></keywords>
<keywords lang="fr"><![CDATA[Rolls-Royce, appartient]]></keywords>
<keywords lang="nl"><![CDATA[Rolls-Royce, eigenaar]]></keywords>
<keywords lang="ro"><![CDATA[Rolls-Royce, proprietar]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Rolls-Royce_Motors dbo:owner ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Volkswagen_Group]]></answer><answer><![CDATA[http://dbpedia.org/resource/BMW]]></answer><answer><![CDATA[http://dbpedia.org/resource/Vickers_plc]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="36" onlydbo="true">
<string lang="en"><![CDATA[Through which countries does the Yenisei river flow?]]></string>
<string lang="de"><![CDATA[Durch welche Länder fließt der Yenisei?]]></string>
<string lang="es"><![CDATA[¿Por qué países fluye el río Yenisei?]]></string>
<string lang="it"><![CDATA[Attraverso quali stati scorre il fiume Yenisei?]]></string>
<string lang="fr"><![CDATA[Quels sont les pays traversés par l'Ienisseï?]]></string>
<string lang="nl"><![CDATA[Door welke landen stroomt de Jenisej?]]></string>
<string lang="ro"><![CDATA[Ce țări traversează fluviul Enisei?]]></string>
<keywords lang="en"><![CDATA[Yenisei river, flow through, country]]></keywords>
<keywords lang="de"><![CDATA[Yenisei, fließen, Land]]></keywords>
<keywords lang="es"><![CDATA[países, fluye, río Yenisei]]></keywords>
<keywords lang="it"><![CDATA[fiume Yenisei, scorrere attraverso, stato]]></keywords>
<keywords lang="fr"><![CDATA[Ienisseï, pays traversés]]></keywords>
<keywords lang="nl"><![CDATA[Jenisej, land, stroomt door]]></keywords>
<keywords lang="ro"><![CDATA[fluviul Enisei, traversează, țară]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
        res:Yenisei dbo:country ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Mongolia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Russia]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="date" id="37" onlydbo="false">
<string lang="en"><![CDATA[When did Latvia join the EU?]]></string>
<string lang="de"><![CDATA[Wann ist Lettland der EU beigetreten?]]></string>
<string lang="es"><![CDATA[¿Cuándo ingresó Letonia a la unión europea?]]></string>
<string lang="it"><![CDATA[Quando la Lettonia è entrata nell'Unione Europea?]]></string>
<string lang="fr"><![CDATA[Quand est la Lettonie devenue membre de l'Union européene?]]></string>
<string lang="nl"><![CDATA[Wanneer trad Letland toe tot de EU?]]></string>
<string lang="ro"><![CDATA[Când a aderat Letonia la Uniunea Europeană?]]></string>
<keywords lang="en"><![CDATA[Latvia, join, EU]]></keywords>
<keywords lang="de"><![CDATA[Lettland, beitreten, EU]]></keywords>
<keywords lang="es"><![CDATA[Letonia, ingreso, unión europea]]></keywords>
<keywords lang="it"><![CDATA[Lettonia, entrare, Unione Europea]]></keywords>
<keywords lang="fr"><![CDATA[Lettonie, membre, Union européene]]></keywords>
<keywords lang="nl"><![CDATA[Letland, toetreden, EU]]></keywords>
<keywords lang="ro"><![CDATA[Letonia, adera, Uniunea Europeană]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?date 
WHERE {       
        res:Latvia dbp:accessioneudate ?date .      
}
]]></query>
<answers><answer><![CDATA[2004-05-01+02:00]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="38" onlydbo="true">
<string lang="en"><![CDATA[Which monarchs were married to a German?]]></string>
<string lang="de"><![CDATA[Welche Monarchen waren mit jemand deutschem verheiratet?]]></string>
<string lang="es"><![CDATA[¿Qué monárcas estaban casados con una persona alemana?]]></string>
<string lang="it"><![CDATA[Quali monarchi erano sposati con persone tedesche?]]></string>
<string lang="fr"><![CDATA[Quels monarques ont épousé une personne allemande?]]></string>
<string lang="nl"><![CDATA[Welke monarchen waren getrouwd met een Duitser?]]></string>
<string lang="ro"><![CDATA[Ce monarhi au fost căsătoriți cu o persoană germană?]]></string>
<keywords lang="en"><![CDATA[monarch, married, German]]></keywords>
<keywords lang="de"><![CDATA[Monarch, verheiratet, deutsch]]></keywords>
<keywords lang="es"><![CDATA[monarcha, casado, alemán]]></keywords>
<keywords lang="it"><![CDATA[monarca, sposato, tedesco]]></keywords>
<keywords lang="fr"><![CDATA[monarques, épousé, allemand]]></keywords>
<keywords lang="nl"><![CDATA[monarch, getrouwd, Duitser]]></keywords>
<keywords lang="ro"><![CDATA[monarh, căsătorit, german]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Monarch . 
        ?uri dbo:spouse ?spouse .
      { ?spouse dbo:birthPlace res:Germany. }
      UNION 
      { ?spouse dbo:birthPlace ?p . 
        ?p dbo:country res:Germany. }
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Boles%C5%82aw_III_Wrymouth]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="date" id="39" onlydbo="true">
<string lang="en"><![CDATA[When was the Battle of Gettysburg?]]></string>
<string lang="de"><![CDATA[Wann fand die Schlacht von Gettysburg statt?]]></string>
<string lang="es"><![CDATA[¿Cuándo tuvo lugar la batalla de Gettysburg?]]></string>
<string lang="it"><![CDATA[Quando ha avuto luogo la battaglia di Gettysburg?]]></string>
<string lang="fr"><![CDATA[Quand se déroula la bataille de Gettysburg?]]></string>
<string lang="nl"><![CDATA[Wanneer was de Slag bij Gettysburg?]]></string>
<string lang="ro"><![CDATA[Când a fost bătălia de la Gettysburg?]]></string>
<keywords lang="en"><![CDATA[Battle of Gettysburg]]></keywords>
<keywords lang="de"><![CDATA[Schlacht von Gettysburg]]></keywords>
<keywords lang="es"><![CDATA[batalla de Gettysburg]]></keywords>
<keywords lang="it"><![CDATA[battaglia di Gettysburg]]></keywords>
<keywords lang="fr"><![CDATA[bataille de Gettysburg, quand]]></keywords>
<keywords lang="nl"><![CDATA[Slag bij Gettysburg]]></keywords>
<keywords lang="ro"><![CDATA[bătălia de la Gettysburg]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE { 
        res:Battle_of_Gettysburg dbo:date ?date .
}
]]></query>
<answers><answer><![CDATA[1863-07-03+02:00]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="4" onlydbo="true">
<string lang="en"><![CDATA[Which river does the Brooklyn Bridge cross?]]></string>
<string lang="de"><![CDATA[Welchen Fluss überspannt die Brooklyn Bridge?]]></string>
<string lang="es"><![CDATA[¿Por qué río cruza la Brooklyn Bridge?]]></string>
<string lang="it"><![CDATA[Quale fiume attraversa il ponte di Brooklyn?]]></string>
<string lang="fr"><![CDATA[Quelle cours d'eau est traversé par le pont de Brooklyn?]]></string>
<string lang="nl"><![CDATA[Welke rivier overspant de Brooklyn Bridge?]]></string>
<string lang="ro"><![CDATA[Ce râu traversează podul din Brooklyn?]]></string>
<keywords lang="en"><![CDATA[river, cross, Brooklyn Bridge]]></keywords>
<keywords lang="de"><![CDATA[Fluss, überspannen, Brooklyn Bridge]]></keywords>
<keywords lang="es"><![CDATA[río, cruza, Brooklyn Bridge]]></keywords>
<keywords lang="it"><![CDATA[fiume, attraversare, ponte di Brooklyn]]></keywords>
<keywords lang="fr"><![CDATA[cours d'eau, pont de Brooklyn]]></keywords>
<keywords lang="nl"><![CDATA[rivier, Brooklyn Bridge, overspant]]></keywords>
<keywords lang="ro"><![CDATA[râu, traversează, podul din Brooklyn]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {       
        res:Brooklyn_Bridge dbo:crosses ?uri . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/East_River]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="40" onlydbo="true">
<string lang="en"><![CDATA[What is the highest mountain in Australia?]]></string>
<string lang="de"><![CDATA[Was ist der höchste Berg in Australien?]]></string>
<string lang="es"><![CDATA[¿Cuál es la montaña más alta de Australia?]]></string>
<string lang="it"><![CDATA[Qual è la montagna più alta d'Australia?]]></string>
<string lang="fr"><![CDATA[Quelle est la plus haute montagne d'Australie?]]></string>
<string lang="nl"><![CDATA[Wat is de hoogste berg van Australië?]]></string>
<string lang="ro"><![CDATA[Care este cel mai înalt munte din Australia?]]></string>
<keywords lang="en"><![CDATA[Australia, highest mountain]]></keywords>
<keywords lang="de"><![CDATA[Australien, höchster Berg]]></keywords>
<keywords lang="es"><![CDATA[Australia, montaña más alta]]></keywords>
<keywords lang="it"><![CDATA[Australia, montagna più alta]]></keywords>
<keywords lang="fr"><![CDATA[plus haute montagne, Australie]]></keywords>
<keywords lang="nl"><![CDATA[Australië, hoogste berg]]></keywords>
<keywords lang="ro"><![CDATA[Australia, cel mai înalt munte]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Mountain .
        ?uri dbo:locatedInArea res:Australia .
        ?uri dbo:elevation ?elevation .
} 
ORDER BY DESC(?elevation) 
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Mawson_Peak]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="42" onlydbo="true">
<string lang="en"><![CDATA[What is the official language of Suriname?]]></string>
<string lang="de"><![CDATA[Was ist die Amtssprache Von Surinam?]]></string>
<string lang="es"><![CDATA[¿Cuál es la idioma oficial de Surinam?]]></string>
<string lang="it"><![CDATA[Qual è la lingua ufficiale del Suriname?]]></string>
<string lang="fr"><![CDATA[Quelle est la langue officielle du Suriname?]]></string>
<string lang="nl"><![CDATA[Wat is de officiële taal van Suriname?]]></string>
<string lang="ro"><![CDATA[Care este limba oficială din Suriname?]]></string>
<keywords lang="en"><![CDATA[Suriname, official language]]></keywords>
<keywords lang="de"><![CDATA[Surinam, Amtssprache]]></keywords>
<keywords lang="es"><![CDATA[Surinam, idioma oficial]]></keywords>
<keywords lang="it"><![CDATA[Suriname, lingua ufficiale]]></keywords>
<keywords lang="fr"><![CDATA[Suriname, langue officielle]]></keywords>
<keywords lang="nl"><![CDATA[Suriname, officiële taal]]></keywords>
<keywords lang="ro"><![CDATA[Suriname, limba oficială]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Suriname dbo:officialLanguage ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Dutch_language]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="43" onlydbo="true">
<string lang="en"><![CDATA[Who is the mayor of Tel Aviv?]]></string>
<string lang="de"><![CDATA[Wer ist der Bürgermeister von Tel Aviv?]]></string>
<string lang="es"><![CDATA[¿Quién es el alcalde de Tel Aviv?]]></string>
<string lang="it"><![CDATA[Chi è il sindaco di Tel Aviv?]]></string>
<string lang="fr"><![CDATA[Qui est le maire de Tel Aviv?]]></string>
<string lang="nl"><![CDATA[Wie is de burgemeester van Tel Aviv?]]></string>
<string lang="ro"><![CDATA[Cien este primarul din Tel Aviv?]]></string>
<keywords lang="en"><![CDATA[Tel Aviv, mayor]]></keywords>
<keywords lang="de"><![CDATA[Tel Aviv, Bürgermeister]]></keywords>
<keywords lang="es"><![CDATA[Tel Aviv, alcalde]]></keywords>
<keywords lang="it"><![CDATA[Tel Aviv, sindaco]]></keywords>
<keywords lang="fr"><![CDATA[Tel Aviv, maire]]></keywords>
<keywords lang="nl"><![CDATA[Tel Aviv, burgemeester]]></keywords>
<keywords lang="ro"><![CDATA[Tel Aviv, primar]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Tel_Aviv dbo:leaderName ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Ron_Huldai]]></answer></answers></question>

