<?xml version="1.0"?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="boolean" id="93" onlydbo="true">
<string lang="en"><![CDATA[Was Natalie Portman born in the United States?]]></string>
<string lang="de"><![CDATA[Wurde Natalie Portman in den Vereinigten Staaten geboren?]]></string>
<string lang="es"><![CDATA[¿Nació Natalie Portman en los estados unidos de américa?]]></string>
<string lang="it"><![CDATA[Natalie Portman è nata negli Stati Uniti?]]></string>
<string lang="fr"><![CDATA[Natalie Portman est-elle née aux Etats-Unis?]]></string>
<string lang="nl"><![CDATA[Werd Natalie Portman geboren in de Verenigde Staten?]]></string>
<string lang="ro"><![CDATA[A fost Natalie Portman născută în Statele Unite?]]></string>
<keywords lang="en"><![CDATA[Natalie Portman, born, United States]]></keywords>
<keywords lang="de"><![CDATA[Natalie Portman, geboren, Vereinigte Staaten]]></keywords>
<keywords lang="es"><![CDATA[Natalie Portman]]></keywords>
<keywords lang="it"><![CDATA[Natalie Portman, nata, Stati Uniti]]></keywords>
<keywords lang="fr"><![CDATA[Natalie Portman, née, Etats-Unis]]></keywords>
<keywords lang="nl"><![CDATA[Natalie Portman, geboren, Verenigde Staten]]></keywords>
<keywords lang="ro"><![CDATA[Natalie Portman, născută, Statele Unite]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE { 
        { res:Natalie_Portman dbo:birthPlace res:United_States . }
        UNION
        { res:Natalie_Portman dbo:birthPlace ?city .
          ?city dbo:country res:United_States . }
}
]]></query>
<answers><answer><![CDATA[false]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="231" onlydbo="true">
<string lang="en"><![CDATA[How many inhabitants does the largest city in Canada have?]]></string>
<string lang="de"><![CDATA[Wieviele Einwohner hat die größte Stadt in Kanada?]]></string>
<string lang="es"><![CDATA[¿Cuántos habitantes tiene la ciudad más grande de Canadá?]]></string>
<string lang="it"><![CDATA[Quanti abitanti ha la città più grande del Canada?]]></string>
<string lang="fr"><![CDATA[Combien d'habitants a large ville la plus grande du Canada?]]></string>
<string lang="nl"><![CDATA[Hoeveel inwoners heeft de grootste stadt in Canada?]]></string>
<string lang="ro"><![CDATA[Câți locuitori are cel mai are oraș din Canada?]]></string>
<keywords lang="en"><![CDATA[inhabitants, largest city, Canada]]></keywords>
<keywords lang="de"><![CDATA[Einwohner, größte Stadt, Kanada]]></keywords>
<keywords lang="es"><![CDATA[número de habitantes, ciudad más grande de Canadá]]></keywords>
<keywords lang="it"><![CDATA[abitanti, città più grande, Canada]]></keywords>
<keywords lang="fr"><![CDATA[nombre dhabitants, ville la plus large, Canada]]></keywords>
<keywords lang="nl"><![CDATA[inwoners, grootste, stad, Canada]]></keywords>
<keywords lang="ro"><![CDATA[locuitori, cel mai mare oraș, Canada]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num
WHERE {
        res:Canada dbo:largestCity ?city . 
        ?city dbo:populationTotal ?num .
}
]]></query>
<answers><answer><![CDATA[2615060]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="234" onlydbo="true">
<string lang="en"><![CDATA[Who was the first to climb Mount Everest?]]></string>
<string lang="de"><![CDATA[Wer hat als erstes den Mount Everest bestiegen?]]></string>
<string lang="es"><![CDATA[¿Quién fue el primero en ascender al Monte Everest?]]></string>
<string lang="it"><![CDATA[Chi è stato il primo a scalare il Monte Everest?]]></string>
<string lang="fr"><![CDATA[Qui est la première personne à conquerir le Mont Everest?]]></string>
<string lang="nl"><![CDATA[Wie was de eerste die de Mount Everest beklom?]]></string>
<string lang="ro"><![CDATA[Cine a fost primul om care a escaladat muntele Everest?]]></string>
<keywords lang="en"><![CDATA[first, climb, mount Everest]]></keywords>
<keywords lang="de"><![CDATA[Mount Everest, besteigen, erster]]></keywords>
<keywords lang="es"><![CDATA[primero, ascender, Monte Everest]]></keywords>
<keywords lang="it"><![CDATA[primo, scalare, Monte Everest]]></keywords>
<keywords lang="fr"><![CDATA[première personne, Mont Everest]]></keywords>
<keywords lang="nl"><![CDATA[Mount Everest, eerste, beklimmen]]></keywords>
<keywords lang="ro"><![CDATA[primul, escaladat, muntele Everest]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri
WHERE {
          res:Mount_Everest dbo:firstAscentPerson ?uri . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Krzysztof_Wielicki]]></answer><answer><![CDATA[http://dbpedia.org/resource/Edmund_Hillary]]></answer><answer><![CDATA[http://dbpedia.org/resource/Leszek_Cichy]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tenzing_Norgay]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="number" id="204" onlydbo="true">
<string lang="en"><![CDATA[How many programming languages are there?]]></string>
<string lang="de"><![CDATA[Wieviele Programmiersprachen gibt es?]]></string>
<string lang="es"><![CDATA[¿Cuántos lenguajes de programación existen?]]></string>
<string lang="it"><![CDATA[Quanti linguaggi di programmazione esistono?]]></string>
<string lang="fr"><![CDATA[Combien de langages de programmation existe-t-il?]]></string>
<string lang="nl"><![CDATA[Hoeveel programmeertalen zijn er?]]></string>
<string lang="ro"><![CDATA[Câte limbaje de programare există?]]></string>
<keywords lang="en"><![CDATA[how many, programming languages]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Programmiersprachen]]></keywords>
<keywords lang="es"><![CDATA[cuántos lenguajes programación]]></keywords>
<keywords lang="it"><![CDATA[linguaggi di programmazione, esistere]]></keywords>
<keywords lang="fr"><![CDATA[combien, langages de programmation]]></keywords>
<keywords lang="nl"><![CDATA[hoeveel, programmeertalen]]></keywords>
<keywords lang="ro"><![CDATA[limbaje de programare, există]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?uri)
WHERE {
        ?uri rdf:type dbo:ProgrammingLanguage .
}
]]></query>
<answers><answer><![CDATA[1202]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="string" id="242" onlydbo="true">
<string lang="en"><![CDATA[What is the official color of the University of Oxford?]]></string>
<string lang="de"><![CDATA[Was ist die offizielle Farbe der Universität Oxford?]]></string>
<string lang="es"><![CDATA[¿Cuál es el color oficial de la Universidad de Oxford?]]></string>
<string lang="it"><![CDATA[Qual è il colore ufficiale dell'Università di Oxford?]]></string>
<string lang="fr"><![CDATA[Quelles sont les couleurs officielles de l'université d'Oxford?]]></string>
<string lang="nl"><![CDATA[Wat is de officiële kleur van de universiteit Oxford?]]></string>
<string lang="ro"><![CDATA[Care este culoarea oficială a Universității Oxford?]]></string>
<keywords lang="en"><![CDATA[University of Oxford, official color]]></keywords>
<keywords lang="de"><![CDATA[Universität Oxford, offizielle Farbe]]></keywords>
<keywords lang="es"><![CDATA[Universidad de Oxford, color oficial]]></keywords>
<keywords lang="it"><![CDATA[colore ufficiale, Università di Oxford]]></keywords>
<keywords lang="fr"><![CDATA[couleurs officielles, université d'Oxford]]></keywords>
<keywords lang="nl"><![CDATA[universiteit Oxford, officiële kleur]]></keywords>
<keywords lang="ro"><![CDATA[Universitatea Oxford, culoare oficială]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?string
WHERE {
        res:University_of_Oxford dbo:officialSchoolColour ?string . 
}
]]></query>
<answers><answer><![CDATA[Oxford Blue]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="235" onlydbo="true">
<string lang="en"><![CDATA[To which artistic movement did the painter of The Three Dancers belong?]]></string>
<string lang="de"><![CDATA[Welcher Stilrichtung gehörte der Maler der Drei Tänzer an?]]></string>
<string lang="es"><![CDATA[¿A qué estilo artístico pertenece el pinto de Los Tres Bailarines?]]></string>
<string lang="it"><![CDATA[A quale movimento artistico apparteneva il pittore de I tre ballerini?]]></string>
<string lang="fr"><![CDATA[A quel mouvement artistisque appartient le peintre de Les Trois Danceurs?]]></string>
<string lang="nl"><![CDATA[Tot welke artistieke stijl behoort de schilder van de Drie Dansers?]]></string>
<string lang="ro"><![CDATA[Cărui curent artistic îi aparține pictorul lucrării Trei dansatoare?]]></string>
<keywords lang="en"><![CDATA[artistic movement, painter, The Three Dancers]]></keywords>
<keywords lang="de"><![CDATA[Drei Tänzer, Maler, Stilrichtung]]></keywords>
<keywords lang="es"><![CDATA[estilo artístico, pintor, Los Tres Bailarines]]></keywords>
<keywords lang="it"><![CDATA[movimento artistico, pittore, I tre ballerini]]></keywords>
<keywords lang="fr"><![CDATA[mouvement artistique, peintre, les trois danceurs]]></keywords>
<keywords lang="nl"><![CDATA[Drie Dansers, schilder, stijl]]></keywords>
<keywords lang="ro"><![CDATA[curent artistic, pictor, Trei dansatoare]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri
WHERE {
         res:The_Three_Dancers dbo:author ?person .
         ?person dbo:movement ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Cubism]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="boolean" id="223" onlydbo="true">
<string lang="en"><![CDATA[Does Abraham Lincoln's death place have a website?]]></string>
<string lang="de"><![CDATA[Hat Abraham Lincolns Sterbeort eine Webseite?]]></string>
<string lang="es"><![CDATA[¿Tiene el lugar de nacimiento de Abraham Lincol una página web?]]></string>
<string lang="it"><![CDATA[Il luogo di morte di Abraham Lincoln ha un sito web?]]></string>
<string lang="fr"><![CDATA[A le lieu de décès d'Abraham Lincoln une page Web?]]></string>
<string lang="nl"><![CDATA[Heeft de stad waarin Abraham Lincoln is overleden een website?]]></string>
<string lang="ro"><![CDATA[Locul morții lui Abraham Lincoln are un website?]]></string>
<keywords lang="en"><![CDATA[Abraham Lincoln, death place, website]]></keywords>
<keywords lang="de"><![CDATA[Abraham Lincoln, Sterbeort, Webseite]]></keywords>
<keywords lang="es"><![CDATA[Abraham Lincoln, lugar de nacimiento, página web]]></keywords>
<keywords lang="it"><![CDATA[Abraham Lincoln, luogo di morte, website]]></keywords>
<keywords lang="fr"><![CDATA[Abraham Lincoln, lieu de décès, page Web]]></keywords>
<keywords lang="nl"><![CDATA[Abraham Lincoln, stad, gestorven, website]]></keywords>
<keywords lang="ro"><![CDATA[locul morții, Abraham Lincoln, website]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE {
        res:Abraham_Lincoln dbo:deathPlace ?p .
        ?p dbp:website ?w .
        
}
]]></query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="244" onlydbo="true">
<string lang="en"><![CDATA[How deep is Lake Placid?]]></string>
<string lang="de"><![CDATA[Wie tief ist Lake Placid?]]></string>
<string lang="es"><![CDATA[Cómo de hondo es el Lago Placid?]]></string>
<string lang="it"><![CDATA[Quanto è profondo il Lake Placid?]]></string>
<string lang="fr"><![CDATA[Quelle est la profondeur du lac Placid?]]></string>
<string lang="nl"><![CDATA[Hoe diep is Lake Placid?]]></string>
<string lang="ro"><![CDATA[Cât de adânc este lacul Placid?]]></string>
<keywords lang="en"><![CDATA[Lake Placid, depth]]></keywords>
<keywords lang="de"><![CDATA[Lake Placid, Tiefe]]></keywords>
<keywords lang="es"><![CDATA[Lago Placid, profundidad]]></keywords>
<keywords lang="it"><![CDATA[Lake Placid, profondità]]></keywords>
<keywords lang="fr"><![CDATA[profondeur, lac Placid]]></keywords>
<keywords lang="nl"><![CDATA[Lake Placid, diepte]]></keywords>
<keywords lang="ro"><![CDATA[lacul Placid, adânc]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?n
WHERE {
        <http://dbpedia.org/resource/Lake_Placid_(Texas)> dbo:depth ?n . 
}
]]></query>
<answers><answer><![CDATA[12.192]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="240" onlydbo="true">
<string lang="en"><![CDATA[Give me the grandchildren of Bruce Lee.]]></string>
<string lang="de"><![CDATA[Gib mir die Enkel von Bruce Lee.]]></string>
<string lang="es"><![CDATA[Dame todos los nietos de Bruce Lee.]]></string>
<string lang="it"><![CDATA[Dammi i nipoti di Bruce Lee.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les petit-enfants de Bruce Lee.]]></string>
<string lang="nl"><![CDATA[Toon alle kleinkinderen van Bruce Lee.]]></string>
<string lang="ro"><![CDATA[Dă-mi nepoții lui Bruce Lee.]]></string>
<keywords lang="en"><![CDATA[Bruce Lee, grandchildren]]></keywords>
<keywords lang="de"><![CDATA[Bruce Lee, Enkel]]></keywords>
<keywords lang="es"><![CDATA[Bruce Lee, nietos]]></keywords>
<keywords lang="it"><![CDATA[Bruce Lee, nipoti]]></keywords>
<keywords lang="fr"><![CDATA[petit-enfants, Bruce Lee]]></keywords>
<keywords lang="nl"><![CDATA[Bruce Lee, kleinkinderen]]></keywords>
<keywords lang="ro"><![CDATA[Bruce Lee, nepoți]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Bruce_Lee dbo:child ?child . 
        ?child dbo:child ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Shannon_Lee]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="210" onlydbo="true">
<string lang="en"><![CDATA[Who is the youngest Darts player?]]></string>
<string lang="de"><![CDATA[Wer ist der jüngste Dartspieler?]]></string>
<string lang="es"><![CDATA[¿Quién es el jugador mas jóven de dardos?]]></string>
<string lang="it"><![CDATA[Chi è il giocatore di freccette più giovane?]]></string>
<string lang="fr"><![CDATA[Quel est le joueur de fléchettes le plus jeune?]]></string>
<string lang="nl"><![CDATA[Wie is de jongste dartsspeler?]]></string>
<string lang="ro"><![CDATA[Cine este cel mai tânăr jucător de Darts?]]></string>
<keywords lang="en"><![CDATA[Darts player, youngest]]></keywords>
<keywords lang="de"><![CDATA[Dartspieler, jüngster]]></keywords>
<keywords lang="es"><![CDATA[jugador más jóven dardos]]></keywords>
<keywords lang="it"><![CDATA[giocatore di freccette, più giovane]]></keywords>
<keywords lang="fr"><![CDATA[jouer de fléchettes, plus jeune]]></keywords>
<keywords lang="nl"><![CDATA[jongste Darts speeler]]></keywords>
<keywords lang="ro"><![CDATA[jucător de Darts, cel mai tânăr]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:DartsPlayer .
        ?uri dbo:birthDate ?date .
}
ORDER BY DESC(?date)
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Max_Hopp]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="221" onlydbo="true">
<string lang="en"><![CDATA[Where was Bach born?]]></string>
<string lang="de"><![CDATA[Wo wurde Bach geboren?]]></string>
<string lang="es"><![CDATA[¿Dónde nació Bach?]]></string>
<string lang="it"><![CDATA[Dove è nato Bach?]]></string>
<string lang="fr"><![CDATA[Où est né Bach?]]></string>
<string lang="nl"><![CDATA[Waar was Bach geboren?]]></string>
<string lang="ro"><![CDATA[Unde s-a născut Bach?]]></string>
<keywords lang="en"><![CDATA[birthplace, Bach]]></keywords>
<keywords lang="de"><![CDATA[Bach, geboren]]></keywords>
<keywords lang="es"><![CDATA[Bach, lugar de nacimiento]]></keywords>
<keywords lang="it"><![CDATA[Bach, luogo di nascita]]></keywords>
<keywords lang="fr"><![CDATA[Lieu de naissance, Bach]]></keywords>
<keywords lang="nl"><![CDATA[Bach, geboorteplaats]]></keywords>
<keywords lang="ro"><![CDATA[locul nașterii, Bach]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:Johann_Sebastian_Bach dbo:birthPlace ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Eisenach]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="232" onlydbo="true">
<string lang="en"><![CDATA[In which countries can you pay using the West African CFA franc?]]></string>
<string lang="de"><![CDATA[In welchen Ländern kann ich mit dem CFA-Franc BCEAO bezahlen?]]></string>
<string lang="es"><![CDATA[¿En qué páises se paga con el Franco CFA?]]></string>
<string lang="it"><![CDATA[In quali stati si può pagare usando il West African CFA franc?]]></string>
<string lang="fr"><![CDATA[Dans combien de pays peut-on payer aved les francs CFA ouest-africains?]]></string>
<string lang="nl"><![CDATA[In welke landen kan je met de Westafrikaanse CFA-frank betalen?]]></string>
<string lang="ro"><![CDATA[În ce țări poți plăti folosind francul CFA vest-african?]]></string>
<keywords lang="en"><![CDATA[countries, pay, West African CFA franc]]></keywords>
<keywords lang="de"><![CDATA[Land, bezahlen, CFA-Franc BCEAO]]></keywords>
<keywords lang="es"><![CDATA[país, moneda, Franco CFA]]></keywords>
<keywords lang="it"><![CDATA[stati, pagare, West African CFA franc]]></keywords>
<keywords lang="fr"><![CDATA[nombre de pays, Franc CFA ouest-africain]]></keywords>
<keywords lang="nl"><![CDATA[landen, betalen, CFA-frank]]></keywords>
<keywords lang="ro"><![CDATA[țări, plăti, franc CFA vest-african]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
         ?uri dbo:currency res:West_African_CFA_franc . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/French_Upper_Volta]]></answer><answer><![CDATA[http://dbpedia.org/resource/French_Dahomey]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ivory_Coast]]></answer><answer><![CDATA[http://dbpedia.org/resource/Republic_of_Upper_Volta]]></answer><answer><![CDATA[http://dbpedia.org/resource/Benin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Burkina_Faso]]></answer><answer><![CDATA[http://dbpedia.org/resource/Guinea-Bissau]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mali]]></answer><answer><![CDATA[http://dbpedia.org/resource/Niger]]></answer><answer><![CDATA[http://dbpedia.org/resource/Senegal]]></answer><answer><![CDATA[http://dbpedia.org/resource/Republic_of_Dahomey]]></answer><answer><![CDATA[http://dbpedia.org/resource/People's_Republic_of_Benin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Colonial_Mauritania]]></answer><answer><![CDATA[http://dbpedia.org/resource/Colony_of_Niger]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="214" onlydbo="true">
<string lang="en"><![CDATA[What is the most frequent cause of death?]]></string>
<string lang="de"><![CDATA[Was ist die häufigste Todesursache?]]></string>
<string lang="es"><![CDATA[¿Cual es la causa mortal más común?]]></string>
<string lang="it"><![CDATA[Qual è la causa principale di morte?]]></string>
<string lang="fr"><![CDATA[Quelle est la cause première de mortalité?]]></string>
<string lang="nl"><![CDATA[Wat is de meest voorkomende doodsoorzaak?]]></string>
<string lang="ro"><![CDATA[Care este cea mai frecventă cauză a deceselor?]]></string>
<keywords lang="en"><![CDATA[cause of death, most frequent]]></keywords>
<keywords lang="de"><![CDATA[Todesursache, häufigste]]></keywords>
<keywords lang="es"><![CDATA[causa mortal más frequente]]></keywords>
<keywords lang="it"><![CDATA[causa principale di morte]]></keywords>
<keywords lang="fr"><![CDATA[cause première, mortalité]]></keywords>
<keywords lang="nl"><![CDATA[meest voorkomende doodsoorzaak]]></keywords>
<keywords lang="ro"><![CDATA[cauză a deceselor, cea mai frecventă]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?x
WHERE {
        ?uri dbo:deathCause ?x . 
}
ORDER BY DESC(COUNT(DISTINCT ?uri)) 
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Myocardial_infarction]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="boolean" id="207" onlydbo="true">
<string lang="en"><![CDATA[Does the Isar flow into a lake?]]></string>
<string lang="de"><![CDATA[Fließt die Isar in einen See?]]></string>
<string lang="es"><![CDATA[¿Desemboca el Isar en un lago?]]></string>
<string lang="it"><![CDATA[L'Isar sfocia in un lago?]]></string>
<string lang="fr"><![CDATA[L'Isar se déverse-t-il dans un lac?]]></string>
<string lang="nl"><![CDATA[Mondt de Isar uit in een meer?]]></string>
<string lang="ro"><![CDATA[Isarul se varsă într-un lac?]]></string>
<keywords lang="en"><![CDATA[Isar, flow, lake]]></keywords>
<keywords lang="de"><![CDATA[Isar, fließt, See]]></keywords>
<keywords lang="es"><![CDATA[Isar, desemboca, lago]]></keywords>
<keywords lang="it"><![CDATA[Isar, sfociare, lago]]></keywords>
<keywords lang="fr"><![CDATA[Isar, deverse, lac]]></keywords>
<keywords lang="nl"><![CDATA[Isar, uitmonden, meer]]></keywords>
<keywords lang="ro"><![CDATA[Isar, varsă, lac]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK
WHERE {
        ?x dbo:inflow res:Isar .
        ?x rdf:type dbo:Lake . 
}
]]></query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="218" onlydbo="true">
<string lang="en"><![CDATA[Give me all films produced by Steven Spielberg with a budget of at least $80 million.]]></string>
<string lang="de"><![CDATA[Gib mir alle Filme, die von Steven Spielberg produziert worden und ein Budget von mindestens 80 Millionen Dollar hatten.]]></string>
<string lang="es"><![CDATA[Dame todas las películas producidas por Steven Spielberg con un presupuesto de al menos 80 milliones de dólares.]]></string>
<string lang="it"><![CDATA[Dammi tutti i film prodotti da Steven Spielberg con un budget finale di produzione di almeno 80 milioni di dollari.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les films produit par Steven Spielberg ayant un budget d'au moins $80 millions.]]></string>
<string lang="nl"><![CDATA[Toon alle films die door Steven Spielberg worden geproduceerd en die een budget van minstens 80 miljoen dollar hadden.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate filmele produse de Steven Spielberg, cu un buget final de producție de cel puțin 80 milioane de dolari.]]></string>
<keywords lang="en"><![CDATA[films, producer, Steven Spielberg, production budget, $80 million]]></keywords>
<keywords lang="de"><![CDATA[Film, Produzent, Steven Spielberg, Budget, $80 Millionen]]></keywords>
<keywords lang="es"><![CDATA[películas, productor, Steven Spielberg, presupuesto de al menos 80 milliones de dólares]]></keywords>
<keywords lang="it"><![CDATA[film, produttore, Steven Spielberg, butget di produzione, 80 milioni di dollari]]></keywords>
<keywords lang="fr"><![CDATA[films, Steven Spielberg, budget, au moins $80 millions]]></keywords>
<keywords lang="nl"><![CDATA[films, geproduceert door, Steven Spielberg, budget, minstens 80 miljoen dollar]]></keywords>
<keywords lang="ro"><![CDATA[filme, producător, Steven Spielberg, buget, 80 milioane de dolari]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:director res:Steven_Spielberg .
        ?uri dbo:budget ?b .
        FILTER( xsd:double(?b) >= 8.0E7 )
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Jurassic_Park]]></answer><answer><![CDATA[http://dbpedia.org/resource/A.I._Artificial_Intelligence]]></answer><answer><![CDATA[http://dbpedia.org/resource/Minority_Report_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/War_of_the_Worlds_(2005_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Indiana_Jones_and_the_Kingdom_of_the_Crystal_Skull]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="241" onlydbo="true">
<string lang="en"><![CDATA[Give me all writers that won the Nobel Prize in literature.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schriftsteller, die den Literaturnobelpreis gewonnen haben.]]></string>
<string lang="es"><![CDATA[Dame todos los escritores que hayan recibido el premio nobel de literatura.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli scrittori che hanno vinto il Premio Nobel della letteratura.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les auteurs qui ont gagné le prix Nobel de litérature.]]></string>
<string lang="nl"><![CDATA[Toon alle schrijvers die de Nobelprijs in literatuur hebben gewonnen.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți scriitorii care au câștigat premiul Nobel pentru literatură.]]></string>
<keywords lang="en"><![CDATA[writer, win, Nobel Prize in literature]]></keywords>
<keywords lang="de"><![CDATA[Schritfsteller, Literaturnobelpreis]]></keywords>
<keywords lang="es"><![CDATA[escritores, premio nobel de literatura]]></keywords>
<keywords lang="it"><![CDATA[scrittori, Premio Nobel della Letteratura]]></keywords>
<keywords lang="fr"><![CDATA[auteurs, prix Nobel de litérature]]></keywords>
<keywords lang="nl"><![CDATA[schrijvers, Nobelprijs in literatuur, gewonnen]]></keywords>
<keywords lang="ro"><![CDATA[scriitor, câștigat, premiul Nobel pentru literatură]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Writer .
        ?uri dbo:award res:Nobel_Prize_in_Literature . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Ivo_Andri%C4%87]]></answer><answer><![CDATA[http://dbpedia.org/resource/Seamus_Heaney]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aleksandr_Solzhenitsyn]]></answer><answer><![CDATA[http://dbpedia.org/resource/Czes%C5%82aw_Mi%C5%82osz]]></answer><answer><![CDATA[http://dbpedia.org/resource/John_Steinbeck]]></answer><answer><![CDATA[http://dbpedia.org/resource/Naguib_Mahfouz]]></answer><answer><![CDATA[http://dbpedia.org/resource/T._S._Eliot]]></answer><answer><![CDATA[http://dbpedia.org/resource/Eugene_O'Neill]]></answer><answer><![CDATA[http://dbpedia.org/resource/Harold_Pinter]]></answer><answer><![CDATA[http://dbpedia.org/resource/Alice_Munro]]></answer><answer><![CDATA[http://dbpedia.org/resource/Juan_Ram%C3%B3n_Jim%C3%A9nez]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="201" onlydbo="true">
<string lang="en"><![CDATA[Give me all taikonauts.]]></string>
<string lang="de"><![CDATA[Gib mir alle Taikonauten.]]></string>
<string lang="es"><![CDATA[Dame todas las taikonautas.]]></string>
<string lang="it"><![CDATA[Dammi tutte i taikonauti.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les taïkonautes.]]></string>
<string lang="nl"><![CDATA[Toon alle taikonauten.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți taikonauții.]]></string>
<keywords lang="en"><![CDATA[taikonauts]]></keywords>
<keywords lang="de"><![CDATA[Taikonauten]]></keywords>
<keywords lang="es"><![CDATA[taikonautas]]></keywords>
<keywords lang="it"><![CDATA[taikonauti]]></keywords>
<keywords lang="fr"><![CDATA[taïkonautes]]></keywords>
<keywords lang="nl"><![CDATA[taikonauten]]></keywords>
<keywords lang="ro"><![CDATA[taikonaut]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Astronaut .
        ?uri dbo:nationality res:China .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Fei_Junlong]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jing_Haipeng]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nie_Haisheng]]></answer><answer><![CDATA[http://dbpedia.org/resource/Zhai_Zhigang]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tao_Jiali]]></answer><answer><![CDATA[http://dbpedia.org/resource/Liu_Boming_(astronaut)]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="212" onlydbo="true">
<string lang="en"><![CDATA[How many pages does War and Peace have?]]></string>
<string lang="de"><![CDATA[Wieviele Seiten hat Krieg und Frieden?]]></string>
<string lang="es"><![CDATA[¿Cuántas páginas tiene Guerra y Paz?]]></string>
<string lang="it"><![CDATA[Quante pagine ha Guerra e Pace?]]></string>
<string lang="fr"><![CDATA[Combien de pages a Guerre et Paix?]]></string>
<string lang="nl"><![CDATA[Hoeveel pagina's heeft Oorlog en vrede?]]></string>
<string lang="ro"><![CDATA[Câte pagini are Război și Pace?]]></string>
<keywords lang="en"><![CDATA[how many, pages, War and Peace]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Seiten, Krieg und Frieden]]></keywords>
<keywords lang="es"><![CDATA[número paginas, Guerra y Paz]]></keywords>
<keywords lang="it"><![CDATA[pagine, Guerra e Pace]]></keywords>
<keywords lang="fr"><![CDATA[nomber de pages, Guerre et Paix]]></keywords>
<keywords lang="nl"><![CDATA[hoeveel pagina's, Oorlog en vrede]]></keywords>
<keywords lang="ro"><![CDATA[câte pagini, Război și Pace]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?n
WHERE {
        res:War_and_Peace dbo:numberOfPages ?n .
}
]]></query>
<answers><answer><![CDATA[1225]]></answer></answers></question>

