<?xml version="1.0"?>
<dataset id="qald-5_train">

<question aggregation="true" hybrid="false" answertype="resource" id="217" onlydbo="true">
<string lang="en"><![CDATA[What is the bridge with the longest span?]]></string>
<string lang="de"><![CDATA[Welche Brücke hat die längste Spannweite?]]></string>
<string lang="es"><![CDATA[¿Qué puente tiene el mayor largo del vano?]]></string>
<string lang="it"><![CDATA[Qual è il ponte con la campata più lunga?]]></string>
<string lang="fr"><![CDATA[Quel est le pont le plus large?]]></string>
<string lang="nl"><![CDATA[Wat is de brug met de grootste spanwijdte?]]></string>
<string lang="ro"><![CDATA[Care este podul cu cea mai mare deschidere?]]></string>
<keywords lang="en"><![CDATA[bridge, longest span]]></keywords>
<keywords lang="de"><![CDATA[Brücke, längste Spannweite]]></keywords>
<keywords lang="es"><![CDATA[puente, mayor largo del vano]]></keywords>
<keywords lang="it"><![CDATA[ponte, campata più lunga]]></keywords>
<keywords lang="fr"><![CDATA[pont, le plus large]]></keywords>
<keywords lang="nl"><![CDATA[brug, langste spanwijdte]]></keywords>
<keywords lang="ro"><![CDATA[pod, cea mai mare deschidere]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Bridge .
        ?uri dbo:mainspan ?s . 
} 
ORDER BY DESC(?s) 
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Overseas_Highway]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="247" onlydbo="false">
<string lang="en"><![CDATA[Give me all actors called Baldwin.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schauspieler, die Baldwin heißen.]]></string>
<string lang="es"><![CDATA[Dame todos los actores llamados Baldwin.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli attori che si chiamano Baldwin.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les acteurs appelés Baldwin.]]></string>
<string lang="nl"><![CDATA[Toon alle acteurs die Baldwin heten.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți actorii numiți Baldwin.]]></string>
<keywords lang="en"><![CDATA[actors, called, Baldwin]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, heißen, Baldwin]]></keywords>
<keywords lang="es"><![CDATA[actores, llamados Baldwin]]></keywords>
<keywords lang="it"><![CDATA[attori, chiamarsi, Baldwin]]></keywords>
<keywords lang="fr"><![CDATA[Acteury, appelés, Baldwin]]></keywords>
<keywords lang="nl"><![CDATA[acteurs, heten, Baldwin]]></keywords>
<keywords lang="ro"><![CDATA[actori, numit, Baldwin]]></keywords>
<query><![CDATA[
PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?uri
WHERE {
        ?uri foaf:surname 'Baldwin'@en . 
      { ?uri dbo:occupation res:Actor . } 
      UNION 
      { ?uri rdf:type dbo:Actor . }
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Lise_Baldwin]]></answer><answer><![CDATA[http://dbpedia.org/resource/A._Michael_Baldwin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Alec_Baldwin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Greg_Baldwin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Judith_Baldwin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Robert_Baldwin_(actor)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Talon_(pornographic_actor)]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="216" onlydbo="true">
<string lang="en"><![CDATA[Who is the tallest player of the Atlanta Falcons?]]></string>
<string lang="de"><![CDATA[Wer ist der größte Spieler der Atlanta Falcons?]]></string>
<string lang="es"><![CDATA[¿Quién es el jugador más alto de los Atlanta Falcons?]]></string>
<string lang="it"><![CDATA[Chi è il giocatore più alto degli Atlanta Falcons?]]></string>
<string lang="fr"><![CDATA[Qui est le joueur le plus grand des Atlanta Falcons?]]></string>
<string lang="nl"><![CDATA[Wie is de langste speler van de Atlanta Falcons?]]></string>
<string lang="ro"><![CDATA[Cine este cel mai înalt jucător din Atlanta Falcons?]]></string>
<keywords lang="en"><![CDATA[Atlanta Falcons, player, tallest]]></keywords>
<keywords lang="de"><![CDATA[Atlanta Falcons, Spieler, größter]]></keywords>
<keywords lang="es"><![CDATA[jugador más alto, Atlanta Falcons]]></keywords>
<keywords lang="it"><![CDATA[giocatore più alto, Atlanta Falcons]]></keywords>
<keywords lang="fr"><![CDATA[joueur le plus grand, Atlanta Falcons]]></keywords>
<keywords lang="nl"><![CDATA[Atlanta Falcons, speler, langste]]></keywords>
<keywords lang="ro"><![CDATA[Atlanta Falcons, jucător, cel mai înalt]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        ?uri dbo:team res:Atlanta_Falcons . 
        ?uri dbo:height ?h .
} 
ORDER BY DESC(?h) 
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Gabe_Carimi]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="208" onlydbo="true">
<string lang="en"><![CDATA[Which rivers flow into a German lake?]]></string>
<string lang="de"><![CDATA[Welche Flüsse fließen in deutsche Seen?]]></string>
<string lang="es"><![CDATA[¿Qué ríos desembocan en un lago alemán?]]></string>
<string lang="it"><![CDATA[Quali fiumi sfociano in un lago tedesco?]]></string>
<string lang="fr"><![CDATA[Quels cours d'eau se déversent-ils dans des lacs allemands?]]></string>
<string lang="nl"><![CDATA[Welke rivieren stromen naar een Duits meer?]]></string>
<string lang="ro"><![CDATA[Ce râuri se varsă într-un lac din Germania?]]></string>
<keywords lang="en"><![CDATA[rivers, flow, German lake]]></keywords>
<keywords lang="de"><![CDATA[Fluss, fließen, deutsch, See]]></keywords>
<keywords lang="es"><![CDATA[ríos, desembocan, lago alemán]]></keywords>
<keywords lang="it"><![CDATA[fiumi, sfociare, lago tedesco]]></keywords>
<keywords lang="fr"><![CDATA[cours d'eaux, lacs allemands]]></keywords>
<keywords lang="nl"><![CDATA[rivieren, stromen naar, Duits, meer]]></keywords>
<keywords lang="ro"><![CDATA[râuri, varsă, lac din Germania]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:River .
        ?x dbo:inflow ?uri .
        ?x rdf:type dbo:Lake . 
        ?x dbo:country res:Germany .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Rhine]]></answer><answer><![CDATA[http://dbpedia.org/resource/Havel]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rhin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Spree]]></answer><answer><![CDATA[http://dbpedia.org/resource/G%C3%B6sebek]]></answer><answer><![CDATA[http://dbpedia.org/resource/Black_Elster]]></answer><answer><![CDATA[http://dbpedia.org/resource/Elde]]></answer><answer><![CDATA[http://dbpedia.org/resource/Peene]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gro%C3%9Fe_Aue]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nieplitz]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hunte]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nebel_(river)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Schleemer_Bach]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bresenitz]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bi%C3%9Fnitz]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mildenitz_(river)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Warnow]]></answer><answer><![CDATA[http://dbpedia.org/resource/Trave]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lech_(river)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Neffelbach]]></answer><answer><![CDATA[http://dbpedia.org/resource/Swalm]]></answer><answer><![CDATA[http://dbpedia.org/resource/Alster]]></answer><answer><![CDATA[http://dbpedia.org/resource/Stepenitz_(Mecklenburg)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Schlaube]]></answer><answer><![CDATA[http://dbpedia.org/resource/Stendlitz]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aubach_(bei_Schwerin)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Konstanzer_Ach]]></answer><answer><![CDATA[http://dbpedia.org/resource/Br%C3%BCeler_Bach]]></answer><answer><![CDATA[http://dbpedia.org/resource/Drosedower_Bek]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dahme_(river)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sophienflie%C3%9F]]></answer><answer><![CDATA[http://dbpedia.org/resource/Plane_(river)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Buckau]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="number" id="238" onlydbo="false">
<string lang="en"><![CDATA[How many James Bond movies are there?]]></string>
<string lang="de"><![CDATA[Wieviele James-Bond-Filme gibt es?]]></string>
<string lang="es"><![CDATA[¿Cuántas películas de James Bond existen?]]></string>
<string lang="it"><![CDATA[Quanti film di James Bond ci sono stati?]]></string>
<string lang="fr"><![CDATA[Combien de films de James Bond existe-t-il?]]></string>
<string lang="nl"><![CDATA[Hoeveel James Bond films zijn er?]]></string>
<string lang="ro"><![CDATA[Câte filme Jamesc Bond există?]]></string>
<keywords lang="en"><![CDATA[how many, James Bond movies]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Jamee-Bond-Filme]]></keywords>
<keywords lang="es"><![CDATA[número de películas, James Bond]]></keywords>
<keywords lang="it"><![CDATA[quanti, film di James Bond]]></keywords>
<keywords lang="fr"><![CDATA[nomber de films, James Bond]]></keywords>
<keywords lang="nl"><![CDATA[hoeveel, James Bond films]]></keywords>
<keywords lang="ro"><![CDATA[câte, filme James Bond]]></keywords>
<query><![CDATA[
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX yago: <http://dbpedia.org/class/yago/> 
SELECT COUNT(DISTINCT ?uri) 
WHERE {
        ?uri rdf:type yago:JamesBondFilms . 
}
]]></query>
<answers><answer><![CDATA[24]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="uri" id="246" onlydbo="true">
<string lang="en"><![CDATA[Which rockets were launched from Baikonur?]]></string>
<string lang="de"><![CDATA[Welche Raketen sind von Baikonur gestartet?]]></string>
<string lang="es"><![CDATA[¿Qué cohetes han sido lanzados desde Baionur?]]></string>
<string lang="it"><![CDATA[Quali missili furono lanciati da Baikonur?]]></string>
<string lang="fr"><![CDATA[Quelles fusées ont été lancées de Baikonur?]]></string>
<string lang="nl"><![CDATA[Welke raketten werden gestart vanuit Baikonur?]]></string>
<string lang="ro"><![CDATA[Ce rachete au fost lansate din Baikonur?]]></string>
<keywords lang="en"><![CDATA[rockets, launched, Baikonur]]></keywords>
<keywords lang="de"><![CDATA[Raketen, Start, Baikonur]]></keywords>
<keywords lang="es"><![CDATA[cohetes, salida, Baikonur]]></keywords>
<keywords lang="it"><![CDATA[missili, lanciati, Baikonur]]></keywords>
<keywords lang="fr"><![CDATA[fusées, lanchement, Baikonur]]></keywords>
<keywords lang="nl"><![CDATA[raketten, gestart, Baikonur]]></keywords>
<keywords lang="ro"><![CDATA[rachete, lansat, Baikonur]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Rocket .
        ?uri dbo:launchSite res:Baikonur_Cosmodrome .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Soyuz-U]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kosmos-1]]></answer><answer><![CDATA[http://dbpedia.org/resource/Zenit-2M]]></answer><answer><![CDATA[http://dbpedia.org/resource/Energia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Zenit-3F]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tsyklon-2]]></answer><answer><![CDATA[http://dbpedia.org/resource/Zenit-3SLB]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tsyklon-4]]></answer><answer><![CDATA[http://dbpedia.org/resource/Proton-K]]></answer><answer><![CDATA[http://dbpedia.org/resource/Proton-M]]></answer><answer><![CDATA[http://dbpedia.org/resource/Zenit_(rocket_family)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Vostok-K]]></answer><answer><![CDATA[http://dbpedia.org/resource/Proton_(rocket_family)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Soyuz_(rocket_family)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Vostok_(rocket_family)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Molniya-M]]></answer><answer><![CDATA[http://dbpedia.org/resource/Soyuz/Vostok]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rokot]]></answer><answer><![CDATA[http://dbpedia.org/resource/Zenit-2]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kosmos-3]]></answer><answer><![CDATA[http://dbpedia.org/resource/Soyuz-2_(rocket)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sputnik_(rocket)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dnepr-1]]></answer><answer><![CDATA[http://dbpedia.org/resource/Soyuz-2-1v]]></answer><answer><![CDATA[http://dbpedia.org/resource/N1_(rocket)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Soyuz_(rocket)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Strela_(rocket)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Voskhod_(rocket)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Vostok-L]]></answer><answer><![CDATA[http://dbpedia.org/resource/Soyuz-FG]]></answer><answer><![CDATA[http://dbpedia.org/resource/Soyuz-L]]></answer><answer><![CDATA[http://dbpedia.org/resource/Polyot_(rocket)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Vostok-2M]]></answer><answer><![CDATA[http://dbpedia.org/resource/Soyuz-U2]]></answer><answer><![CDATA[http://dbpedia.org/resource/R-7A_Semyorka]]></answer><answer><![CDATA[http://dbpedia.org/resource/Vostok-2_(rocket)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tsyklon]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="236" onlydbo="true">
<string lang="en"><![CDATA[Which pope succeeded John Paul II?]]></string>
<string lang="de"><![CDATA[Welcher Papst folgte auf Johannes Paul II?]]></string>
<string lang="es"><![CDATA[¿Qué papa fue el sucesor de Juan Pablo II?]]></string>
<string lang="it"><![CDATA[Quale papa fu il successore di Giovanni Paolo II?]]></string>
<string lang="fr"><![CDATA[Quel pape est le successeur du pape Jean-Paul II?]]></string>
<string lang="nl"><![CDATA[Welke paus volgde Johannes Paul II op?]]></string>
<string lang="ro"><![CDATA[Care papă i-a urmat lui Ioan Paul al II-lea?]]></string>
<keywords lang="en"><![CDATA[pope, succeed, John Paul II]]></keywords>
<keywords lang="de"><![CDATA[Papst, folgt auf, Johannes Paul II]]></keywords>
<keywords lang="es"><![CDATA[Papa, sucesor, Juan Pablo II]]></keywords>
<keywords lang="it"><![CDATA[Papa, successore, Giovanni Paolo II]]></keywords>
<keywords lang="fr"><![CDATA[successeur, Jean-Paul II]]></keywords>
<keywords lang="nl"><![CDATA[paus, volgen, Johannes Paul II]]></keywords>
<keywords lang="ro"><![CDATA[papă, urmat, Ioan Paul al II-lea]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri
WHERE {
        res:Pope_John_Paul_II dbp:successor ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Pope_Benedict_XVI]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="205" onlydbo="true">
<string lang="en"><![CDATA[Give me all Dutch parties.]]></string>
<string lang="de"><![CDATA[Gib mir alle Niederländischen Parteien.]]></string>
<string lang="es"><![CDATA[Dame todos los partidos políticos holandeses]]></string>
<string lang="it"><![CDATA[Dammi tutti i partiti politici olandesi.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les partis politiques néerlandais.]]></string>
<string lang="nl"><![CDATA[Toon alle Nederlandse partijen.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate partidele politice olandeze.]]></string>
<keywords lang="en"><![CDATA[Dutch, party]]></keywords>
<keywords lang="de"><![CDATA[Niederländisch, Partei]]></keywords>
<keywords lang="es"><![CDATA[partidos políticos holandeses]]></keywords>
<keywords lang="it"><![CDATA[partiti politici olandesi]]></keywords>
<keywords lang="fr"><![CDATA[partis poliques, néerlandais]]></keywords>
<keywords lang="nl"><![CDATA[Nederlandse partijen.]]></keywords>
<keywords lang="ro"><![CDATA[partide politice olandeze]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:PoliticalParty .
        ?uri dbo:country res:Netherlands .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Christian_Democratic_Appeal]]></answer><answer><![CDATA[http://dbpedia.org/resource/People's_Party_for_Freedom_and_Democracy]]></answer><answer><![CDATA[http://dbpedia.org/resource/Reformed_Political_Party]]></answer><answer><![CDATA[http://dbpedia.org/resource/Anti-Revolutionary_Party]]></answer><answer><![CDATA[http://dbpedia.org/resource/GreenLeft]]></answer><answer><![CDATA[http://dbpedia.org/resource/Centre_Democrats_(Netherlands)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Frisian_National_Party]]></answer><answer><![CDATA[http://dbpedia.org/resource/Independent_Citizens'_Party]]></answer><answer><![CDATA[http://dbpedia.org/resource/Proud_of_the_Netherlands]]></answer><answer><![CDATA[http://dbpedia.org/resource/Socialist_Party_(Netherlands)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Free_Union_(anarchist_organisation)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Democratic_Political_Turning_Point]]></answer><answer><![CDATA[http://dbpedia.org/resource/Party_for_Freedom]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="date" id="230" onlydbo="false">
<string lang="en"><![CDATA[When is Halloween?]]></string>
<string lang="de"><![CDATA[Wann ist Halloween?]]></string>
<string lang="es"><![CDATA[¿Cuándo es Halloween?]]></string>
<string lang="it"><![CDATA[Quand'è Halloween?]]></string>
<string lang="fr"><![CDATA[Quand est Halloween?]]></string>
<string lang="nl"><![CDATA[Wanneer is Halloween?]]></string>
<string lang="ro"><![CDATA[Când este Halloween?]]></string>
<keywords lang="en"><![CDATA[date, Halloween]]></keywords>
<keywords lang="de"><![CDATA[Datum, Halloween]]></keywords>
<keywords lang="es"><![CDATA[fecha, Halloween]]></keywords>
<keywords lang="it"><![CDATA[data, Halloween]]></keywords>
<keywords lang="fr"><![CDATA[Halloween, date]]></keywords>
<keywords lang="nl"><![CDATA[datum, halloween]]></keywords>
<keywords lang="ro"><![CDATA[dată, Halloween]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date
WHERE {
        res:Halloween dbp:date ?date . 
}
]]></query>
<answers><answer><![CDATA[0001-10-31+02:00]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="243" onlydbo="true">
<string lang="en"><![CDATA[Give me all Swedish oceanographers.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schwedischen Ozeanographen.]]></string>
<string lang="es"><![CDATA[Dame todos los oceanógrafos suecos.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli oceanografi svedesi.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les océanographes suédois.]]></string>
<string lang="nl"><![CDATA[Toon alle Zweedse oceanograafen.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți oceanografii suedezi.]]></string>
<keywords lang="en"><![CDATA[Swedish, oceanographer]]></keywords>
<keywords lang="de"><![CDATA[Schwedisch, Ozeanographen]]></keywords>
<keywords lang="es"><![CDATA[oceanógrafos suecos]]></keywords>
<keywords lang="it"><![CDATA[svedesi, oceanografi]]></keywords>
<keywords lang="fr"><![CDATA[Océanographes, suédois]]></keywords>
<keywords lang="nl"><![CDATA[Zweedse, oceanograafen]]></keywords>
<keywords lang="ro"><![CDATA[oceanograf, suedez]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:field res:Oceanography . 
        ?uri dbo:birthPlace res:Sweden .        
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Vagn_Walfrid_Ekman]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="226" onlydbo="true">
<string lang="en"><![CDATA[Give me all actors who were born in Berlin.]]></string>
<string lang="de"><![CDATA[Gib mir alle in Berlin geborenenen Schauspieler.]]></string>
<string lang="es"><![CDATA[Dame todos los actores nacidos en Berlin.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli attori nati a Berlino.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les acteurs nés à Berlin.]]></string>
<string lang="nl"><![CDATA[Toon alle acteurs die in Berlijn zijn geboren.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți actorii care s-au născut la Berlin.]]></string>
<keywords lang="en"><![CDATA[actors, born, Berlin]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, geboren, Berlin]]></keywords>
<keywords lang="es"><![CDATA[actores, nacidos, Berlin]]></keywords>
<keywords lang="it"><![CDATA[attori, nati, Berlino]]></keywords>
<keywords lang="fr"><![CDATA[acteurs, lieu de naissance, Berlin]]></keywords>
<keywords lang="nl"><![CDATA[actuers, geboren, Berlijn]]></keywords>
<keywords lang="ro"><![CDATA[actori, născut, Berlin]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Actor .
        ?uri dbo:birthPlace res:Berlin .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Dru_Berrymore]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jack_Trevor]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lena_Nitro]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="237" onlydbo="true">
<string lang="en"><![CDATA[What was the last movie with Alec Guinness?]]></string>
<string lang="de"><![CDATA[Was war der letzte Film mit Alec Guinness?]]></string>
<string lang="es"><![CDATA[¿Cuál fue la última película con Alec Guinness?]]></string>
<string lang="it"><![CDATA[Qual è l'ultimo film con Alec Guinness?]]></string>
<string lang="fr"><![CDATA[Quel est le dernier film d'Alec Guinness?]]></string>
<string lang="nl"><![CDATA[Wat was de laatste film met Alec Guinness?]]></string>
<string lang="ro"><![CDATA[Care a fost ultimul film cu Alec Guinness?]]></string>
<keywords lang="en"><![CDATA[Alec Guinness, last, movie]]></keywords>
<keywords lang="de"><![CDATA[Alec Guinness, letzter, Film]]></keywords>
<keywords lang="es"><![CDATA[última película, Alec Guinness]]></keywords>
<keywords lang="it"><![CDATA[Alec Guinness, ultimo film]]></keywords>
<keywords lang="fr"><![CDATA[Alec Guiness, dernier film]]></keywords>
<keywords lang="nl"><![CDATA[Alec Guinness, laatste, film]]></keywords>
<keywords lang="ro"><![CDATA[Alec Guinness, ultim, film]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Film . 
        ?uri dbo:starring res:Alec_Guinness .
        ?uri dbo:releaseDate ?date . 
} 
ORDER BY DESC(?date) 
LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/A_Foreign_Field]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="203" onlydbo="true">
<string lang="en"><![CDATA[Which poet wrote the most books?]]></string>
<string lang="de"><![CDATA[Welcher Dichter hat die meisten Bücher geschrieben?]]></string>
<string lang="es"><![CDATA[¿Que poeta ha escrito el mayor número de libros?]]></string>
<string lang="it"><![CDATA[Quale poeta ha scritto il maggior numero di libri?]]></string>
<string lang="fr"><![CDATA[Quel poète a écrit le plus de livres?]]></string>
<string lang="nl"><![CDATA[Welke dichter heeft de meeste boeken geschreven?]]></string>
<string lang="ro"><![CDATA[Ce poet a scris cel mai mare număr de cărți?]]></string>
<keywords lang="en"><![CDATA[poet, most, books]]></keywords>
<keywords lang="de"><![CDATA[Dichter, Bücher, die meisten]]></keywords>
<keywords lang="es"><![CDATA[poeta, mayor número, libros]]></keywords>
<keywords lang="it"><![CDATA[poeta, maggior numero, libri]]></keywords>
<keywords lang="fr"><![CDATA[poète, maximum, livres]]></keywords>
<keywords lang="nl"><![CDATA[dichter, meeste boeken]]></keywords>
<keywords lang="ro"><![CDATA[poet, cel mai mare număr, cărți]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:occupation res:Poet .
        ?x dbo:author ?uri .
        ?x rdf:type dbo:Book .
}
ORDER BY DESC(COUNT(?x))
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Agatha_Christie]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="number" id="202" onlydbo="true">
<string lang="en"><![CDATA[How many languages are spoken in Colombia?]]></string>
<string lang="de"><![CDATA[Wieviele Sprachen werden in Kolumbien gesprochen?]]></string>
<string lang="es"><![CDATA[¿Cuántos idiomas se hablan en Colombia?]]></string>
<string lang="it"><![CDATA[Quante lingue sono parlate in Colombia?]]></string>
<string lang="fr"><![CDATA[Combien de langues sont parlées au Colombie?]]></string>
<string lang="nl"><![CDATA[Hoeveel talen worden er in Colombia gesproken?]]></string>
<string lang="ro"><![CDATA[Câte limbi sunt vorbite în Columbia?]]></string>
<keywords lang="en"><![CDATA[languages, Colombia]]></keywords>
<keywords lang="de"><![CDATA[Sprachen, Kolumbien]]></keywords>
<keywords lang="es"><![CDATA[idiomas, Colombia]]></keywords>
<keywords lang="it"><![CDATA[lingue, Colombia]]></keywords>
<keywords lang="fr"><![CDATA[langues, Colombie]]></keywords>
<keywords lang="nl"><![CDATA[talen, Columbia]]></keywords>
<keywords lang="ro"><![CDATA[limbi, Columbia]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT COUNT(DISTINCT ?uri) 
WHERE {
        ?uri rdf:type dbo:Language . 
        res:Colombia dbo:language ?uri .
}
]]></query>
<answers><answer><![CDATA[2]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="248" onlydbo="true">
<string lang="en"><![CDATA[What does IYCM stand for?]]></string>
<string lang="de"><![CDATA[Wofür steht IYCM?]]></string>
<string lang="es"><![CDATA[¿Qué abrevia IYCM?]]></string>
<string lang="it"><![CDATA[Che cosa significa IYCM?]]></string>
<string lang="fr"><![CDATA[Que veut dire IYCM?]]></string>
<string lang="nl"><![CDATA[Waarvoor staat de afkorting IYCM?]]></string>
<string lang="ro"><![CDATA[Ce înseamnă IYCM?]]></string>
<keywords lang="en"><![CDATA[IYCM, stand for]]></keywords>
<keywords lang="de"><![CDATA[IYCM, stehen für]]></keywords>
<keywords lang="es"><![CDATA[IYCM, abreviación]]></keywords>
<keywords lang="it"><![CDATA[IYCM, significato]]></keywords>
<keywords lang="fr"><![CDATA[IYCM, signification]]></keywords>
<keywords lang="nl"><![CDATA[IYCM, staat voor]]></keywords>
<keywords lang="ro"><![CDATA[IYCM, înseamnă]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:abbreviation 'IYCM' .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Youth_Climate_Movement]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="228" onlydbo="false">
<string lang="en"><![CDATA[What was Brazil's lowest rank in the FIFA World Ranking?]]></string>
<string lang="de"><![CDATA[Was war Brasiliens niedrigste Platzierung in der FIFA-Weltrangliste?]]></string>
<string lang="es"><![CDATA[¿Cuál ha sido la posición de ranking más baja de Brasil en el ranking mundial de la FIFA?]]></string>
<string lang="it"><![CDATA[Quale è stata la peggior posizione del Brasile nella classifica mondiale della FIFA?]]></string>
<string lang="fr"><![CDATA[Quel est le ranking le plus bas atteint par le Brésil dans le classement mondial de la FIFA?]]></string>
<string lang="nl"><![CDATA[Wat was de laagste plaatsing van het Braziliaans elftal in de FIFA-wereldranglijst?]]></string>
<string lang="ro"><![CDATA[Care a fost cel mai mic loc ocupat de Brazilia în clasamentul mondială FIFA?]]></string>
<keywords lang="en"><![CDATA[Brazil, lowest rank, FIFA World Ranking]]></keywords>
<keywords lang="de"><![CDATA[Brasilien, niedrigste Platzierung, FIFA-Weltrangliste]]></keywords>
<keywords lang="es"><![CDATA[Brasil, posición más baja, ranking mundial de la FIFA]]></keywords>
<keywords lang="it"><![CDATA[Brasile, peggior posizione, classifica mondiale della FIFA]]></keywords>
<keywords lang="fr"><![CDATA[raking, le plus bas, Brésil, classement, FIFA]]></keywords>
<keywords lang="nl"><![CDATA[Braziliaans elftal, laagste plaatsing, FIFA-wereldranglijst]]></keywords>
<keywords lang="ro"><![CDATA[Brazilia, cel mai mic loc, clasament mondial FIFA]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?n
WHERE {
        res:Brazil_national_football_team dbp:fifaMin ?n .
}
]]></query>
<answers><answer><![CDATA[22]]></answer></answers></question>

