<?xml version="1.0"?>
<dataset id="qald-5_train">

<question id="155" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which Greek goddesses dwelt on Mount Olympus?]]></string>
<string lang="de"><![CDATA[Welche griechischen Göttinnen bewohnten den Olymp?]]></string>
<string lang="es"><![CDATA[¿Qué diosas griegas habitan el Olimpo?]]></string>
<string lang="it"><![CDATA[Quale dea greca risiedeva sul monte Olimpo?]]></string>
<string lang="fr"><![CDATA[Quelles déesses grecques habitent sur l'Olympe?]]></string>
<string lang="nl"><![CDATA[Welke Griekse godinnen woonden op de Olympus?]]></string>
<string lang="ro"><![CDATA[ Care zeiță greacă a locuit pe Muntele Olimp?]]></string>
<keywords lang="en"><![CDATA[Greek goddess, dwell, Mount Olympys]]></keywords>
<keywords lang="de"><![CDATA[griechische Göttin, bewohnen, Olymp]]></keywords>
<keywords lang="es"><![CDATA[diosas griegas, habitan, Olimpo]]></keywords>
<keywords lang="it"><![CDATA[dea, greca, risiedere, Olimpo]]></keywords>
<keywords lang="fr"><![CDATA[déesses grecques, habitent, Olympe]]></keywords>
<keywords lang="nl"><![CDATA[Griekse godin, bewonen, Olympus]]></keywords>
<keywords lang="ro"><![CDATA[zeiță greacă, locui, Muntele Olimp]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX yago: <http://dbpedia.org/class/yago/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type yago:GreekGoddesses .  
        ?uri dbp:abode res:Mount_Olympus . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Aphrodite]]></answer><answer><![CDATA[http://dbpedia.org/resource/Artemis]]></answer><answer><![CDATA[http://dbpedia.org/resource/Athena]]></answer><answer><![CDATA[http://dbpedia.org/resource/Demeter]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hera]]></answer><answer><![CDATA[http://dbpedia.org/resource/Eileithyia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hygieia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Iris_(mythology)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nike_(mythology)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hebe_(mythology)]]></answer></answers></question>

<question id="156" onlydbo="false" answertype="date" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[When were the Hells Angels founded?]]></string>
<string lang="de"><![CDATA[Wann wurden die Hells Angels gegründet?]]></string>
<string lang="es"><![CDATA[¿Cúando se fundaron los Hells Angels?]]></string>
<string lang="it"><![CDATA[Quando si sono formati gli Hells Angels?]]></string>
<string lang="fr"><![CDATA[Quand ont-été fondé les Hells Angels?]]></string>
<string lang="nl"><![CDATA[Wanneer zijn de Hells Angels opgericht?]]></string>
<string lang="ro"><![CDATA[Când a fost înființată Hell Angels?]]></string>
<keywords lang="en"><![CDATA[Hells Angels, founded]]></keywords>
<keywords lang="de"><![CDATA[Hells Angels, gründen]]></keywords>
<keywords lang="es"><![CDATA[Hells Angels, fundación]]></keywords>
<keywords lang="it"><![CDATA[Hells Angels, formati]]></keywords>
<keywords lang="fr"><![CDATA[fondé, Hells Angels]]></keywords>
<keywords lang="nl"><![CDATA[Hells Angels, opgericht]]></keywords>
<keywords lang="ro"><![CDATA[Hell Angels, înființat]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?date 
WHERE { 
        res:Hells_Angels dbp:founded ?date . 
} 
]]>
</query>
<answers><answer><![CDATA[1948-03-17+02:00]]></answer></answers></question>

<question id="157" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all Apollo 14 astronauts.]]></string>
<string lang="de"><![CDATA[Gib mir alle Apollo-14-Astronauten.]]></string>
<string lang="es"><![CDATA[Dame todos los astronautas de Apolo 14?]]></string>
<string lang="it"><![CDATA[Dammi gli astronauti dell'Apollo 14.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les astronautes d'Apollo 14.]]></string>
<string lang="nl"><![CDATA[Geef de astronauten van Apollo 14.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți astronauții Apollo 14.]]></string>
<keywords lang="en"><![CDATA[astronaut, Apollo 14]]></keywords>
<keywords lang="de"><![CDATA[Astronaut, Apollo 14]]></keywords>
<keywords lang="es"><![CDATA[astronautas, Apolo 14]]></keywords>
<keywords lang="it"><![CDATA[astronauta, Apollo 14]]></keywords>
<keywords lang="fr"><![CDATA[astronautes, Apollo 14]]></keywords>
<keywords lang="nl"><![CDATA[astronaut, Apollo 14]]></keywords>
<keywords lang="ro"><![CDATA[astronaut, Apollo 14]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:mission res:Apollo_14 . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Alan_Shepard]]></answer><answer><![CDATA[http://dbpedia.org/resource/Edgar_Mitchell]]></answer><answer><![CDATA[http://dbpedia.org/resource/Stuart_Roosa]]></answer></answers></question>

<question id="158" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[What is the time zone of Salt Lake City?]]></string>
<string lang="de"><![CDATA[In welcher Zeitzone liegt Salt Lake City?]]></string>
<string lang="es"><![CDATA[¿En qué zona horaria se encuentra Salt Lake City?]]></string>
<string lang="it"><![CDATA[In quale fuso orario si trova Salt Lake City?]]></string>
<string lang="fr"><![CDATA[Quel est le fuseau horaire de Salt Lake City?]]></string>
<string lang="nl"><![CDATA[In welke tijdzone ligt Salt Lake City?]]></string>
<string lang="ro"><![CDATA[Care este fusul orar din Salt Lake City?]]></string>
<keywords lang="en"><![CDATA[Salt Lake City, time zone]]></keywords>
<keywords lang="de"><![CDATA[Salt Lake City, Zeitzone]]></keywords>
<keywords lang="es"><![CDATA[Salt Lake City, zona horaria]]></keywords>
<keywords lang="it"><![CDATA[Salt Lake City, fuso orario]]></keywords>
<keywords lang="fr"><![CDATA[fuseau horaire, Salt Lake City]]></keywords>
<keywords lang="nl"><![CDATA[Salt Lake City, tijdzone]]></keywords>
<keywords lang="ro"><![CDATA[Salt Lake City, fus orar]]></keywords>
<query><![CDATA[ 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Salt_Lake_City dbp:timezone ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Mountain_Time_Zone]]></answer></answers></question>

<question id="16" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me the capitals of all countries in Africa.]]></string>
<string lang="de"><![CDATA[Gib mir die Haupstädte von allen Ländern in Afrika.]]></string>
<string lang="es"><![CDATA[Dame las capitales de todos los países africanos.]]></string>
<string lang="it"><![CDATA[Dammi le capitali di tutti gli stati dell'Africa.]]></string>
<string lang="fr"><![CDATA[Donnes-moi la capitale de chaque pays d'Afrique.]]></string>
<string lang="nl"><![CDATA[Noem de hoofdsteden van alle landen in Afrika.]]></string>
<string lang="ro"><![CDATA[Dă-mi capitalele tuturor țărilor din Africa.]]></string>
<keywords lang="en"><![CDATA[Africa, country, capital]]></keywords>
<keywords lang="de"><![CDATA[Afrika, Land, Hauptstadt]]></keywords>
<keywords lang="es"><![CDATA[países, africanos, capital]]></keywords>
<keywords lang="it"><![CDATA[Africa, stato, capitale]]></keywords>
<keywords lang="fr"><![CDATA[capitale, pays, Afrique]]></keywords>
<keywords lang="nl"><![CDATA[Africa, land, hoof]]></keywords>
<keywords lang="ro"><![CDATA[Africa, țară, capitală]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX yago: <http://dbpedia.org/class/yago/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?states rdf:type yago:AfricanCountries . 
        ?states dbo:capital ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Banjul]]></answer><answer><![CDATA[http://dbpedia.org/resource/El_Aai%C3%BAn]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lusaka]]></answer><answer><![CDATA[http://dbpedia.org/resource/Harare]]></answer><answer><![CDATA[http://dbpedia.org/resource/Luanda]]></answer><answer><![CDATA[http://dbpedia.org/resource/Porto-Novo]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gaborone]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ouagadougou]]></answer><answer><![CDATA[http://dbpedia.org/resource/Yaound%C3%A9]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bangui]]></answer><answer><![CDATA[http://dbpedia.org/resource/Moroni,_Comoros]]></answer><answer><![CDATA[http://dbpedia.org/resource/Malabo]]></answer><answer><![CDATA[http://dbpedia.org/resource/Libreville]]></answer><answer><![CDATA[http://dbpedia.org/resource/Accra]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bissau]]></answer><answer><![CDATA[http://dbpedia.org/resource/Maseru]]></answer><answer><![CDATA[http://dbpedia.org/resource/Monrovia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tripoli]]></answer><answer><![CDATA[http://dbpedia.org/resource/Antananarivo]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lilongwe]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bamako]]></answer><answer><![CDATA[http://dbpedia.org/resource/Port_Louis]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rabat]]></answer><answer><![CDATA[http://dbpedia.org/resource/Maputo]]></answer><answer><![CDATA[http://dbpedia.org/resource/Windhoek]]></answer><answer><![CDATA[http://dbpedia.org/resource/Niamey]]></answer><answer><![CDATA[http://dbpedia.org/resource/Abuja]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kigali]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dakar]]></answer><answer><![CDATA[http://dbpedia.org/resource/Victoria,_Seychelles]]></answer><answer><![CDATA[http://dbpedia.org/resource/Freetown]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mogadishu]]></answer><answer><![CDATA[http://dbpedia.org/resource/Khartoum]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dodoma]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lom%C3%A9]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tunis]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kinshasa]]></answer><answer><![CDATA[http://dbpedia.org/resource/Asmara]]></answer><answer><![CDATA[http://dbpedia.org/resource/Brazzaville]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pretoria]]></answer><answer><![CDATA[http://dbpedia.org/resource/Addis_Ababa]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nairobi]]></answer><answer><![CDATA[http://dbpedia.org/resource/Praia]]></answer><answer><![CDATA[http://dbpedia.org/resource/Djibouti_(city)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Cairo]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nouakchott]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bujumbura]]></answer><answer><![CDATA[http://dbpedia.org/resource/Juba]]></answer></answers></question>

<question id="160" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me a list of all lakes in Denmark.]]></string>
<string lang="de"><![CDATA[Gib mir eine Liste aller Seen in Dänemark.]]></string>
<string lang="es"><![CDATA[Dame una lista de todos los lagos en Dinamarca.]]></string>
<string lang="it"><![CDATA[Dammi una lista di tutti i laghi della Danimarca.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les lacs du Danemark.]]></string>
<string lang="nl"><![CDATA[Noem alle meren in Denemarken.]]></string>
<string lang="ro"><![CDATA[Dă-mi o listă a tuturor lacurilor din Danemarca.]]></string>
<keywords lang="en"><![CDATA[lake, Denmark]]></keywords>
<keywords lang="de"><![CDATA[See, Dänemark]]></keywords>
<keywords lang="es"><![CDATA[lista, lagos, Dinamarca]]></keywords>
<keywords lang="it"><![CDATA[lago, Danimarca]]></keywords>
<keywords lang="fr"><![CDATA[lacs, Danemark]]></keywords>
<keywords lang="nl"><![CDATA[meer, Denemarken]]></keywords>
<keywords lang="ro"><![CDATA[lac, Danemarca]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX yago: <http://dbpedia.org/class/yago/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        { ?uri rdf:type dbo:Lake .  
          ?uri dbo:country res:Denmark . } 
        UNION 
        { ?uri rdf:type yago:LakesOfDenmark . } 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/The_Lakes,_Copenhagen]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lake_Bagsv%C3%A6rd]]></answer><answer><![CDATA[http://dbpedia.org/resource/B%C3%B8lling_lake]]></answer><answer><![CDATA[http://dbpedia.org/resource/Fures%C3%B8_(lake)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lake_Esrum]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lake_Madum]]></answer><answer><![CDATA[http://dbpedia.org/resource/Arres%C3%B8]]></answer><answer><![CDATA[http://dbpedia.org/resource/Eg%C3%A5_Engs%C3%B8]]></answer></answers></question>

<question id="161" onlydbo="true" answertype="number" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[How many missions does the Soyuz programme have?]]></string>
<string lang="de"><![CDATA[Wieviele Missionen umfasst das Soyuz-Programm?]]></string>
<string lang="es"><![CDATA[¿Cuántas misiones tiene el programa Soyuz?]]></string>
<string lang="it"><![CDATA[Quante missioni ha il programma Sojuz?]]></string>
<string lang="fr"><![CDATA[Donne-moi le nombre de missions Soyouz.]]></string>
<string lang="nl"><![CDATA[Hoeveel missies zijn er in het Soyuz programma?]]></string>
<string lang="ro"><![CDATA[Câte misiuni are programul Soyuz?]]></string>
<keywords lang="en"><![CDATA[how many, mission, Soyuz programme]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Mission, Soyuz-Programm]]></keywords>
<keywords lang="es"><![CDATA[cuántas, misiones, programa Soyuz]]></keywords>
<keywords lang="it"><![CDATA[quante missioni, programma Sojuz]]></keywords>
<keywords lang="fr"><![CDATA[combien, vols, le programme Soyouz]]></keywords>
<keywords lang="nl"><![CDATA[hoeveel, missie, Soyuz programma]]></keywords>
<keywords lang="ro"><![CDATA[câte, misiune, programul Soyuz]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT COUNT(DISTINCT ?uri)
WHERE { 
        ?uri dbp:programme res:Soyuz_programme . 
}  
]]>
</query>
<answers><answer><![CDATA[129]]></answer></answers></question>

<question id="162" onlydbo="true" answertype="boolean" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Did Socrates influence Aristotle?]]></string>
<string lang="de"><![CDATA[Hat Sokrates Aristoteles beeinflusst?]]></string>
<string lang="es"><![CDATA[¿Tuvo Sócrates influencia sobre Aristóteles?]]></string>
<string lang="it"><![CDATA[Socrate ha influenzato Aristotele?]]></string>
<string lang="fr"><![CDATA[Socrate a-t-il influencé Aristote?]]></string>
<string lang="nl"><![CDATA[Beïnvloedde Socrates Aristoteles?]]></string>
<string lang="ro"><![CDATA[L-a influențat Socrate pe Aristotel?]]></string>
<keywords lang="en"><![CDATA[Socrates, influence, Aristotle]]></keywords>
<keywords lang="de"><![CDATA[Sokrates, beeinflussen, Aristoteles]]></keywords>
<keywords lang="es"><![CDATA[Sócrates, influencia, Aristóteles]]></keywords>
<keywords lang="it"><![CDATA[Socrate, influenzare, Aristotele]]></keywords>
<keywords lang="fr"><![CDATA[Socrate, influencer, Aristote]]></keywords>
<keywords lang="nl"><![CDATA[beïnvloeden, Socrates, Aristoteles]]></keywords>
<keywords lang="ro"><![CDATA[Socrate, influență, Aristotel]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Socrates dbo:influenced res:Aristotle . 
} 
]]>
</query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question id="164" onlydbo="true" answertype="list" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all launch pads operated by NASA.]]></string>
<string lang="de"><![CDATA[Gib mir alle von der NASA betriebenen Startrampen.]]></string>
<string lang="es"><![CDATA[Dame todas las plataformas de lanzamiento operadas por la NASA.]]></string>
<string lang="it"><![CDATA[Dammi tutte le rampe di lancio gestite dalla NASA.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les rampes de lancements des Etats-unis.]]></string>
<string lang="nl"><![CDATA[Noem alle lanceerplatformen van de NASA.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate rampele de lansare operate de către NASA.]]></string>
<keywords lang="en"><![CDATA[launch pad, operate, NASA]]></keywords>
<keywords lang="de"><![CDATA[Startrampe, betreiben, NASA]]></keywords>
<keywords lang="es"><![CDATA[plataforma de lanzamiento, operada por la NASA]]></keywords>
<keywords lang="it"><![CDATA[rampa di lancio, gestire, NASA]]></keywords>
<keywords lang="fr"><![CDATA[rampes de lancements, Etats-unis]]></keywords>
<keywords lang="nl"><![CDATA[lanceerplatform, NASA]]></keywords>
<keywords lang="ro"><![CDATA[rampă de lansare, operat, NASA]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:LaunchPad .  
        ?uri dbo:operator res:NASA . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0]]></answer><answer><![CDATA[http://dbpedia.org/resource/Broglio_Space_Centre]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39]]></answer><answer><![CDATA[http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13]]></answer><answer><![CDATA[http://dbpedia.org/resource/Keweenaw_Rocket_Range]]></answer><answer><![CDATA[http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36]]></answer><answer><![CDATA[http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3]]></answer></answers></question>

<question id="165" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which instruments does Cat Stevens play?]]></string>
<string lang="de"><![CDATA[Welche Instrumente spielt Cat Stevens?]]></string>
<string lang="es"><![CDATA[¿Qué instrumentos tocaba Cat Stevens?]]></string>
<string lang="it"><![CDATA[Quali strumenti suona Cat Stevens?]]></string>
<string lang="fr"><![CDATA[Quels instruments joue Cat Stevens?]]></string>
<string lang="nl"><![CDATA[Welke instrumenten speeld Cat Stevens?]]></string>
<string lang="ro"><![CDATA[La ce instrumente cântă Cat Stevens?]]></string>
<keywords lang="en"><![CDATA[Cat Stevens, instrument]]></keywords>
<keywords lang="de"><![CDATA[Cat Stevens, Instrument]]></keywords>
<keywords lang="es"><![CDATA[Cat Stevens, instrumento, tocaba]]></keywords>
<keywords lang="it"><![CDATA[Cat Stevens, strumenti]]></keywords>
<keywords lang="fr"><![CDATA[Cat Stevens, instrument]]></keywords>
<keywords lang="nl"><![CDATA[Cat Stevens, instrument]]></keywords>
<keywords lang="ro"><![CDATA[Cat Stevens, instrument]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Cat_Stevens dbo:instrument ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Mellotron]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rhodes_piano]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bass_guitar]]></answer><answer><![CDATA[http://dbpedia.org/resource/Double_bass]]></answer><answer><![CDATA[http://dbpedia.org/resource/Guitar]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mandolin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gibson_J-200]]></answer><answer><![CDATA[http://dbpedia.org/resource/Organ_(music)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Baldwin_Piano_Company]]></answer><answer><![CDATA[http://dbpedia.org/resource/Fender_Telecaster]]></answer><answer><![CDATA[http://dbpedia.org/resource/Synthesizer]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gibson_ES-335]]></answer><answer><![CDATA[http://dbpedia.org/resource/Epiphone_Casino]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gibson_Everly_Brothers_Flattop]]></answer></answers></question>

<question id="166" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which ships were called after Benjamin Franklin?]]></string>
<string lang="de"><![CDATA[Welche Schiffe wurden nach Benjamin Franklin benannt?]]></string>
<string lang="es"><![CDATA[¿Qué barcos fueron bautizados en honor a Benjamin Franklin?]]></string>
<string lang="it"><![CDATA[Quali navi sono state battezzate in onore di Benjamin Franklin?]]></string>
<string lang="fr"><![CDATA[Quels bâteaux portent le nom de Benjamin Franklin?]]></string>
<string lang="nl"><![CDATA[Welke schepen zijn genoemd naar Benjamin Franklin?]]></string>
<string lang="ro"><![CDATA[Ce nave au fost numite după Benjamin Franklin?]]></string>
<keywords lang="en"><![CDATA[ship, called after, Benjamin Franklin]]></keywords>
<keywords lang="de"><![CDATA[Schiff, benannt, Benjamin Franklin]]></keywords>
<keywords lang="es"><![CDATA[barco, bautizado, honor, Benjamin Franklin]]></keywords>
<keywords lang="it"><![CDATA[navem battezzare, onore, Benjamin Franklin]]></keywords>
<keywords lang="fr"><![CDATA[bâteaux, nom, Benjamin Franklin]]></keywords>
<keywords lang="nl"><![CDATA[schip, genoemd naar, Benjamin Franklin]]></keywords>
<keywords lang="ro"><![CDATA[navă, numit după, Benjamin Franklin]]></keywords>
<query><![CDATA[ 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbp:shipNamesake res:Benjamin_Franklin . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/HMS_Canopus_(1798)]]></answer><answer><![CDATA[http://dbpedia.org/resource/USS_Franklin_(1815)]]></answer><answer><![CDATA[http://dbpedia.org/resource/USS_Franklin_(1795)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ben_Franklin_(PX-15)]]></answer></answers></question>

<question id="167" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who are the parents of the wife of Juan Carlos I?]]></string>
<string lang="de"><![CDATA[Wer sind die Eltern der Frau von Juan Carlos I?]]></string>
<string lang="es"><![CDATA[¿Quién son los padres de la esposa de Juan Carlos I?]]></string>
<string lang="it"><![CDATA[Chi sono i genitori della moglie di Juan Carlos I?]]></string>
<string lang="fr"><![CDATA[Qui sont les parents de l'épouse de Juan Carlos Ier?]]></string>
<string lang="nl"><![CDATA[Hoe heten de ouders van de vrouw van Juan Carlos I?]]></string>
<string lang="ro"><![CDATA[Cine sunt părinții soției lui Juan Carlos I?]]></string>
<keywords lang="en"><![CDATA[Juan Carlos I, wife, parents]]></keywords>
<keywords lang="de"><![CDATA[Juan Carlos I, Frau, Eltern]]></keywords>
<keywords lang="es"><![CDATA[padres, esposa, Juan Carlos I]]></keywords>
<keywords lang="it"><![CDATA[Juan Carlos I, moglie, genitori]]></keywords>
<keywords lang="fr"><![CDATA[parents, épouse, Juan Carlos Ier]]></keywords>
<keywords lang="nl"><![CDATA[ouders, vrouw van, Juan Carlos I]]></keywords>
<keywords lang="ro"><![CDATA[Juan Carlos I, soție, părinți]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Juan_Carlos_I_of_Spain dbo:spouse ?x . 
        ?x dbo:parent ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Paul_of_Greece]]></answer><answer><![CDATA[http://dbpedia.org/resource/Frederica_of_Hanover]]></answer></answers></question>

<question id="168" onlydbo="true" answertype="number" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[How many employees does Google have?]]></string>
<string lang="de"><![CDATA[Wieviele Angestellte hat Google?]]></string>
<string lang="es"><![CDATA[¿Cuántos empleados tiene Google?]]></string>
<string lang="it"><![CDATA[Quanti dipendenti ha Google?]]></string>
<string lang="fr"><![CDATA[Combien d'employés a Google?]]></string>
<string lang="nl"><![CDATA[Hoeveel werknemers heeft Google?]]></string>
<string lang="ro"><![CDATA[Câți angajați are Google?]]></string>
<keywords lang="en"><![CDATA[Google, employees]]></keywords>
<keywords lang="de"><![CDATA[Google, Angestellte]]></keywords>
<keywords lang="es"><![CDATA[Google, empleados]]></keywords>
<keywords lang="it"><![CDATA[Google, dipendenti]]></keywords>
<keywords lang="fr"><![CDATA[Nombre d'employés, Google]]></keywords>
<keywords lang="nl"><![CDATA[werknemers, Google]]></keywords>
<keywords lang="ro"><![CDATA[Google, angajați]]></keywords>
<query><![CDATA[ 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?num 
WHERE { 
        res:Google dbo:numberOfEmployees ?num . 
} 
]]>
</query>
<answers><answer><![CDATA[49829]]></answer></answers></question>

<question id="169" onlydbo="true" answertype="boolean" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Did Tesla win a nobel prize in physics?]]></string>
<string lang="de"><![CDATA[Hat Tesla den Nobelpreis für Physik gewonnen?]]></string>
<string lang="es"><![CDATA[¿Obtuvo Tesla el premio nobel de física?]]></string>
<string lang="it"><![CDATA[Tesla ha vinto un premio Nobel per la fisica?]]></string>
<string lang="fr"><![CDATA[Tesla a-t-il recu le prix Nobel?]]></string>
<string lang="nl"><![CDATA[Heeft Tesla ooit de Nobelprijs voor de Natuurkunde gewonnen?]]></string>
<string lang="ro"><![CDATA[A câștigat Tesla un premiu Nobel pentru fizică?]]></string>
<keywords lang="en"><![CDATA[Tesla, nobel prize, physics]]></keywords>
<keywords lang="de"><![CDATA[Tesla, Nobelpreis, Physik]]></keywords>
<keywords lang="es"><![CDATA[Tesla, premio nobel, física]]></keywords>
<keywords lang="it"><![CDATA[Tesla, premio nobel, fisica]]></keywords>
<keywords lang="fr"><![CDATA[Tesla, recu, prix Nobel]]></keywords>
<keywords lang="nl"><![CDATA[Nobelprijs voor de Natuurkunde, Tesla]]></keywords>
<keywords lang="ro"><![CDATA[Tesla, premiu Nobel, fizică]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Nikola_Tesla dbo:award res:Nobel_Prize_in_Physics . 
} 
]]>
</query>
<answers><answer><![CDATA[false]]></answer></answers></question>

<question id="17" onlydbo="true" answertype="resource" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Give me all cities in New Jersey with more than 100000 inhabitants.]]></string>
<string lang="de"><![CDATA[Gib mir alle Städte in New Jersey, die mehr als 100000 Einwohner haben.]]></string>
<string lang="es"><![CDATA[Dame todas las cuidades en New Jersey que tengan más de 100000 habitantes.]]></string>
<string lang="it"><![CDATA[Dammi tutte le città del New Jersey con più di 100000 abitanti.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les villes du New Jersey avec plus de 100000 habitants.]]></string>
<string lang="nl"><![CDATA[Geef alle steden in New Jersey met meer dan 100000 inwoners.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate orașele din New Jersey cu mai mult de 100000 de locuitori.]]></string>
<keywords lang="en"><![CDATA[New Jersey, city, inhabitants, more than 100000]]></keywords>
<keywords lang="de"><![CDATA[New Jersey, Stadt, Einwohner, mehr als 100000]]></keywords>
<keywords lang="es"><![CDATA[New Jersey, ciudad, habitantes, más de 100000]]></keywords>
<keywords lang="it"><![CDATA[New Jersey, città, abitanti, più di 100000]]></keywords>
<keywords lang="fr"><![CDATA[New Jersey, villes, habitants, plus de 100000]]></keywords>
<keywords lang="nl"><![CDATA[New Jersey, stad, inwoners, meer dan 100000]]></keywords>
<keywords lang="ro"><![CDATA[New Jersey, oraș, locuitori, mai mult de 100000]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:City .  
        ?uri dbo:isPartOf res:New_Jersey .  
        ?uri dbo:populationTotal ?inhabitants . 
        FILTER (?inhabitants > 100000) . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Newark,_New_Jersey]]></answer><answer><![CDATA[http://dbpedia.org/resource/Elizabeth,_New_Jersey]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jersey_City,_New_Jersey]]></answer><answer><![CDATA[http://dbpedia.org/resource/Paterson,_New_Jersey]]></answer></answers></question>

<question id="170" onlydbo="true" answertype="boolean" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Is Rita Wilson the wife of Tom Hanks?]]></string>
<string lang="de"><![CDATA[Ist Rita Wilson die Frau von Tom Hanks?]]></string>
<string lang="es"><![CDATA[¿Es Rita Wilson la esposa de Tom Hanks?]]></string>
<string lang="it"><![CDATA[Rita Wilson è la moglie di Tom Hanks?]]></string>
<string lang="fr"><![CDATA[Rita Wilson est-elle l'épouse de Tom Hanks?]]></string>
<string lang="nl"><![CDATA[Is Rita Wilson de vrouw van Tom Hanks?]]></string>
<string lang="ro"><![CDATA[Este Rita Wilson soția lui Tom Hanks?]]></string>
<keywords lang="en"><![CDATA[Rita Wilson, wife, Tom Hanks]]></keywords>
<keywords lang="de"><![CDATA[Rita Wilson, Frau, Tom Hanks]]></keywords>
<keywords lang="es"><![CDATA[Rita Wilson, esposa, Tom Hanks]]></keywords>
<keywords lang="it"><![CDATA[Rita Wilson, moglie, Tom Hanks]]></keywords>
<keywords lang="fr"><![CDATA[Rita Wilson, épouse, Tom Hanks]]></keywords>
<keywords lang="nl"><![CDATA[Rita Wilson, vrouw, Tom Hanks]]></keywords>
<keywords lang="ro"><![CDATA[Rita Wilson, soție, Tom Hanks]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Tom_Hanks dbo:spouse res:Rita_Wilson . 
} 
]]>
</query>
<answers><answer><![CDATA[true]]></answer></answers></question>

