<?xml version="1.0" ?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="258" onlydbo="true">
<string lang="en"><![CDATA[Give me all the TV shows with Neil Patrick Harris.]]></string>
<string lang="de"><![CDATA[Gib mir alle Fernsehserien mit Neil Patrick Harris.]]></string>
<string lang="es"><![CDATA[Dame todos los programas de televisión con Neil Patrick Harris.]]></string>
<string lang="it"><![CDATA[Dammi tutti i programmi televisivi con Neil Patrick Harris.]]></string>
<string lang="fr"><![CDATA[Donne-moi toutes les émissions de télé avec Neil Patrick Harris.]]></string>
<string lang="nl"><![CDATA[Toen alle TV programma's met Neil Patrick Harris.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate emisiunile TV cu Neil Patrick Harris]]></string>
<keywords lang="en"><![CDATA[TV shows, Neil Patrick Harris]]></keywords>
<keywords lang="de"><![CDATA[Fernsehserien, Neil Patrick Harris]]></keywords>
<keywords lang="es"><![CDATA[programas de televisión, Neil Patrick Harris]]></keywords>
<keywords lang="it"><![CDATA[programmi televisivi, Neil Patrick Harris]]></keywords>
<keywords lang="fr"><![CDATA[émissions de télé, Neil Patrick Harris]]></keywords>
<keywords lang="nl"><![CDATA[TV programma's, Neil Patrick Harris]]></keywords>
<keywords lang="ro"><![CDATA[emisiuni TV, Neil Patrick Harris]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
         ?uri rdf:type dbo:TelevisionShow . 
         ?uri dbo:starring res:Neil_Patrick_Harris . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="259" onlydbo="true">
<string lang="en"><![CDATA[Who wrote The Hunger Games?]]></string>
<string lang="de"><![CDATA[Wer hat Die Tribute von Panem geschrieben?]]></string>
<string lang="es"><![CDATA[¿Quien escribió Los juegos del hambre?]]></string>
<string lang="it"><![CDATA[Chi ha scritto Hunger Games?]]></string>
<string lang="fr"><![CDATA[Qui est l'auteur de The Hunger Games]]></string>
<string lang="nl"><![CDATA[Wie heeft De Hongerspelen geschreven?]]></string>
<string lang="ro"><![CDATA[Cine a scris Jocurile Foamei?]]></string>
<keywords lang="en"><![CDATA[wrote, Hunger Games]]></keywords>
<keywords lang="de"><![CDATA[geschrieben, Die Tribute von Panem]]></keywords>
<keywords lang="es"><![CDATA[autor, Los juegos del hambre]]></keywords>
<keywords lang="it"><![CDATA[autore, Hunger Games]]></keywords>
<keywords lang="fr"><![CDATA[auteur, The Hunger Games]]></keywords>
<keywords lang="nl"><![CDATA[geschreven, De Hongerspelen]]></keywords>
<keywords lang="ro"><![CDATA[scris, Jocurile Foamei]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri
WHERE { 
        res:The_Hunger_Games dbo:author ?uri . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="260" onlydbo="true">
<string lang="en"><![CDATA[Show a list of soccer clubs that play in the Bundesliga.]]></string>
<string lang="de"><![CDATA[Zeig mir eine Liste der Fußballvereine, die in der Bundesliga spielen.]]></string>
<string lang="es"><![CDATA[Dame una lista de los clubs de futbol que juegan en Bundesliga.]]></string>
<string lang="it"><![CDATA[Dammi una lista di club calcistici che giocano nella Bundesliga.]]></string>
<string lang="fr"><![CDATA[Donne-moi la liste des clubs de football qui jouent dans la Bundesliga.]]></string>
<string lang="nl"><![CDATA[Toen een lijst van voetbalclubs die in de Bundesliga spelen.]]></string>
<string lang="ro"><![CDATA[Arată o listă a cluburilor de fotbal care joacă în Bundesliga.]]></string>
<keywords lang="en"><![CDATA[soccer clubs, play, Bundesliga]]></keywords>
<keywords lang="de"><![CDATA[Fußballvereine, spielen, Bundesliga]]></keywords>
<keywords lang="es"><![CDATA[clubs de futbol, Bundesliga]]></keywords>
<keywords lang="it"><![CDATA[club calcistici, Bundesliga]]></keywords>
<keywords lang="fr"><![CDATA[clubs de football, Bundesliga]]></keywords>
<keywords lang="nl"><![CDATA[voetbalclubs, spelen, Bundesliga]]></keywords>
<keywords lang="ro"><![CDATA[cluburi de fotbal, joacă, Bundesliga]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:SoccerClub .
        ?uri dbo:league res:Bundesliga . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="261" onlydbo="false">
<string lang="en"><![CDATA[What country is Mount Everest in?]]></string>
<string lang="de"><![CDATA[In welchem Land ist der Mount Everest?]]></string>
<string lang="es"><![CDATA[¿En que país esta el monte Everest?]]></string>
<string lang="it"><![CDATA[In quale stato si trova il Monte Everest?]]></string>
<string lang="fr"><![CDATA[Dans quel pays se trouve le mont Everest?]]></string>
<string lang="nl"><![CDATA[In welke land is de Mount Everest?]]></string>
<string lang="ro"><![CDATA[În ce țară se află muntele Everest?]]></string>
<keywords lang="en"><![CDATA[country, Mount Everest]]></keywords>
<keywords lang="de"><![CDATA[Land, Mount Everest]]></keywords>
<keywords lang="es"><![CDATA[país, monte Everest]]></keywords>
<keywords lang="it"><![CDATA[stato, Monte Everest]]></keywords>
<keywords lang="fr"><![CDATA[pays, Everest]]></keywords>
<keywords lang="nl"><![CDATA[land, Mount Everest]]></keywords>
<keywords lang="ro"><![CDATA[țară, muntele Everest]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        res:Mount_Everest dbo:locatedInArea ?uri . 
        ?uri rdf:type dbo:Country .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="262" onlydbo="true">
<string lang="en"><![CDATA[Who is the founder of Penguin Books?]]></string>
<string lang="de"><![CDATA[Wer hat Penguin Books gegründet?]]></string>
<string lang="es"><![CDATA[¿Quien es el fundador de Penguin Books?]]></string>
<string lang="it"><![CDATA[Chi è il fondatore di Penguin Books?]]></string>
<string lang="fr"><![CDATA[Qui est le fondateur de Penguin  Books?]]></string>
<string lang="nl"><![CDATA[Wie is de oprichter van Penguin Books?]]></string>
<string lang="ro"><![CDATA[Cine este fondatorul Penguin Books?]]></string>
<keywords lang="en"><![CDATA[founder, Penguin Books]]></keywords>
<keywords lang="de"><![CDATA[gegründet, Penguin Books]]></keywords>
<keywords lang="es"><![CDATA[fundador, Penguin Books]]></keywords>
<keywords lang="it"><![CDATA[fondatore, Penguin Books]]></keywords>
<keywords lang="fr"><![CDATA[fondateur, Penguin Books]]></keywords>
<keywords lang="nl"><![CDATA[oprichter, Penguin Books]]></keywords>
<keywords lang="ro"><![CDATA[fondator, Penguin Books]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        res:Penguin_Books dbo:founder ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="263" onlydbo="true">
<string lang="en"><![CDATA[Which programming languages influenced Javascript?]]></string>
<string lang="de"><![CDATA[Welche Programmiersprachen haben Javascript beeinflusst?]]></string>
<string lang="es"><![CDATA[¿Que lenguajes de programación influenciaron el Javascript?]]></string>
<string lang="it"><![CDATA[Quali linguaggi di programmazione hanno influenzato Javascript?]]></string>
<string lang="fr"><![CDATA[Quels langages de programmation ont influencé Javascript?]]></string>
<string lang="nl"><![CDATA[Welke pogrammeertalen hadden invloed op Javascript?]]></string>
<string lang="ro"><![CDATA[Ce limbaje de programare au influențat Javascript?]]></string>
<keywords lang="en"><![CDATA[programming languages, influenced, Javascript]]></keywords>
<keywords lang="de"><![CDATA[Programmiersprachen, beeinflusst, Javascript]]></keywords>
<keywords lang="es"><![CDATA[lenguajes de programación, influenciaron, Javascript]]></keywords>
<keywords lang="it"><![CDATA[linguaggi di programmazione, hanno influenzato, Javascript]]></keywords>
<keywords lang="fr"><![CDATA[langages de programmation, influencés, Javascript]]></keywords>
<keywords lang="nl"><![CDATA[programmeertalen, invloed op, Javascript]]></keywords>
<keywords lang="ro"><![CDATA[limbaje de programare, influențat, Javascript]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:ProgrammingLanguage .
        ?uri dbo:influenced res:JavaScript . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="boolean" id="264" onlydbo="true">
<string lang="en"><![CDATA[Did Che Guevara have children?]]></string>
<string lang="de"><![CDATA[Hatte Che Guevara Kinder?]]></string>
<string lang="es"><![CDATA[¿Tuvo hijos el Che Guevara?]]></string>
<string lang="it"><![CDATA[Che Guevara aveva dei figli?]]></string>
<string lang="fr"><![CDATA[Est-ce que Che Guevara a eu des enfants?]]></string>
<string lang="nl"><![CDATA[Had Che Guevara kinderen?]]></string>
<string lang="ro"><![CDATA[Che Guevara a avut copii?]]></string>
<keywords lang="en"><![CDATA[children, Che Guevara]]></keywords>
<keywords lang="de"><![CDATA[Kinder, Che Guevara]]></keywords>
<keywords lang="es"><![CDATA[hijos, Che Guevara]]></keywords>
<keywords lang="it"><![CDATA[figli, Che Guevara]]></keywords>
<keywords lang="fr"><![CDATA[enfants, Che Guevara]]></keywords>
<keywords lang="nl"><![CDATA[kinderen, Che Guevara]]></keywords>
<keywords lang="ro"><![CDATA[copii, Che Guevara]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE { 
        res:Che_Guevara dbo:child ?uri . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="265" onlydbo="true">
<string lang="en"><![CDATA[List all the musicals with music by Elton John.]]></string>
<string lang="de"><![CDATA[Liste alle Musicals mit Musik von Elton John auf.]]></string>
<string lang="es"><![CDATA[Dame todos los musicales con música de Elton John.]]></string>
<string lang="it"><![CDATA[Elenca tutti i musicals con musiche di Elton John.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les musicals avec de la musique de de Elton John.]]></string>
<string lang="nl"><![CDATA[Toen een lijst van alle musicals met muziek van Elton John.]]></string>
<string lang="ro"><![CDATA[Listează toate muzicalurile cu muzică de Elton John.]]></string>
<keywords lang="en"><![CDATA[musicals, music by, Elton John]]></keywords>
<keywords lang="de"><![CDATA[Musicals, Musik von, Elton John]]></keywords>
<keywords lang="es"><![CDATA[musicales, música, Elton John]]></keywords>
<keywords lang="it"><![CDATA[musicals, musiche, Elton John]]></keywords>
<keywords lang="fr"><![CDATA[musicals, musique, Elton John]]></keywords>
<keywords lang="nl"><![CDATA[musicals, muziek van, Elton John]]></keywords>
<keywords lang="ro"><![CDATA[muzicaluri, muzică de Elton John]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Musical .
        ?uri dbo:musicBy res:Elton_John .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="266" onlydbo="true">
<string lang="en"><![CDATA[Show me all the breweries in Australia.]]></string>
<string lang="de"><![CDATA[Zeig mir alle Brauereien in Australien.]]></string>
<string lang="es"><![CDATA[Muéstrame todas las cervecerías en Australia.]]></string>
<string lang="it"><![CDATA[Mostrami tutti i birrifici in Australia.]]></string>
<string lang="fr"><![CDATA[Montre-moi toutes les brasseries d'Australie.]]></string>
<string lang="nl"><![CDATA[Toen alle brouwerijen in Australië.]]></string>
<string lang="ro"><![CDATA[Arată-mi toate berăriile din Australia.]]></string>
<keywords lang="en"><![CDATA[breweries, Australia]]></keywords>
<keywords lang="de"><![CDATA[Brauereien, Australien]]></keywords>
<keywords lang="es"><![CDATA[cervecerías, Australia]]></keywords>
<keywords lang="it"><![CDATA[birrifici, Australia]]></keywords>
<keywords lang="fr"><![CDATA[brasseries, Australie]]></keywords>
<keywords lang="nl"><![CDATA[brouwerijen, Australië]]></keywords>
<keywords lang="ro"><![CDATA[berării, Australia]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri ?x
WHERE { 
        ?uri rdf:type dbo:Brewery .
      { ?uri dbo:location res:Australia . }
      UNION
      { ?uri dbo:location ?x . 
        ?x dbo:country res:Australia . } 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="date" id="267" onlydbo="true">
<string lang="en"><![CDATA[When was the Titanic completed?]]></string>
<string lang="de"><![CDATA[Wann wurde die Titanic fertiggestellt?]]></string>
<string lang="es"><![CDATA[¿Cuando se completo el Titanic?]]></string>
<string lang="it"><![CDATA[Quando è stato completato il Titanic?]]></string>
<string lang="fr"><![CDATA[Quand a été terminé le Titanic?]]></string>
<string lang="nl"><![CDATA[Wanneer was de Titanic afgewerkt?]]></string>
<string lang="ro"><![CDATA[Când a fost terminat Titanicul?]]></string>
<keywords lang="en"><![CDATA[Titanic, completion date]]></keywords>
<keywords lang="de"><![CDATA[Titanic, fertiggestellt, Datum]]></keywords>
<keywords lang="es"><![CDATA[fecha de acabado, Titanic]]></keywords>
<keywords lang="it"><![CDATA[Titanic, data, completamento]]></keywords>
<keywords lang="fr"><![CDATA[data de terminaison, Titanic]]></keywords>
<keywords lang="nl"><![CDATA[Titanic, wanneer, afgewerkt]]></keywords>
<keywords lang="ro"><![CDATA[Titanic, data terminării]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date
WHERE { 
        res:RMS_Titanic dbo:completionDate ?date . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="number" id="268" onlydbo="true">
<string lang="en"><![CDATA[How much did Pulp Fiction cost?]]></string>
<string lang="de"><![CDATA[Wieviel hat Pulp Fiction gekostet?]]></string>
<string lang="es"><![CDATA[¿Cuanto costo Pulp Fiction?]]></string>
<string lang="it"><![CDATA[Quanto è costato Pulp Fiction?]]></string>
<string lang="fr"><![CDATA[Combien a coûté Pulp Fiction?]]></string>
<string lang="nl"><![CDATA[Howeveel koste Pulp Fiction?]]></string>
<string lang="ro"><![CDATA[Cât a costat Pulp Fiction?]]></string>
<keywords lang="en"><![CDATA[cost, Pulp Fiction]]></keywords>
<keywords lang="de"><![CDATA[Kosten, Pulp Fiction]]></keywords>
<keywords lang="es"><![CDATA[costo, Pulp Fiction]]></keywords>
<keywords lang="it"><![CDATA[costo, Pulp Fiction]]></keywords>
<keywords lang="fr"><![CDATA[prix, Pulp Fiction]]></keywords>
<keywords lang="nl"><![CDATA[kosten, Pulp Fiction]]></keywords>
<keywords lang="ro"><![CDATA[cost, Pulp Fiction]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?n
WHERE { 
        res:Pulp_Fiction dbo:budget ?n . 
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="number" id="269" onlydbo="true">
<string lang="en"><![CDATA[How many airlines are there?]]></string>
<string lang="de"><![CDATA[Wieviele Fluggesellschaften gibt es?]]></string>
<string lang="es"><![CDATA[¿Cuantas líneas aéreas existen?]]></string>
<string lang="it"><![CDATA[Quante compagnie aeree esistono?]]></string>
<string lang="fr"><![CDATA[Combien de companies aériennes existe-t-il?]]></string>
<string lang="nl"><![CDATA[Hoeveel luchtvaartmaatschappijen zijn er?]]></string>
<string lang="ro"><![CDATA[Câte companii aeriene există?]]></string>
<keywords lang="en"><![CDATA[how many, airlines]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Fluggesellschaften]]></keywords>
<keywords lang="es"><![CDATA[cuantas, líneas aéreas]]></keywords>
<keywords lang="it"><![CDATA[quante, compagnie aeree]]></keywords>
<keywords lang="fr"><![CDATA[nombre, companies aériennes]]></keywords>
<keywords lang="nl"><![CDATA[hoeveel, luchtvaartmaatschappijen]]></keywords>
<keywords lang="ro"><![CDATA[câte, companii aeriene]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT COUNT(DISTINCT ?uri)
WHERE { 
        ?uri rdf:type dbo:Airline . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="270" onlydbo="false">
<string lang="en"><![CDATA[Who played Agent Smith in Matrix?]]></string>
<string lang="de"><![CDATA[Wer hat Agent Smith in Matrix gespielt?]]></string>
<string lang="es"><![CDATA[¿Quien actuó como el agente Smith en Matrix?]]></string>
<string lang="it"><![CDATA[Chi interpretava l'agente Smith in Matrix?]]></string>
<string lang="fr"><![CDATA[Qui a joué Agent Smith dans Matrix?]]></string>
<string lang="nl"><![CDATA[Wie speelde Agent Smith in Matrix?]]></string>
<string lang="ro"><![CDATA[Cine l-a jucat pe Agent Smith în Matrix?]]></string>
<keywords lang="en"><![CDATA[played, Agent Smith, Matrix]]></keywords>
<keywords lang="de"><![CDATA[gespielt, Agent Smith, Matrix]]></keywords>
<keywords lang="es"><![CDATA[actor, agente Smith, Matrix]]></keywords>
<keywords lang="it"><![CDATA[attore, agente Smith, Matrix]]></keywords>
<keywords lang="fr"><![CDATA[acteur, Agent Smith, Matrix]]></keywords>
<keywords lang="nl"><![CDATA[speelde, Agent Smith, Matrix]]></keywords>
<keywords lang="ro"><![CDATA[jucat, Agent Smith, Matrix]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Agent_Smith dbp:portrayer ?uri . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="number" id="271" onlydbo="false">
<string lang="en"><![CDATA[How much carbs does peanut butter have?]]></string>
<string lang="de"><![CDATA[Wieviele Kohlenhydrate hat Erdnussbutter?]]></string>
<string lang="es"><![CDATA[¿Cuantos hidrates de carbono tienen la manteca de cacahuete?]]></string>
<string lang="it"><![CDATA[Quanti carboidrati ha il burro di noccioline?]]></string>
<string lang="fr"><![CDATA[Quelle quantité de glucides est contenue dans les arachides?]]></string>
<string lang="nl"><![CDATA[Hoeveel koolhydraten heeft pindakaas?]]></string>
<string lang="ro"><![CDATA[Câți carbohidrați conține untul de arahide?]]></string>
<keywords lang="en"><![CDATA[how much, carbs, peanut butter]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Kohlenhydrate, Erdnussbutter]]></keywords>
<keywords lang="es"><![CDATA[hidrates de carbono, manteca de cacahuete]]></keywords>
<keywords lang="it"><![CDATA[quanti, carboidrati, burro di noccioline]]></keywords>
<keywords lang="fr"><![CDATA[glucides, arachides]]></keywords>
<keywords lang="nl"><![CDATA[koolhydraten, pindakaas]]></keywords>
<keywords lang="ro"><![CDATA[câți, carbohidrați, unt de arahide]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?carbs
WHERE { 
        res:Peanut_butter dbp:carbs ?carbs .
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="272" onlydbo="true">
<string lang="en"><![CDATA[Which book has the most pages?]]></string>
<string lang="de"><![CDATA[Welches Buch hat die meisten Seiten?]]></string>
<string lang="es"><![CDATA[¿Que libro tiene el mayor numero de paginas?]]></string>
<string lang="it"><![CDATA[Quale libro ha il maggior numero di pagine?]]></string>
<string lang="fr"><![CDATA[Quel livre a le plus de pages?]]></string>
<string lang="nl"><![CDATA[Welk boek heeft de meeste pagina's?]]></string>
<string lang="ro"><![CDATA[Ce carte are cele mai multe pagini?]]></string>
<keywords lang="en"><![CDATA[book, the most pages]]></keywords>
<keywords lang="de"><![CDATA[Buch, meisten Seiten]]></keywords>
<keywords lang="es"><![CDATA[libro, mayor numero paginas]]></keywords>
<keywords lang="it"><![CDATA[libro, maggior numero di pagine]]></keywords>
<keywords lang="fr"><![CDATA[livre, le plus de pages]]></keywords>
<keywords lang="nl"><![CDATA[boek, meeste pagina's]]></keywords>
<keywords lang="ro"><![CDATA[carte, cele mai multe pagini]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Book . 
        ?uri dbo:numberOfPages ?n .
}
ORDER BY DESC(?n)
OFFSET 0 LIMIT 1
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="273" onlydbo="true">
<string lang="en"><![CDATA[Which bridges cross the Seine?]]></string>
<string lang="de"><![CDATA[Welche Brücken überqueren die Seine?]]></string>
<string lang="es"><![CDATA[¿Cuantos puentes cruzan el Siena?]]></string>
<string lang="it"><![CDATA[Quanti ponti attraversano la Senna?]]></string>
<string lang="fr"><![CDATA[Quels ponts traversent la Seine?]]></string>
<string lang="nl"><![CDATA[Welke bruggen overspannen de Seine?]]></string>
<string lang="ro"><![CDATA[Ce poduri traversează Sena?]]></string>
<keywords lang="en"><![CDATA[bridges, cross, Seine]]></keywords>
<keywords lang="de"><![CDATA[Brücken, überqueren, Seine]]></keywords>
<keywords lang="es"><![CDATA[puentes, cruzan, Siena]]></keywords>
<keywords lang="it"><![CDATA[ponti, attraversare, Senna]]></keywords>
<keywords lang="fr"><![CDATA[ponts, Seine]]></keywords>
<keywords lang="nl"><![CDATA[bruggen, overspannen, Seine]]></keywords>
<keywords lang="ro"><![CDATA[poduri, traversează, Sena]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Bridge .
        ?uri dbo:crosses res:Seine .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="274" onlydbo="true">
<string lang="en"><![CDATA[Who is the mayor of the capital of French Polynesia?]]></string>
<string lang="de"><![CDATA[Wer ist der Bürgermeister der Hauptstadt von Französisch-Polynesien?]]></string>
<string lang="es"><![CDATA[¿Quien es el alcalde de la capital de la Polinesia Francesa?]]></string>
<string lang="it"><![CDATA[Chi è il sindaco della capitale della Polinesia Francese?]]></string>
<string lang="fr"><![CDATA[Qui est le maire de la capitale de la Polynésie Francaise?]]></string>
<string lang="nl"><![CDATA[Wie is de burgermeester van de hoofdstad van Frans-Polynesië?]]></string>
<string lang="ro"><![CDATA[Cine este primarul capitaliei Polineziei Franceze?]]></string>
<keywords lang="en"><![CDATA[mayor, capital, French Polynesia]]></keywords>
<keywords lang="de"><![CDATA[Bürgermeister, Hauptstadt, Französisch-Polynesien]]></keywords>
<keywords lang="es"><![CDATA[alcalde, capital Polinesia Francesa]]></keywords>
<keywords lang="it"><![CDATA[sindaco, capitale, Polinesia Francese]]></keywords>
<keywords lang="fr"><![CDATA[maire, capitale, Polynésie Francaise]]></keywords>
<keywords lang="nl"><![CDATA[burgermeester, hoofdstad, Frans-Polynesië]]></keywords>
<keywords lang="ro"><![CDATA[primar, capitală, Polinezia Franceză]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        res:French_Polynesia dbo:capital ?x .
        ?x dbo:mayor ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="275" onlydbo="true">
<string lang="en"><![CDATA[When did Dracula's creator die?]]></string>
<string lang="de"><![CDATA[Wann ist Draculas Schöpfer gestorben?]]></string>
<string lang="es"><![CDATA[¿Cuando murió el creador de Drácula?]]></string>
<string lang="it"><![CDATA[Quando è morto il creatore di Dracula?]]></string>
<string lang="fr"><![CDATA[Quand est mort le créateur de Dracula?]]></string>
<string lang="nl"><![CDATA[Wanneer stierf de bedenker van Dracula?]]></string>
<string lang="ro"><![CDATA[Când a murit creatorul Dracula?]]></string>
<keywords lang="en"><![CDATA[Dracula, creator, die]]></keywords>
<keywords lang="de"><![CDATA[Dracula, Schöpfer, gestorben]]></keywords>
<keywords lang="es"><![CDATA[muerte, creador, Drácula]]></keywords>
<keywords lang="it"><![CDATA[Dracula, creatore, morire]]></keywords>
<keywords lang="fr"><![CDATA[mort, créateur, Dracula]]></keywords>
<keywords lang="nl"><![CDATA[stierf, bedenker, Dracula]]></keywords>
<keywords lang="ro"><![CDATA[Dracula, creator, a muri]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date
WHERE { 
        res:Count_Dracula dbo:creator ?x . 
        ?x dbo:deathDate ?date .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="276" onlydbo="true">
<string lang="en"><![CDATA[What is the location of the Houses of Parliament?]]></string>
<string lang="de"><![CDATA[Wo ist der Westminster-Palast?]]></string>
<string lang="es"><![CDATA[¿Donde están situadas las Casas del Parlamento?]]></string>
<string lang="it"><![CDATA[Dove si trova il Palazzo di Westminster?]]></string>
<string lang="fr"><![CDATA[Où se trouve le palais de Westminster?]]></string>
<string lang="nl"><![CDATA[Waar is de Palace of Westminster?]]></string>
<string lang="ro"><![CDATA[Care este locația Palatului Westminster?]]></string>
<keywords lang="en"><![CDATA[location, Houses of Parliament]]></keywords>
<keywords lang="de"><![CDATA[Ort, Westminster-Palast]]></keywords>
<keywords lang="es"><![CDATA[localización, casas del parlamento]]></keywords>
<keywords lang="it"><![CDATA[luogo, Palazzo di Westminster]]></keywords>
<keywords lang="fr"><![CDATA[location, palais de Westminster]]></keywords>
<keywords lang="nl"><![CDATA[plaats, Palace of Westminster]]></keywords>
<keywords lang="ro"><![CDATA[locație, Palatul Westminster]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT ?uri 
WHERE { 
         res:Palace_of_Westminster dbo:location ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="277" onlydbo="true">
<string lang="en"><![CDATA[Show me all English Gothic buildings in Kent.]]></string>
<string lang="de"><![CDATA[Zeige mir alle Gebäude in Kent, die im Stil der englischen Gothik erbaut wurden.]]></string>
<string lang="es"><![CDATA[Muéstrame todos los edificios góticos en Kent.]]></string>
<string lang="it"><![CDATA[Mostrami tutti gli edifici in stile gotico inglese nel Kent.]]></string>
<string lang="fr"><![CDATA[Montre-moi tous les bâtiments dans le style gothique anglais à Kent.]]></string>
<string lang="nl"><![CDATA[Toen alle gebouwen in Kent, gebouwd in de stijl van het Engels gotiek.]]></string>
<string lang="ro"><![CDATA[Arată-mi toate clădirile engleze gotice din Kent.]]></string>
<keywords lang="en"><![CDATA[English Gothic buildings, Kent]]></keywords>
<keywords lang="de"><![CDATA[Gebäude, Kent, englische Gotik]]></keywords>
<keywords lang="es"><![CDATA[edificios góticos, Kent]]></keywords>
<keywords lang="it"><![CDATA[edifici, gotico inglese, Kent]]></keywords>
<keywords lang="fr"><![CDATA[bâtiments, gothique anglais, Kent]]></keywords>
<keywords lang="nl"><![CDATA[gebouwen, Kent, stijl, Engels gotiek]]></keywords>
<keywords lang="ro"><![CDATA[clădiri engleze gotice, Kent]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT ?uri 
WHERE { 
         ?uri rdf:type dbo:Building . 
         ?uri dbo:architecturalStyle res:English_Gothic_architecture .
         ?uri dbo:location res:Kent .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="278" onlydbo="true">
<string lang="en"><![CDATA[Who was the pope that founded the Vatican Television?]]></string>
<string lang="de"><![CDATA[Welcher Papst hat das Vatikanische Fernsehen gegründet?]]></string>
<string lang="es"><![CDATA[¿Quien fue el papa que fundo la televisión Vaticana?]]></string>
<string lang="it"><![CDATA[Quale papa ha fondato la televisione vaticana?]]></string>
<string lang="fr"><![CDATA[Quel pape est le fondateur de la télé du Vatican?]]></string>
<string lang="nl"><![CDATA[Welk paus richtte de Vaticaanse televisie op?]]></string>
<string lang="ro"><![CDATA[Cine a fost papa care a creat televiziunea din Vatican?]]></string>
<keywords lang="en"><![CDATA[pope, founded, Vatican Television]]></keywords>
<keywords lang="de"><![CDATA[Papst, gegründet, Vatikanisches Fernsehen]]></keywords>
<keywords lang="es"><![CDATA[papa, fundo, televisión Vaticana]]></keywords>
<keywords lang="it"><![CDATA[papa, fondare, televisione vaticana]]></keywords>
<keywords lang="fr"><![CDATA[pape, fondateur, télé du Vatican]]></keywords>
<keywords lang="nl"><![CDATA[paus, oprichter, Vaticaanse televisie]]></keywords>
<keywords lang="ro"><![CDATA[papa, fondat, televiziunea din Vatican]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT ?uri 
WHERE { 
         ?uri rdf:type dbo:Pope . 
         res:Vatican_Television_Center dbo:foundedBy ?uri .
}
]]></query>
</question>

