<?xml version="1.0"?>
<dataset id="qald-5_train">

<question id="116" onlydbo="true" answertype="boolean" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Does Breaking Bad have more episodes than Game of Thrones?]]></string>
<string lang="de"><![CDATA[Hat Breaking Bad mehr Episoden als Game of Thrones?]]></string>
<string lang="es"><![CDATA[¿Tiene Breaking Bad más episodios que Game of Thrones?]]></string>
<string lang="it"><![CDATA[Breaking Bad ha più episodi di Game of Thrones?]]></string>
<string lang="fr"><![CDATA[A Breaking Bad plus d'épisodes que Game of Thrones?]]></string>
<string lang="nl"><![CDATA[Heeft Breaking Bad meer afleveringen dan Game of Thrones?]]></string>
<string lang="ro"><![CDATA[Are Breaking Bad mai multe episoade decât Game of Thrones?]]></string>
<keywords lang="en"><![CDATA[Breaking Bad, episodes, more than, Game of Thrones]]></keywords>
<keywords lang="de"><![CDATA[Breaking Bad, Episoden, mehr als, Game of Thrones]]></keywords>
<keywords lang="es"><![CDATA[Breaking Bad, episodios, más que, Game of Thrones]]></keywords>
<keywords lang="it"><![CDATA[Breaking Bad, eposido, più di, Game of Thrones]]></keywords>
<keywords lang="fr"><![CDATA[Breaking Bad, épisodes plus que, Game of Thrones]]></keywords>
<keywords lang="nl"><![CDATA[Breaking Bad, afleveringen, meer dan, Game of Thrones]]></keywords>
<keywords lang="ro"><![CDATA[Breaking Bad, episoade, mai multe decât, Game of Thrones]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Breaking_Bad dbo:numberOfEpisodes ?x . 
        res:Game_of_Thrones dbo:numberOfEpisodes ?y . 
        FILTER (?x > ?y) 
} 
]]>
</query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question id="119" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all people that were born in Vienna and died in Berlin.]]></string>
<string lang="de"><![CDATA[Gib mir alle Personen, die in Wien geboren wurden und in Berlin gestorben sind.]]></string>
<string lang="es"><![CDATA[Dame todas las personas que hayan nacido en Viena y hayan muerto en Berlin.]]></string>
<string lang="it"><![CDATA[Dammi tutte le persone che sono nate a Vienna e morte a Berlino.]]></string>
<string lang="fr"><![CDATA[Donne-moi toutes les personnes qui sont nées à Vienne et mortes à Berlin.]]></string>
<string lang="nl"><![CDATA[Noem alle personen die geboren zijn in Wenen en gestorven zijn in Berlijn.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți oamenii care s-au născut în Viena și au murit în Berlin.]]></string>
<keywords lang="en"><![CDATA[people, born, Vienna, die, Berlin]]></keywords>
<keywords lang="de"><![CDATA[Person, geboren, Wien, gestorben, Berlin]]></keywords>
<keywords lang="es"><![CDATA[personas, nacidas en Viena, muertas en Berlin]]></keywords>
<keywords lang="it"><![CDATA[persona, nata, Vienna, morta, Berlino]]></keywords>
<keywords lang="fr"><![CDATA[personnes, nées, Vienne, mortes, Berlin]]></keywords>
<keywords lang="nl"><![CDATA[persoon, geboren, Wenen, gestorven, Berlijn]]></keywords>
<keywords lang="ro"><![CDATA[oameni, născut, Viena, murit, Berlin]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:birthPlace res:Vienna . 
        ?uri dbo:deathPlace res:Berlin . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Alfred_Halm]]></answer><answer><![CDATA[http://dbpedia.org/resource/Richard_Thurnwald]]></answer><answer><![CDATA[http://dbpedia.org/resource/Grete_von_Zieritz]]></answer><answer><![CDATA[http://dbpedia.org/resource/Eduard_von_Winterstein]]></answer><answer><![CDATA[http://dbpedia.org/resource/Karl_Hellmer]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hilde_K%C3%B6rber]]></answer><answer><![CDATA[http://dbpedia.org/resource/Adolf_Klein]]></answer><answer><![CDATA[http://dbpedia.org/resource/Michael_von_Newlinsky]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hugo_Flink]]></answer><answer><![CDATA[http://dbpedia.org/resource/Erik_Jan_Hanussen]]></answer><answer><![CDATA[http://dbpedia.org/resource/Therese_Gr%C3%BCnbaum]]></answer><answer><![CDATA[http://dbpedia.org/resource/Karl_Etlinger]]></answer><answer><![CDATA[http://dbpedia.org/resource/Steffie_Spira]]></answer></answers></question>

<question id="12" onlydbo="true" answertype="boolean" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Is proinsulin a protein?]]></string>
<string lang="de"><![CDATA[Ist Proinsulin ein Protein?]]></string>
<string lang="es"><![CDATA[¿La proinsulina es una proteina?]]></string>
<string lang="it"><![CDATA[La proinsulina è una proteina?]]></string>
<string lang="fr"><![CDATA[La pro-insuline est-elle une protéine?]]></string>
<string lang="nl"><![CDATA[Is proinsuline een proteïne?]]></string>
<string lang="ro"><![CDATA[Este proinsulina o proteină?]]></string>
<keywords lang="en"><![CDATA[proinsulin, protein]]></keywords>
<keywords lang="de"><![CDATA[Proinsulin, Protein]]></keywords>
<keywords lang="es"><![CDATA[proinsulina, protein]]></keywords>
<keywords lang="it"><![CDATA[proinsulina, proteina]]></keywords>
<keywords lang="fr"><![CDATA[pro-insuline, protéine]]></keywords>
<keywords lang="nl"><![CDATA[proinsuline, proteïne]]></keywords>
<keywords lang="ro"><![CDATA[proinsulină, proteină]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
ASK 
WHERE { 
        res:Proinsulin rdf:type dbo:Protein . 
} 
]]>
</query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question id="120" onlydbo="true" answertype="number" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[How tall is Michael Jordan?]]></string>
<string lang="de"><![CDATA[Wie groß ist Michael Jordan?]]></string>
<string lang="es"><![CDATA[¿Qué altura tiene Michael Jordan?]]></string>
<string lang="it"><![CDATA[Quanto è alto Michael Jordan?]]></string>
<string lang="fr"><![CDATA[Quelle est la taille de Michael Jordan?]]></string>
<string lang="nl"><![CDATA[Hoe lang is Michael Jordan?]]></string>
<string lang="ro"><![CDATA[Ce înățime are Michael Jordan?]]></string>
<keywords lang="en"><![CDATA[tall, Michael Jordan]]></keywords>
<keywords lang="de"><![CDATA[groß, Michael Jordan]]></keywords>
<keywords lang="es"><![CDATA[altura, Michael Jordan]]></keywords>
<keywords lang="it"><![CDATA[altezza, Michael Jordan]]></keywords>
<keywords lang="fr"><![CDATA[taille, Michael Jordan]]></keywords>
<keywords lang="nl"><![CDATA[lang, Michael Jordan]]></keywords>
<keywords lang="ro"><![CDATA[înălțime, Michael Jordan]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?num 
WHERE { 
        res:Michael_Jordan dbo:height ?num . 
} 
]]>
</query>
<answers><answer><![CDATA[1.9812]]></answer></answers></question>

<question id="121" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[What is the capital of Canada?]]></string>
<string lang="de"><![CDATA[Was ist die Hauptstadt von Kanada?]]></string>
<string lang="es"><![CDATA[¿Cuál es la capital de Canadá?]]></string>
<string lang="it"><![CDATA[Qual è la capitale del Canada?]]></string>
<string lang="fr"><![CDATA[Quelle est la capitale du Canada?]]></string>
<string lang="nl"><![CDATA[Wat is de hoofdstad van Canada?]]></string>
<string lang="ro"><![CDATA[Care este capitala Canadei?]]></string>
<keywords lang="en"><![CDATA[capital, Canada]]></keywords>
<keywords lang="de"><![CDATA[Hauptstadt, Kanada]]></keywords>
<keywords lang="es"><![CDATA[capital, Canadá]]></keywords>
<keywords lang="it"><![CDATA[capitale, Canada]]></keywords>
<keywords lang="fr"><![CDATA[capitale, Canada]]></keywords>
<keywords lang="nl"><![CDATA[hoofdstad, Canada]]></keywords>
<keywords lang="ro"><![CDATA[capitală, Canada]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Canada dbo:capital ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Ottawa]]></answer></answers></question>

<question id="122" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who is the governor of Wyoming?]]></string>
<string lang="de"><![CDATA[Wer ist der Gouverneur von Wyoming?]]></string>
<string lang="es"><![CDATA[¿Quién es el gobernador de Wyoming?]]></string>
<string lang="it"><![CDATA[Chi è il governatore del Wyoming?]]></string>
<string lang="fr"><![CDATA[Qui est le gouverneur du Wyoming?]]></string>
<string lang="nl"><![CDATA[Wie is de gouverneur van Wyoming?]]></string>
<string lang="ro"><![CDATA[Cine este guvernatorul din Wyoming?]]></string>
<keywords lang="en"><![CDATA[governor, Wyoming]]></keywords>
<keywords lang="de"><![CDATA[Gouverneur, Wyoming]]></keywords>
<keywords lang="es"><![CDATA[gobernador, Wyoming]]></keywords>
<keywords lang="it"><![CDATA[governatore, Wyoming]]></keywords>
<keywords lang="fr"><![CDATA[gouverneur, Wyoming]]></keywords>
<keywords lang="nl"><![CDATA[gouverneur, Wyoming]]></keywords>
<keywords lang="ro"><![CDATA[guvernator, Wyoming]]></keywords>
<query><![CDATA[ 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Wyoming dbp:governor ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Matt_Mead]]></answer></answers></question>

<question id="123" onlydbo="false" answertype="boolean" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Do Prince Harry and Prince William have the same parents?]]></string>
<string lang="de"><![CDATA[Haben Prinz Harry und Prinz William dieselben Eltern?]]></string>
<string lang="es"><![CDATA[¿Tienen el príncipe Harry y el prínciple William la misma madre?]]></string>
<string lang="it"><![CDATA[Il principe Harry e il principe William hanno gli stessi genitoris?]]></string>
<string lang="fr"><![CDATA[Ont les princes Harry et William la même mère?]]></string>
<string lang="nl"><![CDATA[Hebben prins Harry en prins William dezelfde ouders?]]></string>
<string lang="ro"><![CDATA[Prințul Harry și Prințul William au aceiași părinți?]]></string>
<keywords lang="en"><![CDATA[Prince Harry, Prince William, same, parents]]></keywords>
<keywords lang="de"><![CDATA[Prinz Harry, Prinz William, selbe Eltern]]></keywords>
<keywords lang="es"><![CDATA[príncipe Harry, príncipe William, la misma madre]]></keywords>
<keywords lang="it"><![CDATA[principe Harry, principe William, stessi genitori]]></keywords>
<keywords lang="fr"><![CDATA[prince Harry, Prince William, même mère]]></keywords>
<keywords lang="nl"><![CDATA[prins Harry, prins William, dezelfde, ouders]]></keywords>
<keywords lang="ro"><![CDATA[Prințul Harry, Prințul William, aceiași, părinți]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
ASK
WHERE { 
        <http://dbpedia.org/resource/Prince_William,_Duke_of_Cambridge> dbo:parent ?x . 
        <http://dbpedia.org/resource/Prince_Harry> dbo:parent ?x .
} 
]]>
</query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question id="124" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who was the father of Queen Elizabeth II?]]></string>
<string lang="de"><![CDATA[Wer war der Vater von Königin Elizabeth II?]]></string>
<string lang="es"><![CDATA[¿Quién fue el padre de la reina Isabel II?]]></string>
<string lang="it"><![CDATA[Chi fu il padre della regina Elisabetta II?]]></string>
<string lang="fr"><![CDATA[Qui est le père de la reine Élisabeth II?]]></string>
<string lang="nl"><![CDATA[Wie was de vader van koningin Elizabeth II?]]></string>
<string lang="ro"><![CDATA[Cine a fost tatăl reginei Elisabeta a II-a?]]></string>
<keywords lang="en"><![CDATA[father, Queen Elizabeth II]]></keywords>
<keywords lang="de"><![CDATA[Vater, Königin Elizabeth II]]></keywords>
<keywords lang="es"><![CDATA[padre, reina Isabel II]]></keywords>
<keywords lang="it"><![CDATA[padre, regina Elisabetta II]]></keywords>
<keywords lang="fr"><![CDATA[père, Élisabeth II]]></keywords>
<keywords lang="nl"><![CDATA[koningin Elizabeth II, vader]]></keywords>
<keywords lang="ro"><![CDATA[tată, regina Elisabeta a II-a]]></keywords>
<query><![CDATA[ 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Elizabeth_II dbp:father ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/George_VI]]></answer></answers></question>

<question id="125" onlydbo="false" answertype="resource" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Which U.S. state has been admitted latest?]]></string>
<string lang="de"><![CDATA[Welcher US-Bundesstaat wurde zuletzt aufgenommen?]]></string>
<string lang="es"><![CDATA[¿Qué estado americano fué el último en ser admitido?]]></string>
<string lang="it"><![CDATA[Quale stato degli Stati Uniti è stato ammesso per ultimo?]]></string>
<string lang="fr"><![CDATA[Quel état américan fut le dernier à être admis?]]></string>
<string lang="nl"><![CDATA[Welke staat van de Verenigde Staten is als laatste toegetreden?]]></string>
<string lang="ro"><![CDATA[Care stat american a fost recunoscut ultimul?]]></string>
<keywords lang="en"><![CDATA[U.S. state, admit, last]]></keywords>
<keywords lang="de"><![CDATA[US-Bundesstaat, aufnehmen, zuletzt]]></keywords>
<keywords lang="es"><![CDATA[estado americano, admitido, último]]></keywords>
<keywords lang="it"><![CDATA[stato degli Stati Uniti, ammettere, ultimo]]></keywords>
<keywords lang="fr"><![CDATA[état américain, admis, dernier]]></keywords>
<keywords lang="nl"><![CDATA[staat van de Verenigde Staten, toetreding]]></keywords>
<keywords lang="ro"><![CDATA[stat american, recunoscut, ultimul]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX yago: <http://dbpedia.org/class/yago/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type yago:StatesOfTheUnitedStates . 
        ?uri dbp:admittancedate ?x . 
} ORDER BY DESC(?x) 
OFFSET 0 LIMIT 1 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Hawaii]]></answer></answers></question>

<question id="126" onlydbo="true" answertype="number" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[How many languages are spoken in Turkmenistan?]]></string>
<string lang="de"><![CDATA[Wieviele Sprachen werden in Turkmenistan gesprochen?]]></string>
<string lang="es"><![CDATA[¿Cuántos idiomas se hablan en Turkmenistán?]]></string>
<string lang="it"><![CDATA[Quante lingue sono parlate in Turkmenistan?]]></string>
<string lang="fr"><![CDATA[Combien de langues sont parlées au Turkménistan?]]></string>
<string lang="nl"><![CDATA[Hoeveel talen worden er gesproken in Turkmenistan?]]></string>
<string lang="ro"><![CDATA[Câte limbi sunt vorbite în Turkmenistan?]]></string>
<keywords lang="en"><![CDATA[languages, Turkmenistan]]></keywords>
<keywords lang="de"><![CDATA[Sprachen, Turkmenistan]]></keywords>
<keywords lang="es"><![CDATA[idiomas, Turkmenistán]]></keywords>
<keywords lang="it"><![CDATA[lingue, Turkmenistan]]></keywords>
<keywords lang="fr"><![CDATA[langues, Turkménistan]]></keywords>
<keywords lang="nl"><![CDATA[talen, Turkmenistan]]></keywords>
<keywords lang="ro"><![CDATA[limbi, Turkmenistan]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT COUNT(DISTINCT ?x) 
WHERE { 
        res:Turkmenistan dbo:language ?x . 
} 
]]>
</query>
<answers><answer><![CDATA[2]]></answer></answers></question>

<question id="127" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Sean Parnell is the governor of which U.S. state?]]></string>
<string lang="de"><![CDATA[Von welchem US-Bundesstaat ist Sean Parnell der Gouverneur?]]></string>
<string lang="es"><![CDATA[¿De qué estado americano es Sean Parnell el gobernador?]]></string>
<string lang="it"><![CDATA[Di quale stato americano Sean Parnell è governatore?]]></string>
<string lang="fr"><![CDATA[Quel est l'état américain dont Sean Parnelle st le gouverneur?]]></string>
<string lang="nl"><![CDATA[Sean Parnell is de gouverneur van welke staat van de Verenigde Staten?]]></string>
<string lang="ro"><![CDATA[Sean Parnell este guvernatorul cărui stat american?]]></string>
<keywords lang="en"><![CDATA[U.S. state, governor, Sean Parnell]]></keywords>
<keywords lang="de"><![CDATA[US-Bundesstaat, Gouverneur, Sean Parnell]]></keywords>
<keywords lang="es"><![CDATA[estado americano, gobernador, Sean Parnell]]></keywords>
<keywords lang="it"><![CDATA[stato degli Stati Uniti, governatore, Sean Parnell]]></keywords>
<keywords lang="fr"><![CDATA[état américain, Sean Parnell, gouverneur]]></keywords>
<keywords lang="nl"><![CDATA[staat van de Verenigde Staten, gouverneur, Sean Parnell]]></keywords>
<keywords lang="ro"><![CDATA[stat american, guvernator, Sean Parnell]]></keywords>
<query><![CDATA[ 
PREFIX yago: <http://dbpedia.org/class/yago/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type yago:StatesOfTheUnitedStates . 
        ?uri dbp:governor res:Sean_Parnell . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Alaska]]></answer></answers></question>

<question id="128" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all movies directed by Francis Ford Coppola.]]></string>
<string lang="de"><![CDATA[Gib mir alle Filme, bei denen Francis Ford Coppola Regie geführt hat.]]></string>
<string lang="es"><![CDATA[Dame todas las películas que haya dirigido Francis Ford Coppola.]]></string>
<string lang="it"><![CDATA[Dammi tutti i film diretti da Francis Ford Coppola.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les films dont Francis réalisés par Francis Ford Coppola.]]></string>
<string lang="nl"><![CDATA[Geef alle films die werden geregisseerd door Francis Ford Coppola.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate filmele regizate de Francis Ford Coppola.]]></string>
<keywords lang="en"><![CDATA[movie, direct, Francis Ford Coppola]]></keywords>
<keywords lang="de"><![CDATA[Film, Regie, Francis Ford Coppola]]></keywords>
<keywords lang="es"><![CDATA[película, director, Francis Ford Coppola]]></keywords>
<keywords lang="it"><![CDATA[film, dirigere, Francis Ford Coppola]]></keywords>
<keywords lang="fr"><![CDATA[film, directeur, Francis Ford Coppola]]></keywords>
<keywords lang="nl"><![CDATA[films, regisseur, Francis Ford Coppola]]></keywords>
<keywords lang="ro"><![CDATA[film, regizat, Francis Ford Coppola]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Film . 
        ?uri dbo:director res:Francis_Ford_Coppola . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Hammett_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Rain_People]]></answer><answer><![CDATA[http://dbpedia.org/resource/Twixt_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Conversation]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Godfather_Part_II]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Godfather_Part_III]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Terror_(1963_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Cotton_Club_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Rainmaker_(1997_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Apocalypse_Now]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dementia_13]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tucker:_The_Man_and_His_Dream]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tonight_for_Sure]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Bellboy_and_the_Playgirls]]></answer><answer><![CDATA[http://dbpedia.org/resource/Peggy_Sue_Got_Married]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bram_Stoker's_Dracula]]></answer><answer><![CDATA[http://dbpedia.org/resource/Battle_Beyond_the_Sun]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gardens_of_Stone]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rumble_Fish]]></answer><answer><![CDATA[http://dbpedia.org/resource/You're_a_Big_Boy_Now]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jack_(1996_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Godfather]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Godfather_(film_series)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Godfather_Saga]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tetro]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Outsiders_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Youth_Without_Youth_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/One_from_the_Heart]]></answer><answer><![CDATA[http://dbpedia.org/resource/Apocalypse_Now_Redux]]></answer><answer><![CDATA[http://dbpedia.org/resource/New_York_Stories]]></answer></answers></question>

<question id="129" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all actors starring in movies directed by William Shatner.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schauspieler von Filmen, in denen William Shatner Regie geführt hat.]]></string>
<string lang="es"><![CDATA[Dame todos los actores de películas dirigidas por William Shatner.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli attori che recitano in film diretti da William Shatner.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les acteurs qui ont joué dans des films réalisés par Williams Shatner.]]></string>
<string lang="nl"><![CDATA[Geef alle acteurs van films waar William Shatner de regie van voerde.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți actorii care joacă roluri principale în filme regizate de William Shatner.]]></string>
<keywords lang="en"><![CDATA[actor, starring, movie, direct, William Shatner]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, Film, Regie, William Shatner]]></keywords>
<keywords lang="es"><![CDATA[actor, película, director, William Shatner]]></keywords>
<keywords lang="it"><![CDATA[attore, recitare, film, diretto, William Shatner]]></keywords>
<keywords lang="fr"><![CDATA[acteur, film, réalisé, William Shatner]]></keywords>
<keywords lang="nl"><![CDATA[acteur, film, regisseur, William Shatner]]></keywords>
<keywords lang="ro"><![CDATA[actor, rol principal, film, regiza, William Shatner]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?x dbo:director res:William_Shatner . 
        ?x dbo:starring ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Leonard_Nimoy]]></answer><answer><![CDATA[http://dbpedia.org/resource/DeForest_Kelley]]></answer><answer><![CDATA[http://dbpedia.org/resource/James_Doohan]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nichelle_Nichols]]></answer><answer><![CDATA[http://dbpedia.org/resource/Walter_Koenig]]></answer><answer><![CDATA[http://dbpedia.org/resource/George_Takei]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dan_Gauthier]]></answer><answer><![CDATA[http://dbpedia.org/resource/Duane_Whitaker]]></answer><answer><![CDATA[http://dbpedia.org/resource/William_Shatner]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dick_Van_Patten]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rickey_Medlocke]]></answer><answer><![CDATA[http://dbpedia.org/resource/Amy_Acker]]></answer><answer><![CDATA[http://dbpedia.org/resource/John_Prosky]]></answer><answer><![CDATA[http://dbpedia.org/resource/Brenda_Bakke]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tom_Towles]]></answer><answer><![CDATA[http://dbpedia.org/resource/J.T._Colosa]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dan_Martin_(actor)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Chuck_Williams_(actor)]]></answer></answers></question>

<question id="13" onlydbo="true" answertype="boolean" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Are tree frogs a type of amphibian?]]></string>
<string lang="de"><![CDATA[Sind Laubfrösche Amphibien?]]></string>
<string lang="es"><![CDATA[¿Son las ranas verdes un tipo de anfibio?]]></string>
<string lang="it"><![CDATA[Le rane verdi sono un tipo di anfibio?]]></string>
<string lang="fr"><![CDATA[Sont les grenouilles arboricoles un type d'amphibiens?]]></string>
<string lang="nl"><![CDATA[Zijn boomkikkers een soort amfibie?]]></string>
<string lang="ro"><![CDATA[Sunt broaștele de copac un tip de amfibieni?]]></string>
<keywords lang="en"><![CDATA[tree frog, amphibian]]></keywords>
<keywords lang="de"><![CDATA[Laubfrosch, Amphibie]]></keywords>
<keywords lang="es"><![CDATA[rana verde, anfibio]]></keywords>
<keywords lang="it"><![CDATA[rana verde, anfibio]]></keywords>
<keywords lang="fr"><![CDATA[grenouilles arboricoles, amphibien]]></keywords>
<keywords lang="nl"><![CDATA[boomkikker, amfibie]]></keywords>
<keywords lang="ro"><![CDATA[broască de copac, amfibian]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Hylidae dbo:class res:Amphibian . 
} 
]]>
</query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question id="130" onlydbo="false" answertype="string" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[What is the birth name of Angela Merkel?]]></string>
<string lang="de"><![CDATA[Was ist der Geburtsname von Angela Merkel?]]></string>
<string lang="es"><![CDATA[¿Cuál es el nombre de soltera de Angela Merkel?]]></string>
<string lang="it"><![CDATA[Qual è il nome da nubile di Angela Merkel?]]></string>
<string lang="fr"><![CDATA[Quel est le nom de jeune fille d'Angela Merkel?]]></string>
<string lang="nl"><![CDATA[Wat is de meisjesnaam van Angela Merkel?]]></string>
<string lang="ro"><![CDATA[Care este numele de domnișoară al Angelei Merkel?]]></string>
<keywords lang="en"><![CDATA[birth name, Angela Merkel]]></keywords>
<keywords lang="de"><![CDATA[Geburtsname, Angela Merkel]]></keywords>
<keywords lang="es"><![CDATA[nombre de soltera, Angela Merkel]]></keywords>
<keywords lang="it"><![CDATA[nome da nubile, Angela Merkel]]></keywords>
<keywords lang="fr"><![CDATA[nom de jeune fille, Angela Merkel]]></keywords>
<keywords lang="nl"><![CDATA[meisjesnaam, Angela Merkel]]></keywords>
<keywords lang="ro"><![CDATA[nume de domnișoară, Angela Merkel]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?string 
WHERE { 
        res:Angela_Merkel dbp:birthName ?string . 
} 
]]>
</query>
<answers><answer><![CDATA[Angela Dorothea Kasner]]></answer></answers></question>

<question id="132" onlydbo="true" answertype="number" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[How often did Jane Fonda marry?]]></string>
<string lang="de"><![CDATA[Wie oft hat Jane Fonda geheiratet?]]></string>
<string lang="es"><![CDATA[¿Cuántas veces ha estado casada Jane Fonda?]]></string>
<string lang="it"><![CDATA[Quante volte si è sposata Jane Fonda?]]></string>
<string lang="fr"><![CDATA[Combien de fois s'est mariée Jane Fonda?]]></string>
<string lang="nl"><![CDATA[Hoe vaak is Jane Fonda getrouwd?]]></string>
<string lang="ro"><![CDATA[Cât de des s-a măritat Jane Fonda?]]></string>
<keywords lang="en"><![CDATA[Jane Fonda, marry, how often]]></keywords>
<keywords lang="de"><![CDATA[Jane Fonda, heiraten, wie oft]]></keywords>
<keywords lang="es"><![CDATA[Jane Fonda, casada, cuántas veces]]></keywords>
<keywords lang="it"><![CDATA[Jane Fonda, sposata, quante volte]]></keywords>
<keywords lang="fr"><![CDATA[Jane Fonda, marriages, nombre de fois]]></keywords>
<keywords lang="nl"><![CDATA[Jane Fonda, getrouwd, hoe vaak]]></keywords>
<keywords lang="ro"><![CDATA[Jane Fonda, mărita, cât de des]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT COUNT(DISTINCT ?uri) 
WHERE { 
        res:Jane_Fonda dbo:spouse ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[3]]></answer></answers></question>

