<?xml version="1.0" ?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="84" onlydbo="true">
<string lang="en"><![CDATA[Give me all movies with Tom Cruise.]]></string>
<string lang="de"><![CDATA[Gib mir alle Filme mit Tom Cruise.]]></string>
<string lang="es"><![CDATA[Dame todas las películas con Tom Cruise]]></string>
<string lang="it"><![CDATA[Dammi tutti i film con Tom Cruise.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les films avec Tom Cruise.]]></string>
<string lang="nl"><![CDATA[Noem alle films met Tom Cruise.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate filmele cu Tom Cruise.]]></string>
<keywords lang="en"><![CDATA[movie, Tom Cruise]]></keywords>
<keywords lang="de"><![CDATA[Film, Tom Cruise]]></keywords>
<keywords lang="es"><![CDATA[películas, Tom Cruise]]></keywords>
<keywords lang="it"><![CDATA[film, Tom Cruise]]></keywords>
<keywords lang="fr"><![CDATA[films, Tom Cruise]]></keywords>
<keywords lang="nl"><![CDATA[film, Tom Cruise]]></keywords>
<keywords lang="ro"><![CDATA[film, Tom Cruise]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Film.
        ?uri dbo:starring res:Tom_Cruise .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="85" onlydbo="true">
<string lang="en"><![CDATA[In which films did Julia Roberts as well as Richard Gere play?]]></string>
<string lang="de"><![CDATA[In welchen Filmen spielen sowohl Julia Roberts als auch Richard Gere mit?]]></string>
<string lang="es"><![CDATA[¿En qué películas actúan Julia Roberts y Richard Gere?]]></string>
<string lang="it"><![CDATA[In quali film recitano sia Julia Roberts che Richard Gere?]]></string>
<string lang="fr"><![CDATA[Dans quels films jouent Julia Roberts et Richard Gere?]]></string>
<string lang="nl"><![CDATA[In welke films speelden zowel Julia Roberts als Richard Gere?]]></string>
<string lang="ro"><![CDATA[În ce filme joacă Julia Roberts precum și Richard Gere?]]></string>
<keywords lang="en"><![CDATA[film, play, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="de"><![CDATA[Film, mitspielen, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="es"><![CDATA[película, actores, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="it"><![CDATA[film, recitare, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="fr"><![CDATA[films, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="nl"><![CDATA[film, speel, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="ro"><![CDATA[film, joacă, Julia Roberts, Richard Gere]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:starring res:Julia_Roberts .
        ?uri dbo:starring res:Richard_Gere.
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="86" onlydbo="false">
<string lang="en"><![CDATA[Give me all female given names.]]></string>
<string lang="de"><![CDATA[Gib mir alle weiblichen Vornamen.]]></string>
<string lang="es"><![CDATA[Dame todos los nombres propios femeninos.]]></string>
<string lang="it"><![CDATA[Dammi tutti i nomi propri femminili.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les prénoms féminins.]]></string>
<string lang="nl"><![CDATA[Geef me alle vrouwelijke voornaamen.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate prenumele feminine.]]></string>
<keywords lang="en"><![CDATA[female, given name]]></keywords>
<keywords lang="de"><![CDATA[weiblich, Vorname]]></keywords>
<keywords lang="es"><![CDATA[nombre propio, femenino]]></keywords>
<keywords lang="it"><![CDATA[nome proprio, femminile]]></keywords>
<keywords lang="fr"><![CDATA[prénom, féminin]]></keywords>
<keywords lang="nl"><![CDATA[vrouwelijk, voornaam]]></keywords>
<keywords lang="ro"><![CDATA[feminine, prenume]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:GivenName .
        ?uri dbo:gender res:Female .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="87" onlydbo="true">
<string lang="en"><![CDATA[Who wrote the book The Pillars of the Earth?]]></string>
<string lang="de"><![CDATA[Wer schrieb das Buch Die Säulen der Erde?]]></string>
<string lang="es"><![CDATA[¿Quen escribió el libro Los pilares de la Tierra?]]></string>
<string lang="it"><![CDATA[Chi ha scritto il libro I pilastri della Terra?]]></string>
<string lang="fr"><![CDATA[Qui a écrit le livre Les Piliers de la Terre?]]></string>
<string lang="nl"><![CDATA[Wie schreef het boek De Pilaren van de Aarde?]]></string>
<string lang="ro"><![CDATA[Cine e scris cartea Stâlpii Pământului?]]></string>
<keywords lang="en"><![CDATA[wrote, book, The pillars of the Earth]]></keywords>
<keywords lang="de"><![CDATA[schreiben, Buch, Die Säulen der Erde]]></keywords>
<keywords lang="es"><![CDATA[escritor, libro, Pilares de la Tierra]]></keywords>
<keywords lang="it"><![CDATA[scritto, libro, I pilastri della Terra]]></keywords>
<keywords lang="fr"><![CDATA[Les Piliers de la Terre, écrivain]]></keywords>
<keywords lang="nl"><![CDATA[auteur, De Pilaren van de Aarde]]></keywords>
<keywords lang="ro"><![CDATA[scrie, carte, Stâlpii Pământului]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:The_Pillars_of_the_Earth dbo:author ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="number" id="88" onlydbo="true">
<string lang="en"><![CDATA[How many films did Leonardo DiCaprio star in?]]></string>
<string lang="de"><![CDATA[In wievielen Filmen hat Leonardo DiCaprio mitgespielt?]]></string>
<string lang="es"><![CDATA[¿En cuántas películas ha actuado Leonardo DiCaprio?]]></string>
<string lang="it"><![CDATA[In quanti film ha recitato Leonardo DiCaprio?]]></string>
<string lang="fr"><![CDATA[Dans combien de films Leonard DiCaprio a-t-il joué?]]></string>
<string lang="nl"><![CDATA[In hoeveel films speelde Leonardo DiCaprio?]]></string>
<string lang="ro"><![CDATA[În câte filme a jucat Leonardo DiCaprio rol principal?]]></string>
<keywords lang="en"><![CDATA[film, star, Leonardo DiCaprio]]></keywords>
<keywords lang="de"><![CDATA[Film, mitspielen, Leonardo DiCaprio]]></keywords>
<keywords lang="es"><![CDATA[películas, cuántas, actúa, Leonardo DiCaprio]]></keywords>
<keywords lang="it"><![CDATA[film, recitare, Leonardo DiCaprio]]></keywords>
<keywords lang="fr"><![CDATA[combien, films, Leonard DiCaprio]]></keywords>
<keywords lang="nl"><![CDATA[film, speelt, Leonardo DiCaprio]]></keywords>
<keywords lang="ro"><![CDATA[film, rol principal, Leonardo DiCaprio]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?uri) 
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:starring res:Leonardo_DiCaprio . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="89" onlydbo="true">
<string lang="en"><![CDATA[Give me all soccer clubs in the Premier League.]]></string>
<string lang="de"><![CDATA[Gib mir alle Vereine in der Premier League.]]></string>
<string lang="es"><![CDATA[Dame todos los clubs de la Premier League.]]></string>
<string lang="it"><![CDATA[Dammi tutti i club calcistici nella Premier League.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les équipes de la Premier League.]]></string>
<string lang="nl"><![CDATA[Noem alle clubs uit de Premier League.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate cluburile de fotbal din Premier League]]></string>
<keywords lang="en"><![CDATA[Premier League, soccer club]]></keywords>
<keywords lang="de"><![CDATA[Premier League, Verein]]></keywords>
<keywords lang="es"><![CDATA[Premier League, club]]></keywords>
<keywords lang="it"><![CDATA[Premier League, club calcistici]]></keywords>
<keywords lang="fr"><![CDATA[équipes, Premier League]]></keywords>
<keywords lang="nl"><![CDATA[club, Premier League]]></keywords>
<keywords lang="ro"><![CDATA[Premier League, club de fotbal]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:SoccerClub .
        ?uri dbo:league res:Premier_League . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="9" onlydbo="false">
<string lang="en"><![CDATA[In which U.S. state is Mount McKinley located?]]></string>
<string lang="de"><![CDATA[In welchem US-Bundesstaat befindet sich der Mount McKinley?]]></string>
<string lang="es"><![CDATA[¿En qué estado de los estados unidos se encuentra el monte McKinley?]]></string>
<string lang="it"><![CDATA[In quale stato degli Stati Uniti si trova il Monte McKinley?]]></string>
<string lang="fr"><![CDATA[Dans quel état des Etats-Unis d'Amérique se trouve le mont McKinley?]]></string>
<string lang="nl"><![CDATA[In welke deelstaat van de Verenigde Staten is Mount McKinley gelegen?]]></string>
<string lang="ro"><![CDATA[În ce stat american se află muntele McKinley?]]></string>
<keywords lang="en"><![CDATA[U.S. state, located, Mount McKinley]]></keywords>
<keywords lang="de"><![CDATA[US-Staat, befinden, Mount McKinley]]></keywords>
<keywords lang="es"><![CDATA[estado, estados unidos de américa, encuentra, monte McKinley]]></keywords>
<keywords lang="it"><![CDATA[Stati Uniti d'America, trova, Mount McKinley]]></keywords>
<keywords lang="fr"><![CDATA[états, Etats-Unis d'Amérique, trouve, mont McKinley]]></keywords>
<keywords lang="nl"><![CDATA[deelstaat, Verenigde Staten, gelegen, Mount McKinley]]></keywords>
<keywords lang="ro"><![CDATA[stat american, aflat, muntele McKinley]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type yago:StatesOfTheUnitedStates .
        res:Mount_McKinley dbo:locatedInArea ?uri . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="date" id="90" onlydbo="true">
<string lang="en"><![CDATA[When was Capcom founded?]]></string>
<string lang="de"><![CDATA[Wann wurde Capcom gegründet?]]></string>
<string lang="es"><![CDATA[¿Cúando se fundó Capcom?]]></string>
<string lang="it"><![CDATA[Quando è stata fondata Capcom?]]></string>
<string lang="fr"><![CDATA[Quand a été fondé Capcom?]]></string>
<string lang="nl"><![CDATA[Wanneer werd Capcom opgericht?]]></string>
<string lang="ro"><![CDATA[Când a fost fondat Capcom?]]></string>
<keywords lang="en"><![CDATA[Capcom, founded]]></keywords>
<keywords lang="de"><![CDATA[Capcom, gründen]]></keywords>
<keywords lang="es"><![CDATA[Capcom, fundada]]></keywords>
<keywords lang="it"><![CDATA[Capcom, fondata]]></keywords>
<keywords lang="fr"><![CDATA[fondé, Capcom]]></keywords>
<keywords lang="nl"><![CDATA[Capcom, opgericht]]></keywords>
<keywords lang="ro"><![CDATA[Capcom, fondat]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE {
        res:Capcom dbo:foundingDate ?date .
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="91" onlydbo="true">
<string lang="en"><![CDATA[Which organizations were founded in 1930?]]></string>
<string lang="de"><![CDATA[Welche Unternehmen wurden 1930 gegründet?]]></string>
<string lang="es"><![CDATA[¿Qué empresas fueron fundadas en 1930?]]></string>
<string lang="it"><![CDATA[Quali aziende sono state fondate nel 1930?]]></string>
<string lang="fr"><![CDATA[Quels organisations ont été fondées en 1930?]]></string>
<string lang="nl"><![CDATA[Welke organisaties werden opgericht in 1930?]]></string>
<string lang="ro"><![CDATA[Ce organizații au fost fondate în 1930?]]></string>
<keywords lang="en"><![CDATA[organization, founded, 1930]]></keywords>
<keywords lang="de"><![CDATA[Unternehmen, gründen, 1930]]></keywords>
<keywords lang="es"><![CDATA[empresas, fundadas, 1930]]></keywords>
<keywords lang="it"><![CDATA[azienda, fondata, 1930]]></keywords>
<keywords lang="fr"><![CDATA[organisations, fondées, 1930]]></keywords>
<keywords lang="nl"><![CDATA[organisatie, opgericht, 1930]]></keywords>
<keywords lang="ro"><![CDATA[organizație, fondat, 1930]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Organisation .
      { ?uri dbo:formationYear ?date . }
      UNION 
      { ?uri dbo:foundingYear ?date. }
      FILTER regex(?date,'^1930') . 
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="92" onlydbo="true">
<string lang="en"><![CDATA[What is the highest mountain?]]></string>
<string lang="de"><![CDATA[Was ist der höchste Berg?]]></string>
<string lang="es"><![CDATA[¿Cuál es la montaña más alta?]]></string>
<string lang="it"><![CDATA[Qual è la montagna più alta?]]></string>
<string lang="fr"><![CDATA[Quelle est la montagne la plus haute?]]></string>
<string lang="nl"><![CDATA[Wat is de hoogste berg?]]></string>
<string lang="ro"><![CDATA[Care este cel mai înalt munte?]]></string>
<keywords lang="en"><![CDATA[mountain, highest]]></keywords>
<keywords lang="de"><![CDATA[höchster, Berg]]></keywords>
<keywords lang="es"><![CDATA[montaña, más alta]]></keywords>
<keywords lang="it"><![CDATA[montagna, più alta]]></keywords>
<keywords lang="fr"><![CDATA[montagne, la plus haute]]></keywords>
<keywords lang="nl"><![CDATA[hoogste berg]]></keywords>
<keywords lang="ro"><![CDATA[munte, cel mai înalt]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Mountain  .
        ?uri dbo:elevation ?elevation .
} 
ORDER BY DESC(?elevation) 
OFFSET 0 LIMIT 1
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="boolean" id="93" onlydbo="true">
<string lang="en"><![CDATA[Was Natalie Portman born in the United States?]]></string>
<string lang="de"><![CDATA[Wurde Natalie Portman in den Vereinigten Staaten geboren?]]></string>
<string lang="es"><![CDATA[¿Nació Natalie Portman en los estados unidos de américa?]]></string>
<string lang="it"><![CDATA[Natalie Portman è nata negli Stati Uniti?]]></string>
<string lang="fr"><![CDATA[Natalie Portman est-elle née aux Etats-Unis?]]></string>
<string lang="nl"><![CDATA[Werd Natalie Portman geboren in de Verenigde Staten?]]></string>
<string lang="ro"><![CDATA[A fost Natalie Portman născută în Statele Unite?]]></string>
<keywords lang="en"><![CDATA[Natalie Portman, born, United States]]></keywords>
<keywords lang="de"><![CDATA[Natalie Portman, geboren, Vereinigte Staaten]]></keywords>
<keywords lang="es"><![CDATA[Natalie Portman]]></keywords>
<keywords lang="it"><![CDATA[Natalie Portman, nata, Stati Uniti]]></keywords>
<keywords lang="fr"><![CDATA[Natalie Portman, née, Etats-Unis]]></keywords>
<keywords lang="nl"><![CDATA[Natalie Portman, geboren, Verenigde Staten]]></keywords>
<keywords lang="ro"><![CDATA[Natalie Portman, născută, Statele Unite]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE { 
        { res:Natalie_Portman dbo:birthPlace res:United_States . }
        UNION
        { res:Natalie_Portman dbo:birthPlace ?city .
          ?city dbo:country res:United_States . }
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="211" onlydbo="true">
<string lang="en"><![CDATA[Give me all animals that are extinct.]]></string>
<string lang="de"><![CDATA[Gib mir alle ausgestorbenen Tierarten.]]></string>
<string lang="es"><![CDATA[Dame todos los animales extintos]]></string>
<string lang="it"><![CDATA[Dammi tutti gli animali estinti.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les animaux éteints.]]></string>
<string lang="nl"><![CDATA[Toon alle uitgestorven dieren.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate animalele dispărute.]]></string>
<keywords lang="en"><![CDATA[animal, extinct]]></keywords>
<keywords lang="de"><![CDATA[Tierart, ausgestorben]]></keywords>
<keywords lang="es"><![CDATA[animales extintos]]></keywords>
<keywords lang="it"><![CDATA[animali estinti]]></keywords>
<keywords lang="fr"><![CDATA[animaux éteints]]></keywords>
<keywords lang="nl"><![CDATA[dieren, uitgestorven]]></keywords>
<keywords lang="ro"><![CDATA[animal, dispărut]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Animal .
        ?uri dbo:conservationStatus 'EX' .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="boolean" id="223" onlydbo="true">
<string lang="en"><![CDATA[Does Abraham Lincoln's death place have a website?]]></string>
<string lang="de"><![CDATA[Hat Abraham Lincolns Sterbeort eine Webseite?]]></string>
<string lang="es"><![CDATA[¿Tiene el lugar de nacimiento de Abraham Lincol una página web?]]></string>
<string lang="it"><![CDATA[Il luogo di morte di Abraham Lincoln ha un sito web?]]></string>
<string lang="fr"><![CDATA[A le lieu de décès d'Abraham Lincoln une page Web?]]></string>
<string lang="nl"><![CDATA[Heeft de stad waarin Abraham Lincoln is overleden een website?]]></string>
<string lang="ro"><![CDATA[Locul morții lui Abraham Lincoln are un website?]]></string>
<keywords lang="en"><![CDATA[Abraham Lincoln, death place, website]]></keywords>
<keywords lang="de"><![CDATA[Abraham Lincoln, Sterbeort, Webseite]]></keywords>
<keywords lang="es"><![CDATA[Abraham Lincoln, lugar de nacimiento, página web]]></keywords>
<keywords lang="it"><![CDATA[Abraham Lincoln, luogo di morte, website]]></keywords>
<keywords lang="fr"><![CDATA[Abraham Lincoln, lieu de décès, page Web]]></keywords>
<keywords lang="nl"><![CDATA[Abraham Lincoln, stad, gestorven, website]]></keywords>
<keywords lang="ro"><![CDATA[locul morții, Abraham Lincoln, website]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE {
        res:Abraham_Lincoln dbo:deathPlace ?p .
        ?p dbp:website ?w .
        
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="uri" id="246" onlydbo="true">
<string lang="en"><![CDATA[Which rockets were launched from Baikonur?]]></string>
<string lang="de"><![CDATA[Welche Raketen sind von Baikonur gestartet?]]></string>
<string lang="es"><![CDATA[¿Qué cohetes han sido lanzados desde Baionur?]]></string>
<string lang="it"><![CDATA[Quali missili furono lanciati da Baikonur?]]></string>
<string lang="fr"><![CDATA[Quelles fusées ont été lancées de Baikonur?]]></string>
<string lang="nl"><![CDATA[Welke raketten werden gestart vanuit Baikonur?]]></string>
<string lang="ro"><![CDATA[Ce rachete au fost lansate din Baikonur?]]></string>
<keywords lang="en"><![CDATA[rockets, launched, Baikonur]]></keywords>
<keywords lang="de"><![CDATA[Raketen, Start, Baikonur]]></keywords>
<keywords lang="es"><![CDATA[cohetes, salida, Baikonur]]></keywords>
<keywords lang="it"><![CDATA[missili, lanciati, Baikonur]]></keywords>
<keywords lang="fr"><![CDATA[fusées, lanchement, Baikonur]]></keywords>
<keywords lang="nl"><![CDATA[raketten, gestart, Baikonur]]></keywords>
<keywords lang="ro"><![CDATA[rachete, lansat, Baikonur]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Rocket .
        ?uri dbo:launchSite res:Baikonur_Cosmodrome .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="248" onlydbo="true">
<string lang="en"><![CDATA[What does IYCM stand for?]]></string>
<string lang="de"><![CDATA[Wofür steht IYCM?]]></string>
<string lang="es"><![CDATA[¿Qué abrevia IYCM?]]></string>
<string lang="it"><![CDATA[Che cosa significa IYCM?]]></string>
<string lang="fr"><![CDATA[Que veut dire IYCM?]]></string>
<string lang="nl"><![CDATA[Waarvoor staat de afkorting IYCM?]]></string>
<string lang="ro"><![CDATA[Ce înseamnă IYCM?]]></string>
<keywords lang="en"><![CDATA[IYCM, stand for]]></keywords>
<keywords lang="de"><![CDATA[IYCM, stehen für]]></keywords>
<keywords lang="es"><![CDATA[IYCM, abreviación]]></keywords>
<keywords lang="it"><![CDATA[IYCM, significato]]></keywords>
<keywords lang="fr"><![CDATA[IYCM, signification]]></keywords>
<keywords lang="nl"><![CDATA[IYCM, staat voor]]></keywords>
<keywords lang="ro"><![CDATA[IYCM, înseamnă]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:abbreviation 'IYCM' .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="251" onlydbo="false">
<string lang="en"><![CDATA[Which companies have more than 1 million employees?]]></string>
<string lang="de"><![CDATA[Welche Unternehmen haben mehr als 1 Millionen Angestellte?]]></string>
<string lang="es"><![CDATA[¿Qué empresas tienen mas de 1 millón de empleados?]]></string>
<string lang="it"><![CDATA[Quali aziende hanno più di 1 milione di dipendenti?]]></string>
<string lang="fr"><![CDATA[Quelles companies ont plus d'un million d'employés?]]></string>
<string lang="nl"><![CDATA[Welke bedrijven hebben meer dan 1 miljoen werknemers?]]></string>
<string lang="ro"><![CDATA[Ce companii au mai mult de 1 milion de angajați?]]></string>
<keywords lang="en"><![CDATA[company, more than 1 million, employees]]></keywords>
<keywords lang="de"><![CDATA[Unternehmen, mehr als 1 Millionen, Angestellte]]></keywords>
<keywords lang="es"><![CDATA[empresas, mas de un millón, empleados]]></keywords>
<keywords lang="it"><![CDATA[aziende, più di 1 milione, dipendenti]]></keywords>
<keywords lang="fr"><![CDATA[companies, plus d'un million, employés]]></keywords>
<keywords lang="nl"><![CDATA[bedrijf, meer dan 1 miljoen, werknemers]]></keywords>
<keywords lang="ro"><![CDATA[companie, mai mult de 1 milion, angajați]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
         ?uri rdf:type dbo:Company .
       { ?uri dbo:numberOfEmployees ?n . }
       UNION
       { ?uri dbp:numEmployees ?n . }
       FILTER ( ?n > 1000000 ) } 
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="252" onlydbo="true">
<string lang="en"><![CDATA[Give all swimmers that were born in Moscow.]]></string>
<string lang="de"><![CDATA[Zeig mir alle Schwimmer, die in Moskau geboren wurden.]]></string>
<string lang="es"><![CDATA[Dame todos los nadadores nacidos en Moscú]]></string>
<string lang="it"><![CDATA[Dammi tutti i nuotatori che sono nati a Mosca.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les nageurs nés à Moscou.]]></string>
<string lang="nl"><![CDATA[Toen alle zwemmers die werden geboren in Moskou.]]></string>
<string lang="ro"><![CDATA[Numește toți înotătorii născuți în Moscova.]]></string>
<keywords lang="en"><![CDATA[swimmer, born, Moscow]]></keywords>
<keywords lang="de"><![CDATA[Schwimmer, geboren in, Moskau]]></keywords>
<keywords lang="es"><![CDATA[nadadores, nacidos, Moscú]]></keywords>
<keywords lang="it"><![CDATA[nuotatori, nati, Mosca]]></keywords>
<keywords lang="fr"><![CDATA[nageurs, nés, Moscou]]></keywords>
<keywords lang="nl"><![CDATA[zwemmers, geboren, Moskou]]></keywords>
<keywords lang="ro"><![CDATA[înotători, născuți, Moscova]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
         ?uri rdf:type dbo:Swimmer .
         ?uri dbo:birthPlace res:Moscow .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="253" onlydbo="false">
<string lang="en"><![CDATA[Who was called Rodzilla?]]></string>
<string lang="de"><![CDATA[Wer wurde Rodzilla genannt?]]></string>
<string lang="es"><![CDATA[¿Quien se llamaba Rodzilla?]]></string>
<string lang="it"><![CDATA[Chi era chiamato Rodzilla?]]></string>
<string lang="fr"><![CDATA[Qui était appelé Rodzilla?]]></string>
<string lang="nl"><![CDATA[Wie werd Rodzilla genoemd?]]></string>
<string lang="ro"><![CDATA[Cine a fost numit Rodzilla?]]></string>
<keywords lang="en"><![CDATA[called, Rodzilla]]></keywords>
<keywords lang="de"><![CDATA[genannt, Rodzilla]]></keywords>
<keywords lang="es"><![CDATA[llamaba, Rodzilla]]></keywords>
<keywords lang="it"><![CDATA[chiamato, Rodzilla]]></keywords>
<keywords lang="fr"><![CDATA[appelé, Rodzilla]]></keywords>
<keywords lang="nl"><![CDATA[genoemd, Rodzilla]]></keywords>
<keywords lang="ro"><![CDATA[numit, Rodzilla]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE { 
         ?uri dbp:nickname "Rodzilla"@en .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="254" onlydbo="true">
<string lang="en"><![CDATA[Show me the book that Muhammad Ali wrote.]]></string>
<string lang="de"><![CDATA[Zeig mir das Buch, das Muhammad Ali geschrieben hat.]]></string>
<string lang="es"><![CDATA[Muéstrame el libro escrito por Muhammad Ali.]]></string>
<string lang="it"><![CDATA[Mostrami il libro scritto da Muhammad Ali.]]></string>
<string lang="fr"><![CDATA[Donne-moi le livre écrit par Muhammad Ali.]]></string>
<string lang="nl"><![CDATA[Toen het boek dat Muhammad Ali heeft geschreven.]]></string>
<string lang="ro"><![CDATA[Arată-mi cartea pe care a scris-o Muhammad Ali.]]></string>
<keywords lang="en"><![CDATA[book, wrote, Muhammad Ali]]></keywords>
<keywords lang="de"><![CDATA[Buch, geschrieben, Muhammad Ali]]></keywords>
<keywords lang="es"><![CDATA[libro, autor, Muhammad Ali]]></keywords>
<keywords lang="it"><![CDATA[libro, autore, Muhammad Ali]]></keywords>
<keywords lang="fr"><![CDATA[livre, par Muhammad Ali]]></keywords>
<keywords lang="nl"><![CDATA[boek, geschreven, Muhammad Ali]]></keywords>
<keywords lang="ro"><![CDATA[carte, scris, Muhammad Ali]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
         ?uri rdf:type dbo:Book . 
         ?uri dbo:author res:Muhammad_Ali . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="255" onlydbo="true">
<string lang="en"><![CDATA[How many museums does Paris have?]]></string>
<string lang="de"><![CDATA[Wieviele Museen hat Paris?]]></string>
<string lang="es"><![CDATA[¿Cuantos museos hay en Paris?]]></string>
<string lang="it"><![CDATA[Quanti musei ha Parigi?]]></string>
<string lang="fr"><![CDATA[Combien de musées y a-t-il à Paris?]]></string>
<string lang="nl"><![CDATA[Hoeveel museas heeft Parijs?]]></string>
<string lang="ro"><![CDATA[Câte muzee are Parisul?]]></string>
<keywords lang="en"><![CDATA[how many, museum, Paris]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Museen, Paris]]></keywords>
<keywords lang="es"><![CDATA[cuantos, museos, Paris]]></keywords>
<keywords lang="it"><![CDATA[quanti, musei, Parigi]]></keywords>
<keywords lang="fr"><![CDATA[nombre de musées, Paris]]></keywords>
<keywords lang="nl"><![CDATA[hoeveel, museas, Parijs]]></keywords>
<keywords lang="ro"><![CDATA[câte, muzee, Paris]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
         ?uri rdf:type dbo:Museum . 
         ?uri dbo:location res:Paris . 
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="256" onlydbo="true">
<string lang="en"><![CDATA[Which city has the most inhabitants?]]></string>
<string lang="de"><![CDATA[Welche Stadt hat die meisten Einwohner?]]></string>
<string lang="es"><![CDATA[¿Que ciudad tiene la mayor población?]]></string>
<string lang="it"><![CDATA[Quale città ha il maggior numero di abitanti?]]></string>
<string lang="fr"><![CDATA[Quel ville a le plus grand nombre d'habitants?]]></string>
<string lang="nl"><![CDATA[Welke stad heeft de meeste inwoners?]]></string>
<string lang="ro"><![CDATA[Care oraș are cei mai mulți locuitori?]]></string>
<keywords lang="en"><![CDATA[city, the most inhabitants]]></keywords>
<keywords lang="de"><![CDATA[Stadt, meisten Einwohner]]></keywords>
<keywords lang="es"><![CDATA[ciudad, mayor población]]></keywords>
<keywords lang="it"><![CDATA[città, maggior numero di abitanti]]></keywords>
<keywords lang="fr"><![CDATA[ville, plus grand nombre d'habitants]]></keywords>
<keywords lang="nl"><![CDATA[stad, meeste inwoners]]></keywords>
<keywords lang="ro"><![CDATA[oraș, cei mai mulți locuitori]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
         ?uri rdf:type dbo:City . 
         ?uri dbo:populationTotal ?pop . 
}
ORDER BY DESC(?pop)
OFFSET 0 LIMIT 1
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="257" onlydbo="true">
<string lang="en"><![CDATA[Which city has the least inhabitants?]]></string>
<string lang="de"><![CDATA[Welche Stadt hat die wenigsten Einwohner?]]></string>
<string lang="es"><![CDATA[¿Que ciudad tiene la menor población?]]></string>
<string lang="it"><![CDATA[Quale città ha il minor numero di abitanti?]]></string>
<string lang="fr"><![CDATA[Quelle ville a le plus petit nombre d'habitants?]]></string>
<string lang="nl"><![CDATA[Welke stad heeft de minste inwoners?]]></string>
<string lang="ro"><![CDATA[Care oraș are cei mai puțini locuitori?]]></string>
<keywords lang="en"><![CDATA[city, the least inhabitants]]></keywords>
<keywords lang="de"><![CDATA[Stadt, wenigsten Einwohner]]></keywords>
<keywords lang="es"><![CDATA[ciudad, menor población]]></keywords>
<keywords lang="it"><![CDATA[città, minor numero di abitanti]]></keywords>
<keywords lang="fr"><![CDATA[ville, plus petit nombre d'habitants]]></keywords>
<keywords lang="nl"><![CDATA[stad, minste inwoners]]></keywords>
<keywords lang="ro"><![CDATA[oraș, cei mai puțini locuitori]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
         ?uri rdf:type dbo:City . 
         ?uri dbo:populationTotal ?pop . 
}
ORDER BY ASC(?pop)
OFFSET 0 LIMIT 1
]]></query>
</question>

