<?xml version="1.0" ?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="279" onlydbo="false">
<string lang="en"><![CDATA[What airlines are part of the SkyTeam alliance?]]></string>
<string lang="de"><![CDATA[Welche Fluggesellschaften sind Teil der SkyTeam-Allianz?]]></string>
<string lang="es"><![CDATA[¿Qué aerolíneas forman parte del la alianza SkyTeam?]]></string>
<string lang="it"><![CDATA[Quali compagnie aeree fanno parte dell'alleanza SkyTeam?]]></string>
<string lang="fr"><![CDATA[Quels companies aériennes sont membre de l'alliance SkyTeam?]]></string>
<string lang="nl"><![CDATA[Welke luchtvaartmaatschappijen zijn lid van de SkyTeam alliantie?]]></string>
<string lang="ro"><![CDATA[Ce companii aeriene fac parte din alianța SkyTeam?]]></string>
<keywords lang="en"><![CDATA[airlines, part of, SkyTeam alliance]]></keywords>
<keywords lang="de"><![CDATA[Fluggesellschaften, Teil von, SkyTeam-Allianz]]></keywords>
<keywords lang="es"><![CDATA[aerolíneas, alianza SkyTeam]]></keywords>
<keywords lang="it"><![CDATA[compagnie aeree, alleanza SkyTeam]]></keywords>
<keywords lang="fr"><![CDATA[alliance SkyTeam, companies aériennes, membre]]></keywords>
<keywords lang="nl"><![CDATA[luchtvaartmaatschappijen, lid van, SkyTeam alliantie]]></keywords>
<keywords lang="ro"><![CDATA[companii aeriene, parte din, alianța SkyTeam]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
          ?uri rdf:type dbo:Airline .
        { ?uri dbp:alliance res:SkyTeam . }
        UNION
        { ?uri dbo:Alliance res:SkyTeam . }
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="number" id="280" onlydbo="true">
<string lang="en"><![CDATA[What is the total population of Melbourne, Florida?]]></string>
<string lang="de"><![CDATA[Was ist die Gesamteinwohnerzahl von Melbourne, Florida?]]></string>
<string lang="es"><![CDATA[¿Cuál es la población total de Melbourne, Florida?]]></string>
<string lang="it"><![CDATA[Qual è la popolazione totale di Melbourne, Florida?]]></string>
<string lang="fr"><![CDATA[Quelle est la population totale de Melbourne, Floride?]]></string>
<string lang="nl"><![CDATA[Wat is de bevolking van Melbourne, Florida?]]></string>
<string lang="ro"><![CDATA[Care este populația totală a Melbourne, Florida?]]></string>
<keywords lang="en"><![CDATA[total population, Melbourne Florida]]></keywords>
<keywords lang="de"><![CDATA[Gesamteinwohnerzahl, Melbourne Florida]]></keywords>
<keywords lang="es"><![CDATA[población total, Melbourne Florida]]></keywords>
<keywords lang="it"><![CDATA[popolazione totale, Melbourne, Florida]]></keywords>
<keywords lang="fr"><![CDATA[population totale, Melbourne, Floride]]></keywords>
<keywords lang="nl"><![CDATA[bevolking, Melbourne Florida]]></keywords>
<keywords lang="ro"><![CDATA[populația totală, Melbourne Florida]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT ?uri 
WHERE { 
        <http://dbpedia.org/resource/Melbourne,_Florida> dbo:populationTotal ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="281" onlydbo="true">
<string lang="en"><![CDATA[Which airports does Air China serve?]]></string>
<string lang="de"><![CDATA[Welche Flughäfen fliegt Air China an?]]></string>
<string lang="es"><![CDATA[¿Qué aeropuertos sirve Air China?]]></string>
<string lang="it"><![CDATA[Quali aeroporti sono serviti da Air China?]]></string>
<string lang="fr"><![CDATA[Quels sont les aéroports servis par Air Chine?]]></string>
<string lang="nl"><![CDATA[Naar welke luchthavens vliegt Air China?]]></string>
<string lang="ro"><![CDATA[Ce aeroporturi deservește Air China?]]></string>
<keywords lang="en"><![CDATA[airports, Air China]]></keywords>
<keywords lang="de"><![CDATA[Flughäfen, anfliegen, Air China]]></keywords>
<keywords lang="es"><![CDATA[aeropuertos, Air China]]></keywords>
<keywords lang="it"><![CDATA[aeroporti, Air China]]></keywords>
<keywords lang="fr"><![CDATA[Air Chine, aéroports]]></keywords>
<keywords lang="nl"><![CDATA[luchthavens, Air China]]></keywords>
<keywords lang="ro"><![CDATA[aeroporturi, Air China]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri 
WHERE {
        res:Air_China dbo:targetAirport ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="date" id="282" onlydbo="true">
<string lang="en"><![CDATA[In which year was Rachel Stevens born?]]></string>
<string lang="de"><![CDATA[In welchem Jahr wurde Rachel Stevens geboren?]]></string>
<string lang="es"><![CDATA[¿En que año nació Rachel Stevens?]]></string>
<string lang="it"><![CDATA[In quale anno è nata Rachel Stevens?]]></string>
<string lang="fr"><![CDATA[Quand est née Rachel Stevens?]]></string>
<string lang="nl"><![CDATA[In welk jaar word Rachel Stevens geboren?]]></string>
<string lang="ro"><![CDATA[În ce an s-a născut Rachel Stevens?]]></string>
<keywords lang="en"><![CDATA[year, born, Rachel Stevens]]></keywords>
<keywords lang="de"><![CDATA[Jahr, geboren, Rachel Stevens]]></keywords>
<keywords lang="es"><![CDATA[año, nació, Rachel Stevens]]></keywords>
<keywords lang="it"><![CDATA[anno nascita, Rachel Stevens]]></keywords>
<keywords lang="fr"><![CDATA[année de naissance, Rachel Stevens]]></keywords>
<keywords lang="nl"><![CDATA[jaar, geboren, Rachel Stevens]]></keywords>
<keywords lang="ro"><![CDATA[an, născut, Rachel Stevens]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri 
WHERE {
        res:Rachel_Stevens dbo:birthYear ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="283" onlydbo="true">
<string lang="en"><![CDATA[Where was JFK assassinated?]]></string>
<string lang="de"><![CDATA[Wo wurde JFK ermordet?]]></string>
<string lang="es"><![CDATA[¿Dónde fue JFK asesinado?]]></string>
<string lang="it"><![CDATA[Dove è stato assassinato JFK?]]></string>
<string lang="fr"><![CDATA[A été tué John Kennedy?]]></string>
<string lang="nl"><![CDATA[Waar word JFK vermoord?]]></string>
<string lang="ro"><![CDATA[Unde a fost asasinat JFK?]]></string>
<keywords lang="en"><![CDATA[JFK, assassinated]]></keywords>
<keywords lang="de"><![CDATA[JFK, ermordet]]></keywords>
<keywords lang="es"><![CDATA[JFK, asesinado]]></keywords>
<keywords lang="it"><![CDATA[JFK, assassinato]]></keywords>
<keywords lang="fr"><![CDATA[John Kennedy, assassinat]]></keywords>
<keywords lang="nl"><![CDATA[JFK, vermoord]]></keywords>
<keywords lang="ro"><![CDATA[JFK, asasinat]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri 
WHERE {
        res:John_F._Kennedy dbo:deathPlace ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="number" id="284" onlydbo="true">
<string lang="en"><![CDATA[How many politicians graduated from Columbia University?]]></string>
<string lang="de"><![CDATA[Wieviele Politiker haben einen Abschluss von der Columbia University?]]></string>
<string lang="es"><![CDATA[¿Cuántos políticos se han graduado en la universidad de Columbia?]]></string>
<string lang="it"><![CDATA[Quanti politici si sono laureati alla Columbia University?]]></string>
<string lang="fr"><![CDATA[Combien d'hommes politiques ont étudié à la Columbia University?]]></string>
<string lang="nl"><![CDATA[Hoeveel politici zijn aan de Columbia University afgestudeerd?]]></string>
<string lang="ro"><![CDATA[Câți politicieni au absolvit la Universitatea Columbia?]]></string>
<keywords lang="en"><![CDATA[how many, politicians, graduated, Columbia University]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Politiker, Abschluss, Columbia University]]></keywords>
<keywords lang="es"><![CDATA[cuántos, políticos, graduados, universidad de Columbia]]></keywords>
<keywords lang="it"><![CDATA[quanti, politici, laureati, Columbia University]]></keywords>
<keywords lang="fr"><![CDATA[nombre, hommes politiques, étudier, Columbia University]]></keywords>
<keywords lang="nl"><![CDATA[hoeveel, politici afgestudeert aan, Columbia University]]></keywords>
<keywords lang="ro"><![CDATA[câți, politicieni, absolvit, Universitatea Columbia?]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT COUNT(?uri) 
WHERE {
        ?uri dbo:profession res:Politician .
        ?uri dbo:almaMater res:Columbia_University .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="285" onlydbo="true">
<string lang="en"><![CDATA[Which scientist is known for the Manhattan Project and the Nobel Peace Prize?]]></string>
<string lang="de"><![CDATA[Welcher Wissenschaftler ist bekannt für das Manhattan-Projekt und den Friedensnobelpreis?]]></string>
<string lang="es"><![CDATA[¿Qué científicos son conocidos por el proyecto Manhattan y el premio Nobel de la Paz?]]></string>
<string lang="it"><![CDATA[Quale scienziato è conosciuto per il progetto Manhattan e per il premio Nobel per la pace?]]></string>
<string lang="fr"><![CDATA[Quel chercheur est connu pour le projet Manhattan et le prix Nobel de la paix?]]></string>
<string lang="nl"><![CDATA[Welke wetenschaper staat bekend om het Manhattan Project en de Nobelprijs voor de Vrede?]]></string>
<string lang="ro"><![CDATA[Care om de știință este cunoscut pentru proiectul Manhattan și pentru premiul Nobel pentru pace?]]></string>
<keywords lang="en"><![CDATA[scientist, known for, Manhattan Project, Nobel Peace Prize]]></keywords>
<keywords lang="de"><![CDATA[Wissenschaftler, bekannt für, Manhattan-Projekt, Friedensnobelpreis]]></keywords>
<keywords lang="es"><![CDATA[científico, conocidos, proyecto Manhattan, premio Nobel de la Paz]]></keywords>
<keywords lang="it"><![CDATA[scienziato, conosciuto, progetto Manhattan, premio Nobel per la pace]]></keywords>
<keywords lang="fr"><![CDATA[chercheur, projet Manhattan, prix Nobel de la paix]]></keywords>
<keywords lang="nl"><![CDATA[wetenschaper, bekend om, Manhattan Project, Nobelprijs voor de Vrede]]></keywords>
<keywords lang="ro"><![CDATA[om de știință, cunoscut pentru, proiect Manhattan, premiul Nobel pentru pace]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:knownFor res:Manhattan_Project .
        ?uri rdf:type dbo:Scientist .
        ?uri dbo:knownFor res:Nobel_Peace_Prize .
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="286" onlydbo="false">
<string lang="en"><![CDATA[What is the highest volcano in Africa?]]></string>
<string lang="de"><![CDATA[Was ist der höchste Vulkan in Afrika?]]></string>
<string lang="es"><![CDATA[¿Cuál es el volcán mas alto en África?]]></string>
<string lang="it"><![CDATA[Qual è il vulcano più alto in Africa?]]></string>
<string lang="fr"><![CDATA[Quel est le volcan le plus haut d'Afrique?]]></string>
<string lang="nl"><![CDATA[Wat is de hoogste vulkaan in Afrika?]]></string>
<string lang="ro"><![CDATA[Care este cel mai înalt vulcan din Africa?]]></string>
<keywords lang="en"><![CDATA[highest, volcano, Africa]]></keywords>
<keywords lang="de"><![CDATA[höchste, Vulkan, Afrika]]></keywords>
<keywords lang="es"><![CDATA[volcán, mas alto, África]]></keywords>
<keywords lang="it"><![CDATA[vulcano, più alto, Africa]]></keywords>
<keywords lang="fr"><![CDATA[volcan, plus haut, Afrique]]></keywords>
<keywords lang="nl"><![CDATA[hoogste, vulkaan, Afrika]]></keywords>
<keywords lang="ro"><![CDATA[cel mai înalt, vulcan, Africa?]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX yago: <http://dbpedia.org/class/yago/> 
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Volcano .
        ?uri dbo:locatedInArea ?area .        
        ?area rdf:type yago:AfricanCountries . 
        ?uri dbo:elevation ?elevation .
}
ORDER BY DESC(?elevation) 
OFFSET 0 LIMIT 1
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="287" onlydbo="false">
<string lang="en"><![CDATA[Which beer originated in Ireland?]]></string>
<string lang="de"><![CDATA[Welches Bier kommt aus Irland?]]></string>
<string lang="es"><![CDATA[¿Qué cerveza se ha originado en Irlanda?]]></string>
<string lang="it"><![CDATA[Quale birra è originaria dell'Irlanda?]]></string>
<string lang="fr"><![CDATA[Quelles bières viennent de l'Irlande?]]></string>
<string lang="nl"><![CDATA[Welke bieren komen uit Ierland?]]></string>
<string lang="ro"><![CDATA[Ce bere este originară din Irlanda?]]></string>
<keywords lang="en"><![CDATA[beer, originated, Ireland]]></keywords>
<keywords lang="de"><![CDATA[Bier, kommen aus, Irland]]></keywords>
<keywords lang="es"><![CDATA[cerveza, originado, Irlanda]]></keywords>
<keywords lang="it"><![CDATA[birra, origine, Irlanda]]></keywords>
<keywords lang="fr"><![CDATA[bières, Irlande?]]></keywords>
<keywords lang="nl"><![CDATA[bieren, komen uit, Ierland]]></keywords>
<keywords lang="ro"><![CDATA[bere, originară, Irlanda]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE {
        ?uri dbp:type res:Beer .
        ?uri dbp:origin "Ireland"@en .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="288" onlydbo="false">
<string lang="en"><![CDATA[What are the specialities of the UNC Health Care?]]></string>
<string lang="de"><![CDATA[Worauf ist die UNC Health Care spezialisiert?]]></string>
<string lang="es"><![CDATA[¿Cuáles son las especialidades del UNC Health Care?]]></string>
<string lang="it"><![CDATA[Quali sono le specialità della UNC Health Care?]]></string>
<string lang="fr"><![CDATA[Quelles sont les spécialités de l'UNC Health Care?]]></string>
<string lang="nl"><![CDATA[Wat zijn de specialiteiten van de UNC Health Care?]]></string>
<string lang="ro"><![CDATA[Care sunt specializările UNC Health Care?]]></string>
<keywords lang="en"><![CDATA[specialities, UNC Health Care]]></keywords>
<keywords lang="de"><![CDATA[Spezialisierung, UNC Health Care]]></keywords>
<keywords lang="es"><![CDATA[especialidades, UNC Health Care]]></keywords>
<keywords lang="it"><![CDATA[specialità, UNC Health Care?]]></keywords>
<keywords lang="fr"><![CDATA[spécialités, UNC Health Care?]]></keywords>
<keywords lang="nl"><![CDATA[specialiteiten, UNC Health Care]]></keywords>
<keywords lang="ro"><![CDATA[specializări, UNC Health Care]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        res:UNC_Health_Care dbp:speciality ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="289" onlydbo="true">
<string lang="en"><![CDATA[Who is the owner of Facebook?]]></string>
<string lang="de"><![CDATA[Wem gehört Facebook?]]></string>
<string lang="es"><![CDATA[¿Quién es el dueño de Facebook?]]></string>
<string lang="it"><![CDATA[Chi è il proprietario di Facebook?]]></string>
<string lang="fr"><![CDATA[À qui appartient Facebook?]]></string>
<string lang="nl"><![CDATA[Wie is de eigenaar van Facebook?]]></string>
<string lang="ro"><![CDATA[Cine este proprietarul Facebook?]]></string>
<keywords lang="en"><![CDATA[owner, Facebook]]></keywords>
<keywords lang="de"><![CDATA[gehört, Facebook]]></keywords>
<keywords lang="es"><![CDATA[dueño, Facebook]]></keywords>
<keywords lang="it"><![CDATA[proprietario, Facebook]]></keywords>
<keywords lang="fr"><![CDATA[propriétaire, Facebook]]></keywords>
<keywords lang="nl"><![CDATA[eigenaar, Facebook]]></keywords>
<keywords lang="ro"><![CDATA[proprietar, Facebook?]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Facebook dbo:foundedBy ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="290" onlydbo="true">
<string lang="en"><![CDATA[From which region is the Melon de Bourgogne?]]></string>
<string lang="de"><![CDATA[Aus welcher Region ist der Melon de Bourgogne?]]></string>
<string lang="es"><![CDATA[¿De que región es el vino Melon de Bourgogne?]]></string>
<string lang="it"><![CDATA[Da quale regione proviene il Melon de Bourgogne?]]></string>
<string lang="fr"><![CDATA[De quelle région vient le Melon de Bourgogne?]]></string>
<string lang="nl"><![CDATA[Vanuit welke regio is de Melon de Bourgogne?]]></string>
<string lang="ro"><![CDATA[Din ce regiune provine Melon-ul de Bourgogne?]]></string>
<keywords lang="en"><![CDATA[region, Melon de Bourgogne]]></keywords>
<keywords lang="de"><![CDATA[Region, Melon de Bourgogne]]></keywords>
<keywords lang="es"><![CDATA[región, Melon de Bourgogne]]></keywords>
<keywords lang="it"><![CDATA[regione, Melon de Bourgogne]]></keywords>
<keywords lang="fr"><![CDATA[région, Melon de Bourgogne]]></keywords>
<keywords lang="nl"><![CDATA[regio, Melon de Bourgogne]]></keywords>
<keywords lang="ro"><![CDATA[regiune, Melon de Bourgogne]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        res:Melon_de_Bourgogne dbo:wineRegion ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="291" onlydbo="true">
<string lang="en"><![CDATA[Who was influenced by Socrates?]]></string>
<string lang="de"><![CDATA[Wer wurde von Sokrates beeinflusst?]]></string>
<string lang="es"><![CDATA[¿Quién fue influenciado por Socrates?]]></string>
<string lang="it"><![CDATA[Chi fu influenzato da Socrate?]]></string>
<string lang="fr"><![CDATA[Qui a été influencé par Socrates?]]></string>
<string lang="nl"><![CDATA[Wie werd beïnvloed door Socrates?]]></string>
<string lang="ro"><![CDATA[Cine a fost influențat de către Socrate?]]></string>
<keywords lang="en"><![CDATA[influenced, Socrated]]></keywords>
<keywords lang="de"><![CDATA[beeinflusst, Sokrates]]></keywords>
<keywords lang="es"><![CDATA[influenciado, Socrates]]></keywords>
<keywords lang="it"><![CDATA[influenzato, Socrate]]></keywords>
<keywords lang="fr"><![CDATA[influencé, par Socrates]]></keywords>
<keywords lang="nl"><![CDATA[beïnvloed, Socrates]]></keywords>
<keywords lang="ro"><![CDATA[influențat, Socrate]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:influencedBy res:Socrates .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="292" onlydbo="false">
<string lang="en"><![CDATA[Who was president of Pakistan in 1978?]]></string>
<string lang="de"><![CDATA[Wer war 1978 Präsident von Pakistan?]]></string>
<string lang="es"><![CDATA[¿Quién fue el presidente de Pakistán en 1978?]]></string>
<string lang="it"><![CDATA[Chi fu presidente del Pakistan nel 1978?]]></string>
<string lang="fr"><![CDATA[Qui était le président du Pakistan en 1978?]]></string>
<string lang="nl"><![CDATA[Wie was president van Pakistan in 1978?]]></string>
<string lang="ro"><![CDATA[Cine a fost preşedintele Pakistanului în 1978?]]></string>
<keywords lang="en"><![CDATA[president, Pakistan, 1978]]></keywords>
<keywords lang="de"><![CDATA[Präsident, Pakistan, 1978]]></keywords>
<keywords lang="es"><![CDATA[presidente, Pakistán, 1978]]></keywords>
<keywords lang="it"><![CDATA[presidente, Pakistan, 1978]]></keywords>
<keywords lang="fr"><![CDATA[président, Pakistan, 1978]]></keywords>
<keywords lang="nl"><![CDATA[president, Pakistan, 1978]]></keywords>
<keywords lang="ro"><![CDATA[preşedinte, Pakistan, 1978]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE {
        ?uri dbp:title res:President_of_Pakistan .
        ?uri dbp:years 1978 .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="293" onlydbo="false">
<string lang="en"><![CDATA[Give me English actors starring in Lovesick.]]></string>
<string lang="de"><![CDATA[Gib mir britische Schauspieler, die in Lovesick mitspielen.]]></string>
<string lang="es"><![CDATA[Dame actores Ingleses protagonizando Lovesick.]]></string>
<string lang="it"><![CDATA[Dammi gli attori inglesi che hanno recitato in Lovesick.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les acteurs anglais de Lovesick.]]></string>
<string lang="nl"><![CDATA[Toen Brits acteurs met een rol in Lovesick.]]></string>
<string lang="ro"><![CDATA[Dă-mi actori englezi protagoniști în Lovesick.]]></string>
<keywords lang="en"><![CDATA[English actors, starring, Lovesick]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, britisch, mitspielen, Lovesick]]></keywords>
<keywords lang="es"><![CDATA[actores Ingleses, protagonistas, Lovesick ]]></keywords>
<keywords lang="it"><![CDATA[attori inglesi, protagonisti, Lovesick]]></keywords>
<keywords lang="fr"><![CDATA[acteurs, anglais, Lovesick]]></keywords>
<keywords lang="nl"><![CDATA[Brits acteurs, rol in, Lovesick]]></keywords>
<keywords lang="ro"><![CDATA[actori englezi, protagoniști, Lovesick]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX yago: <http://dbpedia.org/class/yago/> 
SELECT DISTINCT ?uri
WHERE {
          res:Lovesick dbo:starring ?uri .
        { ?uri dbo:birthPlace res:England . }
        UNION
        { ?uri rdf:type yago:EnglishFilmActors . }
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="294" onlydbo="false">
<string lang="en"><![CDATA[Give me all types of eating disorders.]]></string>
<string lang="de"><![CDATA[Zeig mir alle Arten von Essstörungen.]]></string>
<string lang="es"><![CDATA[¿Que tipos hay de trastornos de la alimentación?]]></string>
<string lang="it"><![CDATA[Dammi tutti i tipi di disturbi alimentari.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les types de troubles du comportement alimentaire.]]></string>
<string lang="nl"><![CDATA[Toen alle soorten eetstoornissen.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate tipurile de tulburări alimentare.]]></string>
<keywords lang="en"><![CDATA[types, eating disorders]]></keywords>
<keywords lang="de"><![CDATA[Arten von, Esstörungen]]></keywords>
<keywords lang="es"><![CDATA[tipos, trastornos de la alimentación]]></keywords>
<keywords lang="it"><![CDATA[tipi, disturbi alimentari]]></keywords>
<keywords lang="fr"><![CDATA[types, troubles du comportement alimentaire]]></keywords>
<keywords lang="nl"><![CDATA[soorten, eetstoornissen]]></keywords>
<keywords lang="ro"><![CDATA[tipuri, tulburări alimentare]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE { 
         ?uri rdf:type yago:EatingDisorders .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="295" onlydbo="true">
<string lang="en"><![CDATA[Who was married to president Chirac?]]></string>
<string lang="de"><![CDATA[Wer war mit Präsident Chirac verheiratet?]]></string>
<string lang="es"><![CDATA[¿Quién estuvo casado con el presidente Chirac?]]></string>
<string lang="it"><![CDATA[Chi è stato sposato con il presidente Chirac?]]></string>
<string lang="fr"><![CDATA[Qui était marrié avec le président Chirac?]]></string>
<string lang="nl"><![CDATA[Wie was met president Chirac getrouwd?]]></string>
<string lang="ro"><![CDATA[Cine a fost căsătorit cu președintele Chirac?]]></string>
<keywords lang="en"><![CDATA[married to, president Chirac]]></keywords>
<keywords lang="de"><![CDATA[verheiratet mit, Päsident Chirac]]></keywords>
<keywords lang="es"><![CDATA[casado con, presidented Chirac]]></keywords>
<keywords lang="it"><![CDATA[sposato con, presidente Chirac]]></keywords>
<keywords lang="fr"><![CDATA[épouse, président Chirac]]></keywords>
<keywords lang="nl"><![CDATA[getrouwd met, president Chirac]]></keywords>
<keywords lang="ro"><![CDATA[căsătorit cu, președintele Chirac]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri
WHERE { 
         res:Jacques_Chirac dbo:spouse ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="296" onlydbo="false">
<string lang="en"><![CDATA[What is the largest metropolitan area in Washington state?]]></string>
<string lang="de"><![CDATA[Was ist das größte Ballungsgebiet im Staat Washington?]]></string>
<string lang="es"><![CDATA[¿Cuál es el área metropolitana mas larga en el estado de Washington?]]></string>
<string lang="it"><![CDATA[Qual è la più grande area metropolitana nello stato di Washington?]]></string>
<string lang="fr"><![CDATA[Quelle est l'aire urbaine la pöus grande dans l'état de Washington?]]></string>
<string lang="nl"><![CDATA[Wat is het grootste stedelijke gebied in de staat Washington?]]></string>
<string lang="ro"><![CDATA[Care este cea mai mare zonă metropolitană din statul Washington?]]></string>
<keywords lang="en"><![CDATA[largest metropolitan area, Washington state]]></keywords>
<keywords lang="de"><![CDATA[größtes Ballungsgebiet, Staat Washington]]></keywords>
<keywords lang="es"><![CDATA[área metropolitana, mas larga, estado de Washington]]></keywords>
<keywords lang="it"><![CDATA[area metropolitana, più grande, stato di Washington]]></keywords>
<keywords lang="fr"><![CDATA[aire urbaine, plus grance, état de Washington]]></keywords>
<keywords lang="nl"><![CDATA[grootste stedelijke gebied, staat Washington]]></keywords>
<keywords lang="ro"><![CDATA[cea mai mare zonă metropolitană, statul Washington]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri
WHERE {
        <http://dbpedia.org/resource/Washington_(state)> dbp:largestmetro ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="297" onlydbo="true">
<string lang="en"><![CDATA[Where in France is sparkling wine produced?]]></string>
<string lang="de"><![CDATA[Wo in Frankreich wird Schaumwein hergestellt?]]></string>
<string lang="es"><![CDATA[¿Dónde en Francia se produce el vino espumoso?]]></string>
<string lang="it"><![CDATA[Dove si produce vino frizzante in Francia?]]></string>
<string lang="fr"><![CDATA[Où produit-on du vin mousseux en France?]]></string>
<string lang="nl"><![CDATA[Waar in Frankrijk word mousserende wijn geproduceerd?]]></string>
<string lang="ro"><![CDATA[Unde în Franța este produs vinul spumant?]]></string>
<keywords lang="en"><![CDATA[produced, France, sparkling wine]]></keywords>
<keywords lang="de"><![CDATA[Frankreich, hergestellt, Schaumwein]]></keywords>
<keywords lang="es"><![CDATA[produce, Francia, vino espumoso]]></keywords>
<keywords lang="it"><![CDATA[produrre, Francia, vino frizzante]]></keywords>
<keywords lang="fr"><![CDATA[france, produit, vin mousseux]]></keywords>
<keywords lang="nl"><![CDATA[Frankrijk, mousserende wijn, geproduceerd]]></keywords>
<keywords lang="ro"><![CDATA[produs, Franța, vin spumant]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:wineProduced res:Sparkling_wine .
        ?uri dbo:location res:France .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="298" onlydbo="true">
<string lang="en"><![CDATA[Where did Hillel Slovak die?]]></string>
<string lang="de"><![CDATA[Wo ist Hillel Slovak gestorben?]]></string>
<string lang="es"><![CDATA[¿Dónde murió Hillel Slovak?]]></string>
<string lang="it"><![CDATA[Dove è morto Hillel Slovak?]]></string>
<string lang="fr"><![CDATA[Donne moi le lieu de décès de Hillel Slovak.]]></string>
<string lang="nl"><![CDATA[Waar is Hillel Slovak gestorven?]]></string>
<string lang="ro"><![CDATA[Unde a murit Hillel Slovak?]]></string>
<keywords lang="en"><![CDATA[Hillel Slovak, death place]]></keywords>
<keywords lang="de"><![CDATA[Hillel Slovak, Todesort]]></keywords>
<keywords lang="es"><![CDATA[Hillel Slovak, donde murió]]></keywords>
<keywords lang="it"><![CDATA[Hillel Slovak, dove è morto]]></keywords>
<keywords lang="fr"><![CDATA[lieu, décès, Hillel Slovak]]></keywords>
<keywords lang="nl"><![CDATA[Hillel Slovak, doodsplaats]]></keywords>
<keywords lang="ro"><![CDATA[Hillel Slovak, locul morții]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        res:Hillel_Slovak dbo:deathPlace ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="299" onlydbo="true">
<string lang="en"><![CDATA[What is the timezone in San Pedro de Atacama?]]></string>
<string lang="de"><![CDATA[In welcher Zeitzone liegt San Pedro de Atacama?]]></string>
<string lang="es"><![CDATA[¿Cuál es la zona horaria en San Pedro de Atacama?]]></string>
<string lang="it"><![CDATA[Qual è il fuso orario di San Pedro de Atacama?]]></string>
<string lang="fr"><![CDATA[Quel est le fuseau horaire de San Pedro de Atacama?]]></string>
<string lang="nl"><![CDATA[Wat is de tijdzone in San Pedro de Atacama?]]></string>
<string lang="ro"><![CDATA[Care este fusul orar din San Pedro de Atacama?]]></string>
<keywords lang="en"><![CDATA[timezone, San Pedro de Atacama]]></keywords>
<keywords lang="de"><![CDATA[Zeitzone, San Pedro de Atacama]]></keywords>
<keywords lang="es"><![CDATA[zona horaria, San Pedro de Atacama]]></keywords>
<keywords lang="it"><![CDATA[fuso orario, San Pedro de Atacama]]></keywords>
<keywords lang="fr"><![CDATA[fuseau horaire, San Pedro de Atacama]]></keywords>
<keywords lang="nl"><![CDATA[tijdzone, San Pedro de Atacama]]></keywords>
<keywords lang="ro"><![CDATA[fus orar, San Pedro de Atacama]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/timezone/> 
SELECT DISTINCT ?uri
WHERE {
        res:San_Pedro_de_Atacama dbo:timezone ?uri .
}
]]></query>
</question>

