<?xml version="1.0" ?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="300" onlydbo="true">
<string lang="en"><![CDATA[In which city does the Chile Route 68 end?]]></string>
<string lang="de"><![CDATA[In welcher Stadt hört die Ruta 68 auf?]]></string>
<string lang="es"><![CDATA[¿En que ciudad termina la ruta Chilena 68?]]></string>
<string lang="it"><![CDATA[In quale città termina la Route 68 in Cile?]]></string>
<string lang="fr"><![CDATA[Dans quelle ville se termine la route 68 chilienne?]]></string>
<string lang="nl"><![CDATA[In welke stad eindigt de Route 68 in Chili?]]></string>
<string lang="ro"><![CDATA[În ce oraș se termină Route 68 din Chile?]]></string>
<keywords lang="en"><![CDATA[city, Chile Route 68, ends]]></keywords>
<keywords lang="de"><![CDATA[Stadt, aufhören, Ruta 68]]></keywords>
<keywords lang="es"><![CDATA[ciudad, termina, ruta Chilena 68]]></keywords>
<keywords lang="it"><![CDATA[città, termina, Route 68, Cile]]></keywords>
<keywords lang="fr"><![CDATA[route 68, chili, ville, terminaison]]></keywords>
<keywords lang="nl"><![CDATA[stad, eindigt, Route 68, Chili]]></keywords>
<keywords lang="ro"><![CDATA[oraș, termină, Route 68, Chile]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        res:Chile_Route_68 dbo:routeEnd ?uri .
}
]]></query>
</question>

<question id="301" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Who was vice-president under the president who authorized atomic weapons against Japan during World War II?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?x text:"athourized" text:"atomic weapons against Japan" .
        ?x dbo:vicePresident ?uri .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Alben_W._Barkley]]></answer>
</question>

<question id="307" answertype="number" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[How old was Steve Jobs' sister when she first met him?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT ?n 
WHERE {
        res:Steve_Jobs dbo:relative ?uri .
        ?uri text:"first met him when she was" ?n .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[25]]></answer>
</question>

