<?xml version="1.0" ?>
<dataset id="qald-5_train">

<question id="1" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all cosmonauts.]]></string>
<string lang="de"><![CDATA[Gib mir alle Kosmonauten.]]></string>
<string lang="es"><![CDATA[Dame todas las cosmonautas.]]></string>
<string lang="it"><![CDATA[Dammi tutte le cosmonaute.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les cosmonautes.]]></string>
<string lang="nl"><![CDATA[Geef alle kosmonauten.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți cosmonauții.]]></string>
<keywords lang="en"><![CDATA[cosmonauts]]></keywords>
<keywords lang="de"><![CDATA[Kosmonauten]]></keywords>
<keywords lang="es"><![CDATA[cosmonautas]]></keywords>
<keywords lang="it"><![CDATA[cosmonaute]]></keywords>
<keywords lang="fr"><![CDATA[cosmonautes]]></keywords>
<keywords lang="nl"><![CDATA[kosmonauten]]></keywords>
<keywords lang="ro"><![CDATA[cosmonauți]]></keywords>
<query><![CDATA[ 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Astronaut . 
      { ?uri dbo:nationality res:Russia . } 
      UNION 
      { ?uri dbo:nationality res:Soviet_Union . } 
} 
]]>
</query>
</question>

<question id="10" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[In which country does the Ganges start?]]></string>
<string lang="de"><![CDATA[In welchem Land entspringt der Ganges?]]></string>
<string lang="es"><![CDATA[¿En qué país nace el Ganges?]]></string>
<string lang="it"><![CDATA[In quale stato nasce il Gange?]]></string>
<string lang="fr"><![CDATA[Dans quel pays commence le Gange?]]></string>
<string lang="nl"><![CDATA[In welk land ontspringt de Ganges?]]></string>
<string lang="ro"><![CDATA[Din ce țară izvorăște Ganga?]]></string>
<keywords lang="en"><![CDATA[Ganges, start, country]]></keywords>
<keywords lang="de"><![CDATA[Ganges, entspringen, Land]]></keywords>
<keywords lang="es"><![CDATA[Ganges, país, orígen]]></keywords>
<keywords lang="it"><![CDATA[Gange, stato, origine]]></keywords>
<keywords lang="fr"><![CDATA[pays, commence, Gange]]></keywords>
<keywords lang="nl"><![CDATA[ontspringt, Ganges]]></keywords>
<keywords lang="ro"><![CDATA[Gangele, izvor, țară]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Ganges dbo:sourceCountry ?uri .
} 
]]>
</query>
</question>

<question id="102" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who was John F. Kennedy's vice president?]]></string>
<string lang="de"><![CDATA[Wer war der Vizepräsident unter John F. Kennedy?]]></string>
<string lang="es"><![CDATA[¿Quién fué el vicepresidente de John F. Kennedy?]]></string>
<string lang="it"><![CDATA[Chi fu il vicepresidente di John F. Kennedy?]]></string>
<string lang="fr"><![CDATA[Qui était le vice-président de John F. Kennedy?]]></string>
<string lang="nl"><![CDATA[Wie was de vicepresident onder John F. Kennedy?]]></string>
<string lang="ro"><![CDATA[Cine a fost vicepreședintele lui John F. Kennedy?]]></string>
<keywords lang="en"><![CDATA[John F. Kennedy, vice president]]></keywords>
<keywords lang="de"><![CDATA[John F. Kennedy, Vizepräsident]]></keywords>
<keywords lang="es"><![CDATA[John F. Kennedy, vicepresidente]]></keywords>
<keywords lang="it"><![CDATA[John F. Kennedy, vicepresidente]]></keywords>
<keywords lang="fr"><![CDATA[John F. Kennedy, vice-président]]></keywords>
<keywords lang="nl"><![CDATA[John F. Kennedy, vicepresident]]></keywords>
<keywords lang="ro"><![CDATA[John F. Kennedy, vicepreședinte]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { res:John_F._Kennedy dbo:vicePresident ?uri . 
} 
]]>
</query>
</question>

<question id="104" onlydbo="true" answertype="number" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[How many students does the Free University in Amsterdam have?]]></string>
<string lang="de"><![CDATA[Wieviele Studenten hat die Freie Universität in Amsterdam?]]></string>
<string lang="es"><![CDATA[¿Cuántos estudiantes tiene la Universidad Libre de Amsterdam?]]></string>
<string lang="it"><![CDATA[Quanti studenti ci sono nella Libera Università di Amsterdam?]]></string>
<string lang="fr"><![CDATA[Combien d'étudiants a l'université libre d'Amsterdam?]]></string>
<string lang="nl"><![CDATA[Hoeveel studenten heeft de Vrije Universiteit in Amsterdam?]]></string>
<string lang="ro"><![CDATA[Câți studenți are Universitatea Liberă din Amsterdam?]]></string>
<keywords lang="en"><![CDATA[Free University, Amsterdam, students]]></keywords>
<keywords lang="de"><![CDATA[Freie Universität, Amsterdam, Studenten]]></keywords>
<keywords lang="es"><![CDATA[Universidad Libre, Amsterdam, estudiantes]]></keywords>
<keywords lang="it"><![CDATA[Libera Università, Amsterdam, studenti]]></keywords>
<keywords lang="fr"><![CDATA[Université libre, Amsterdam, étudiants]]></keywords>
<keywords lang="nl"><![CDATA[Vrije Universiteit, Amsterdam, studenten]]></keywords>
<keywords lang="ro"><![CDATA[Universitatea Liberă, Amsterdam, studenți]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?num 
WHERE { 
        res:VU_University_Amsterdam dbo:numberOfStudents ?num . 
} 
]]>
</query>
</question>

<question id="11" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which countries have more than ten caves?]]></string>
<string lang="de"><![CDATA[In welchen Ländern gibt es mehr als zehn Höhlen?]]></string>
<string lang="es"><![CDATA[¿Qué países tienen más de diez cuevas?]]></string>
<string lang="it"><![CDATA[Quali nazioni hanno più di dieci grotte?]]></string>
<string lang="fr"><![CDATA[Quels pays ont plus de dix grottes?]]></string>
<string lang="nl"><![CDATA[Welke landen hebben meer dan tien grotten?]]></string>
<string lang="ro"><![CDATA[Ce țări au mai mult de zece peșteri?]]></string>
<keywords lang="en"><![CDATA[country, cave, more than ten]]></keywords>
<keywords lang="de"><![CDATA[Land, Höhle, mehr als zehn]]></keywords>
<keywords lang="es"><![CDATA[país, cuevas, más de diez]]></keywords>
<keywords lang="it"><![CDATA[nazione, grotta, più di dieci]]></keywords>
<keywords lang="fr"><![CDATA[pays, grottes, plus de dix]]></keywords>
<keywords lang="nl"><![CDATA[land, grotten, meer dan tien]]></keywords>
<keywords lang="ro"><![CDATA[țară, peșteră, mai mult de zece]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Country . 
        ?cave rdf:type dbo:Cave . 
      { ?cave dbo:location ?uri . } 
      UNION 
      { ?cave dbo:location ?loc . 
        ?loc dbo:country ?uri . } 
} 
GROUP BY ?uri 
HAVING(COUNT(?cave) > 10) 
]]>
</query>
</question>

<question id="110" onlydbo="false" answertype="number" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[What is the total amount of men and women serving in the FDNY?]]></string>
<string lang="de"><![CDATA[Wieviele Männer und Frauen arbeiten in der New Yorker Berufsfeuerwehr?]]></string>
<string lang="es"><![CDATA[¿Cúantos hombres y mujeres trabajan para los bomberos de Nueva York?]]></string>
<string lang="it"><![CDATA[Qual è il totale di uomini e donne che prestano servizio nel dipartimento dei vigili del fuoco di New York?]]></string>
<string lang="fr"><![CDATA[Combien d'hommes et femmes sont membres du corps des sapeurs-pompiers professionnels de New York?]]></string>
<string lang="nl"><![CDATA[Wat is het totale aantal vrouwen en mannen dat werkt bij de brandweer van New York?]]></string>
<string lang="ro"><![CDATA[Care este numărul total de bărbați și femei membri ai Departamentului de Pompieri din New York?]]></string>
<keywords lang="en"><![CDATA[total amount, men, women, serve, FDNY]]></keywords>
<keywords lang="de"><![CDATA[Männer, Frauen, arbeiten, New York, Berufsfeuerwehr]]></keywords>
<keywords lang="es"><![CDATA[hombres, mujeres, bomberos, Nueva York]]></keywords>
<keywords lang="it"><![CDATA[totale, uomini, donne, prestare servizio, dipartimento dei vigili del fuoco di New York]]></keywords>
<keywords lang="fr"><![CDATA[hommes, femmes, sapeurs-pompiers professionnels de New York]]></keywords>
<keywords lang="nl"><![CDATA[mannen, vrouwen, brandweer, New York]]></keywords>
<keywords lang="ro"><![CDATA[număr total, bărbați, femei, membri, Departamentul de Pompieri din New York]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?num 
WHERE { 
        res:New_York_City_Fire_Department dbp:employees ?num . 
} 
]]>
</query>
</question>

<question id="200" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who produces Orangina?]]></string>
<string lang="de"><![CDATA[Wer stellt Orangina her?]]></string>
<string lang="es"><![CDATA[¿Quién produce Orangina?]]></string>
<string lang="it"><![CDATA[Chi produce l'Orangina?]]></string>
<string lang="fr"><![CDATA[Qui produit Orangina?]]></string>
<string lang="nl"><![CDATA[Wie is de producent van Orangina?]]></string>
<string lang="ro"><![CDATA[Cine produce Orangina?]]></string>
<keywords lang="en"><![CDATA[produce, Orangina]]></keywords>
<keywords lang="de"><![CDATA[herstellen, Orangina]]></keywords>
<keywords lang="es"><![CDATA[Orangina, productor]]></keywords>
<keywords lang="it"><![CDATA[Orangina, produttore]]></keywords>
<keywords lang="fr"><![CDATA[produire, Orangina]]></keywords>
<keywords lang="nl"><![CDATA[producent, Orangina]]></keywords>
<keywords lang="ro"><![CDATA[produce, Orangina]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:product res:Orangina . 
}
]]>
</query>
</question>

<question id="112" onlydbo="false" answertype="resource" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Give me all world heritage sites designated within the past two years.]]></string>
<string lang="de"><![CDATA[Gib mir alle Welterbestätten, die in den vergangenen zwei Jahren aufgenommen wurden.]]></string>
<string lang="es"><![CDATA[¿Qué patrimonios de la humanidad fueron reconocidos en los últimos dos años?]]></string>
<string lang="it"><![CDATA[Dammi tutti i siti designati patrimoni dell'umanità negli ultimi due anni.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les patrimoines mondiaux qui ont été inscrits pendant les derniers deux ans.]]></string>
<string lang="nl"><![CDATA[Noem alle plaatsen op de Werelderfgoedlijst die in de laatste twee jaar zijn toegevoegd.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate siturile de patrimoniu mondial desemnate in ultimii doi ani.]]></string>
<keywords lang="en"><![CDATA[world heritage site, designate, past two years]]></keywords>
<keywords lang="de"><![CDATA[Welterbestätte, aufnehmen, vergangene zwei Jahre]]></keywords>
<keywords lang="es"><![CDATA[patrimonios de la humanidad, reconocidos, últimos dos años]]></keywords>
<keywords lang="it"><![CDATA[patrimoni dell'umanità, designare, ultimi due anni]]></keywords>
<keywords lang="fr"><![CDATA[patrimoines mondiaux, inscrits, derniers deux ans]]></keywords>
<keywords lang="nl"><![CDATA[Werelderfgoed, laatste twee jaar, toevoegen]]></keywords>
<keywords lang="ro"><![CDATA[situri de patrimoniu mondial, desemna, ultimii doi ani]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:WorldHeritageSite . 
      { ?uri dbp:year '2013'^^xsd:integer . }
      UNION 
      { ?uri dbp:year '2014'^^xsd:integer . }
} 
]]>
</query>
</question>

<question id="115" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[What is the longest river?]]></string>
<string lang="de"><![CDATA[Was ist der längste Fluss?]]></string>
<string lang="es"><![CDATA[¿Cuál es el río más largo?]]></string>
<string lang="it"><![CDATA[Qual è il fiume più lungo?]]></string>
<string lang="fr"><![CDATA[Quel est le cours d'eau le plus long?]]></string>
<string lang="nl"><![CDATA[Wat is de langste rivier?]]></string>
<string lang="ro"><![CDATA[Care este cel mai lung fluviu?]]></string>
<keywords lang="en"><![CDATA[river, longest]]></keywords>
<keywords lang="de"><![CDATA[Fluss, längster]]></keywords>
<keywords lang="es"><![CDATA[río, más largo]]></keywords>
<keywords lang="it"><![CDATA[fiume, più lungo]]></keywords>
<keywords lang="fr"><![CDATA[cours d'eau, plus long]]></keywords>
<keywords lang="nl"><![CDATA[rivier, langste]]></keywords>
<keywords lang="ro"><![CDATA[fluviu, cel mai lung]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:River . 
      { ?uri dbo:length ?l . } 
      UNION 
      { ?uri dbp:length ?l . } 
} 
ORDER BY DESC(?l) 
OFFSET 0 LIMIT 1 
]]>
</query>
</question>

<question id="116" onlydbo="true" answertype="boolean" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Does Breaking Bad have more episodes than Game of Thrones?]]></string>
<string lang="de"><![CDATA[Hat Breaking Bad mehr Episoden als Game of Thrones?]]></string>
<string lang="es"><![CDATA[¿Tiene Breaking Bad más episodios que Game of Thrones?]]></string>
<string lang="it"><![CDATA[Breaking Bad ha più episodi di Game of Thrones?]]></string>
<string lang="fr"><![CDATA[A Breaking Bad plus d'épisodes que Game of Thrones?]]></string>
<string lang="nl"><![CDATA[Heeft Breaking Bad meer afleveringen dan Game of Thrones?]]></string>
<string lang="ro"><![CDATA[Are Breaking Bad mai multe episoade decât Game of Thrones?]]></string>
<keywords lang="en"><![CDATA[Breaking Bad, episodes, more than, Game of Thrones]]></keywords>
<keywords lang="de"><![CDATA[Breaking Bad, Episoden, mehr als, Game of Thrones]]></keywords>
<keywords lang="es"><![CDATA[Breaking Bad, episodios, más que, Game of Thrones]]></keywords>
<keywords lang="it"><![CDATA[Breaking Bad, eposido, più di, Game of Thrones]]></keywords>
<keywords lang="fr"><![CDATA[Breaking Bad, épisodes plus que, Game of Thrones]]></keywords>
<keywords lang="nl"><![CDATA[Breaking Bad, afleveringen, meer dan, Game of Thrones]]></keywords>
<keywords lang="ro"><![CDATA[Breaking Bad, episoade, mai multe decât, Game of Thrones]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Breaking_Bad dbo:numberOfEpisodes ?x . 
        res:Game_of_Thrones dbo:numberOfEpisodes ?y . 
        FILTER (?x > ?y) 
} 
]]>
</query>
</question>

<question id="12" onlydbo="true" answertype="boolean" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Is proinsulin a protein?]]></string>
<string lang="de"><![CDATA[Ist Proinsulin ein Protein?]]></string>
<string lang="es"><![CDATA[¿La proinsulina es una proteina?]]></string>
<string lang="it"><![CDATA[La proinsulina è una proteina?]]></string>
<string lang="fr"><![CDATA[La pro-insuline est-elle une protéine?]]></string>
<string lang="nl"><![CDATA[Is proinsuline een proteïne?]]></string>
<string lang="ro"><![CDATA[Este proinsulina o proteină?]]></string>
<keywords lang="en"><![CDATA[proinsulin, protein]]></keywords>
<keywords lang="de"><![CDATA[Proinsulin, Protein]]></keywords>
<keywords lang="es"><![CDATA[proinsulina, protein]]></keywords>
<keywords lang="it"><![CDATA[proinsulina, proteina]]></keywords>
<keywords lang="fr"><![CDATA[pro-insuline, protéine]]></keywords>
<keywords lang="nl"><![CDATA[proinsuline, proteïne]]></keywords>
<keywords lang="ro"><![CDATA[proinsulină, proteină]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
ASK 
WHERE { 
        res:Proinsulin rdf:type dbo:Protein . 
} 
]]>
</query>
</question>

<question id="123" onlydbo="false" answertype="boolean" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Do Prince Harry and Prince William have the same parents?]]></string>
<string lang="de"><![CDATA[Haben Prinz Harry und Prinz William dieselben Eltern?]]></string>
<string lang="es"><![CDATA[¿Tienen el príncipe Harry y el prínciple William la misma madre?]]></string>
<string lang="it"><![CDATA[Il principe Harry e il principe William hanno gli stessi genitoris?]]></string>
<string lang="fr"><![CDATA[Ont les princes Harry et William la même mère?]]></string>
<string lang="nl"><![CDATA[Hebben prins Harry en prins William dezelfde ouders?]]></string>
<string lang="ro"><![CDATA[Prințul Harry și Prințul William au aceiași părinți?]]></string>
<keywords lang="en"><![CDATA[Prince Harry, Prince William, same, parents]]></keywords>
<keywords lang="de"><![CDATA[Prinz Harry, Prinz William, selbe Eltern]]></keywords>
<keywords lang="es"><![CDATA[príncipe Harry, príncipe William, la misma madre]]></keywords>
<keywords lang="it"><![CDATA[principe Harry, principe William, stessi genitori]]></keywords>
<keywords lang="fr"><![CDATA[prince Harry, Prince William, même mère]]></keywords>
<keywords lang="nl"><![CDATA[prins Harry, prins William, dezelfde, ouders]]></keywords>
<keywords lang="ro"><![CDATA[Prințul Harry, Prințul William, aceiași, părinți]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
ASK
WHERE { 
        <http://dbpedia.org/resource/Prince_William,_Duke_of_Cambridge> dbo:parent ?x . 
        <http://dbpedia.org/resource/Prince_Harry> dbo:parent ?x .
} 
]]>
</query>
</question>

<question id="126" onlydbo="true" answertype="number" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[How many languages are spoken in Turkmenistan?]]></string>
<string lang="de"><![CDATA[Wieviele Sprachen werden in Turkmenistan gesprochen?]]></string>
<string lang="es"><![CDATA[¿Cuántos idiomas se hablan en Turkmenistán?]]></string>
<string lang="it"><![CDATA[Quante lingue sono parlate in Turkmenistan?]]></string>
<string lang="fr"><![CDATA[Combien de langues sont parlées au Turkménistan?]]></string>
<string lang="nl"><![CDATA[Hoeveel talen worden er gesproken in Turkmenistan?]]></string>
<string lang="ro"><![CDATA[Câte limbi sunt vorbite în Turkmenistan?]]></string>
<keywords lang="en"><![CDATA[languages, Turkmenistan]]></keywords>
<keywords lang="de"><![CDATA[Sprachen, Turkmenistan]]></keywords>
<keywords lang="es"><![CDATA[idiomas, Turkmenistán]]></keywords>
<keywords lang="it"><![CDATA[lingue, Turkmenistan]]></keywords>
<keywords lang="fr"><![CDATA[langues, Turkménistan]]></keywords>
<keywords lang="nl"><![CDATA[talen, Turkmenistan]]></keywords>
<keywords lang="ro"><![CDATA[limbi, Turkmenistan]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT COUNT(DISTINCT ?x) 
WHERE { 
        res:Turkmenistan dbo:language ?x . 
} 
]]>
</query>
</question>

<question id="129" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all actors starring in movies directed by William Shatner.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schauspieler von Filmen, in denen William Shatner Regie geführt hat.]]></string>
<string lang="es"><![CDATA[Dame todos los actores de películas dirigidas por William Shatner.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli attori che recitano in film diretti da William Shatner.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les acteurs qui ont joué dans des films réalisés par Williams Shatner.]]></string>
<string lang="nl"><![CDATA[Geef alle acteurs van films waar William Shatner de regie van voerde.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți actorii care joacă roluri principale în filme regizate de William Shatner.]]></string>
<keywords lang="en"><![CDATA[actor, starring, movie, direct, William Shatner]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, Film, Regie, William Shatner]]></keywords>
<keywords lang="es"><![CDATA[actor, película, director, William Shatner]]></keywords>
<keywords lang="it"><![CDATA[attore, recitare, film, diretto, William Shatner]]></keywords>
<keywords lang="fr"><![CDATA[acteur, film, réalisé, William Shatner]]></keywords>
<keywords lang="nl"><![CDATA[acteur, film, regisseur, William Shatner]]></keywords>
<keywords lang="ro"><![CDATA[actor, rol principal, film, regiza, William Shatner]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?x dbo:director res:William_Shatner . 
        ?x dbo:starring ?uri . 
} 
]]>
</query>
</question>

<question id="13" onlydbo="true" answertype="boolean" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Are tree frogs a type of amphibian?]]></string>
<string lang="de"><![CDATA[Sind Laubfrösche Amphibien?]]></string>
<string lang="es"><![CDATA[¿Son las ranas verdes un tipo de anfibio?]]></string>
<string lang="it"><![CDATA[Le rane verdi sono un tipo di anfibio?]]></string>
<string lang="fr"><![CDATA[Sont les grenouilles arboricoles un type d'amphibiens?]]></string>
<string lang="nl"><![CDATA[Zijn boomkikkers een soort amfibie?]]></string>
<string lang="ro"><![CDATA[Sunt broaștele de copac un tip de amfibieni?]]></string>
<keywords lang="en"><![CDATA[tree frog, amphibian]]></keywords>
<keywords lang="de"><![CDATA[Laubfrosch, Amphibie]]></keywords>
<keywords lang="es"><![CDATA[rana verde, anfibio]]></keywords>
<keywords lang="it"><![CDATA[rana verde, anfibio]]></keywords>
<keywords lang="fr"><![CDATA[grenouilles arboricoles, amphibien]]></keywords>
<keywords lang="nl"><![CDATA[boomkikker, amfibie]]></keywords>
<keywords lang="ro"><![CDATA[broască de copac, amfibian]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Hylidae dbo:class res:Amphibian . 
} 
]]>
</query>
</question>

<question id="131" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all Methodist politicians.]]></string>
<string lang="de"><![CDATA[Gib mir alle Politiker, die Methodisten sind.]]></string>
<string lang="es"><![CDATA[Dame todos los políticos que sean metodístas.]]></string>
<string lang="it"><![CDATA[Dammi tutti i politici metodisti.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les politiciens qui sont méthodistes.]]></string>
<string lang="nl"><![CDATA[Geef alle politici die methodist zijn.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți politicienii metodiști]]></string>
<keywords lang="en"><![CDATA[politician, Methodist]]></keywords>
<keywords lang="de"><![CDATA[Politiker, Methodist]]></keywords>
<keywords lang="es"><![CDATA[políticos, metodístas]]></keywords>
<keywords lang="it"><![CDATA[politici, metodista]]></keywords>
<keywords lang="fr"><![CDATA[politiciens, méthodistes]]></keywords>
<keywords lang="nl"><![CDATA[politici, methodist]]></keywords>
<keywords lang="ro"><![CDATA[politician, metodist]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Politician . 
        ?uri dbo:religion res:Methodism . 
} 
]]>
</query>
</question>

<question id="132" onlydbo="true" answertype="number" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[How often did Jane Fonda marry?]]></string>
<string lang="de"><![CDATA[Wie oft hat Jane Fonda geheiratet?]]></string>
<string lang="es"><![CDATA[¿Cuántas veces ha estado casada Jane Fonda?]]></string>
<string lang="it"><![CDATA[Quante volte si è sposata Jane Fonda?]]></string>
<string lang="fr"><![CDATA[Combien de fois s'est mariée Jane Fonda?]]></string>
<string lang="nl"><![CDATA[Hoe vaak is Jane Fonda getrouwd?]]></string>
<string lang="ro"><![CDATA[Cât de des s-a măritat Jane Fonda?]]></string>
<keywords lang="en"><![CDATA[Jane Fonda, marry, how often]]></keywords>
<keywords lang="de"><![CDATA[Jane Fonda, heiraten, wie oft]]></keywords>
<keywords lang="es"><![CDATA[Jane Fonda, casada, cuántas veces]]></keywords>
<keywords lang="it"><![CDATA[Jane Fonda, sposata, quante volte]]></keywords>
<keywords lang="fr"><![CDATA[Jane Fonda, marriages, nombre de fois]]></keywords>
<keywords lang="nl"><![CDATA[Jane Fonda, getrouwd, hoe vaak]]></keywords>
<keywords lang="ro"><![CDATA[Jane Fonda, mărita, cât de des]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT COUNT(DISTINCT ?uri) 
WHERE { 
        res:Jane_Fonda dbo:spouse ?uri . 
} 
]]>
</query>
</question>

<question id="14" onlydbo="true" answertype="number" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[How tall is Claudia Schiffer?]]></string>
<string lang="de"><![CDATA[Wie groß ist Claudia Schiffer?]]></string>
<string lang="es"><![CDATA[¿Cómo de alta es Claudia Schiffer?]]></string>
<string lang="it"><![CDATA[Quanto è alta Claudia Schiffer?]]></string>
<string lang="fr"><![CDATA[Quelle est la taille de Claudia Schiffer?]]></string>
<string lang="nl"><![CDATA[Hoe lang is Claudia Schiffer?]]></string>
<string lang="ro"><![CDATA[Ce înălțime are Claudia Schiffer?]]></string>
<keywords lang="en"><![CDATA[Claudia Schiffer, tall]]></keywords>
<keywords lang="de"><![CDATA[Claudia Schiffer, groß]]></keywords>
<keywords lang="es"><![CDATA[Claudia Schiffer, altura]]></keywords>
<keywords lang="it"><![CDATA[Claudia Schiffer, altezza]]></keywords>
<keywords lang="fr"><![CDATA[taille, Claudia Schiffer]]></keywords>
<keywords lang="nl"><![CDATA[lengte, Claudia Schiffer]]></keywords>
<keywords lang="ro"><![CDATA[Claudia Schiffer, înălțime]]></keywords>
<query><![CDATA[ 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?height 
WHERE { 
        res:Claudia_Schiffer dbo:height ?height . 
} 
]]>
</query>
</question>

<question id="145" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which countries are connected by the Rhine?]]></string>
<string lang="de"><![CDATA[Welche Länder verbindet der Rhein?]]></string>
<string lang="es"><![CDATA[¿Qué países une el Rhin?]]></string>
<string lang="it"><![CDATA[Quali stati sono collegati dal Reno?]]></string>
<string lang="fr"><![CDATA[Quels sont les pays connectés pas le Rhin?]]></string>
<string lang="nl"><![CDATA[Welke landen worden door de Rijn verbonden?]]></string>
<string lang="ro"><![CDATA[Ce țări sunt unite de Rin?]]></string>
<keywords lang="en"><![CDATA[Rhine, country]]></keywords>
<keywords lang="de"><![CDATA[Rhein, Land]]></keywords>
<keywords lang="es"><![CDATA[Rhin, une, países]]></keywords>
<keywords lang="it"><![CDATA[Reno, collegare, stati]]></keywords>
<keywords lang="fr"><![CDATA[pays connectés, Rhin]]></keywords>
<keywords lang="nl"><![CDATA[land, Rijn]]></keywords>
<keywords lang="ro"><![CDATA[Rin, țară]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Rhine dbp:country ?string .  
        ?uri rdf:type dbo:Country .  
        ?uri rdfs:label ?string . 
} 
]]>
</query>
</question>

<question id="146" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which professional surfers were born in Australia?]]></string>
<string lang="de"><![CDATA[Welche Profisurfer wurden in Australien geboren?]]></string>
<string lang="es"><![CDATA[¿Qué surfistas profesionales nacieron en Australia?]]></string>
<string lang="it"><![CDATA[Quali surfisti professionisti sono nati in Australia?]]></string>
<string lang="fr"><![CDATA[Quels surfeurs professionels sont nés en Australie?]]></string>
<string lang="nl"><![CDATA[Welke professionele surfers werden geboren in Australië?]]></string>
<string lang="ro"><![CDATA[Ce surferi profesioniști s-au născut în Australia?]]></string>
<keywords lang="en"><![CDATA[professional surfer, born, Australia]]></keywords>
<keywords lang="de"><![CDATA[Profisurfer, geboren, Australien]]></keywords>
<keywords lang="es"><![CDATA[surfista profesional, nacido, Australia]]></keywords>
<keywords lang="it"><![CDATA[surfista professionista, nato, Australia]]></keywords>
<keywords lang="fr"><![CDATA[surfeurs professionels, Australie]]></keywords>
<keywords lang="nl"><![CDATA[professionele surfer, Australië]]></keywords>
<keywords lang="ro"><![CDATA[surfer profesionist, născut, Australia]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:occupation res:Surfing .  
       { ?uri dbo:birthPlace res:Australia . }
       UNION 
       { ?uri dbo:birthPlace ?x . 
         ?x dbo:country res:Australia . }
} 
]]>
</query>
</question>

<question id="15" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who created Goofy?]]></string>
<string lang="de"><![CDATA[Wer hat Goofy erfunden?]]></string>
<string lang="es"><![CDATA[¿Quién es el creador de Goofy?]]></string>
<string lang="it"><![CDATA[Chi è il creatore di Pippo?]]></string>
<string lang="fr"><![CDATA[Qui est le créateur de Goofy?]]></string>
<string lang="nl"><![CDATA[Wie bedacht Goofy?]]></string>
<string lang="ro"><![CDATA[Cine l-a creat pe Goofy?]]></string>
<keywords lang="en"><![CDATA[created, Goofy]]></keywords>
<keywords lang="de"><![CDATA[erfinden, Goofy]]></keywords>
<keywords lang="es"><![CDATA[creador, Goofy]]></keywords>
<keywords lang="it"><![CDATA[creatore, Pippo]]></keywords>
<keywords lang="fr"><![CDATA[Goofy, créateur]]></keywords>
<keywords lang="nl"><![CDATA[bedenker, Goofy]]></keywords>
<keywords lang="ro"><![CDATA[creat, Goofy]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Goofy dbo:creator ?uri . 
} 
]]>
</query>
</question>

