<?xml version="1.0"?>
<dataset id="qald-5_train">

<question id="171" onlydbo="false" answertype="date" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[When was the Statue of Liberty built?]]></string>
<string lang="de"><![CDATA[Wann wurde die Freiheitsstatue erbaut?]]></string>
<string lang="es"><![CDATA[¿Cuándo fue construída la estatua de la libertad?]]></string>
<string lang="it"><![CDATA[Quando è stata costruita la Statua della Libertà?]]></string>
<string lang="fr"><![CDATA[Quand a-t-été construit la statue de la liberté?]]></string>
<string lang="nl"><![CDATA[Wanneer werd het Vrijheidsbeeld gebouwd?]]></string>
<string lang="ro"><![CDATA[Când a fost construită Statuia Libertății?]]></string>
<keywords lang="en"><![CDATA[Statue of Liberty, built]]></keywords>
<keywords lang="de"><![CDATA[Freiheitsstatue, erbauen]]></keywords>
<keywords lang="es"><![CDATA[estatua de la libertad, construída]]></keywords>
<keywords lang="it"><![CDATA[Statua della Libertà, costruire]]></keywords>
<keywords lang="fr"><![CDATA[statue de la liberté, construit]]></keywords>
<keywords lang="nl"><![CDATA[Vrijheidsbeeld, gebouwd]]></keywords>
<keywords lang="ro"><![CDATA[Statuia Libertății, construit]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?date 
WHERE { 
        res:Statue_of_Liberty dbp:beginningDate ?date . 
} 
]]>
</query>
<answers><answer><![CDATA[1886-10-28+02:00]]></answer></answers></question>

<question id="172" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[In which U.S. state is Fort Knox located?]]></string>
<string lang="de"><![CDATA[In welchem US-Bundesstaat liegt Fort Knox?]]></string>
<string lang="es"><![CDATA[¿En qué estado american se encuentra Fort Knox?]]></string>
<string lang="it"><![CDATA[In quale stato americano si trova Fort Knox?]]></string>
<string lang="fr"><![CDATA[Dans quel état américain se trouve Fort Knox?]]></string>
<string lang="nl"><![CDATA[In welke staat van de Verenigde Staten ligt Fort Knox?]]></string>
<string lang="ro"><![CDATA[În ce stat american este situat Fort Knox?]]></string>
<keywords lang="en"><![CDATA[Fort Knox, located, U.S. state]]></keywords>
<keywords lang="de"><![CDATA[Fort Knox, liegen, US-Bundesstaat]]></keywords>
<keywords lang="es"><![CDATA[Fort Knox, se encuentra, estado americano]]></keywords>
<keywords lang="it"><![CDATA[Fort Knox, trovarsi, stato americano]]></keywords>
<keywords lang="fr"><![CDATA[état américain, Fort Knox]]></keywords>
<keywords lang="nl"><![CDATA[Fort Knox, staat van de Verenigde Staten, ligt]]></keywords>
<keywords lang="ro"><![CDATA[Fort Knox, situat, stat american]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Fort_Knox dbp:location ?uri .  
        ?uri dbo:country res:United_States . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Kentucky]]></answer></answers></question>

<question id="173" onlydbo="true" answertype="number" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[How many children did Benjamin Franklin have?]]></string>
<string lang="de"><![CDATA[Wieviele Kinder hatte Benjamin Franklin?]]></string>
<string lang="es"><![CDATA[¿Cuántos hijos tuvo Benjamin Franklin?]]></string>
<string lang="it"><![CDATA[Quanti figli ebbe Benjamin Franklin?]]></string>
<string lang="fr"><![CDATA[Combien d'enfants Benjamin Franklin avait-il?]]></string>
<string lang="nl"><![CDATA[Hoeveel kinderen had Benjamin Franklin?]]></string>
<string lang="ro"><![CDATA[Câți copii a avut Benjamin Franklin?]]></string>
<keywords lang="en"><![CDATA[Benjamin Franklin, child]]></keywords>
<keywords lang="de"><![CDATA[Benjamin Franklin, Kind]]></keywords>
<keywords lang="es"><![CDATA[Benjamin Franklin, hijos]]></keywords>
<keywords lang="it"><![CDATA[Benjamin Franklin, figlio]]></keywords>
<keywords lang="fr"><![CDATA[nombre d'enfants, Benjamin Franklin]]></keywords>
<keywords lang="nl"><![CDATA[Benjamin Franklin, kinderen, hoeveel]]></keywords>
<keywords lang="ro"><![CDATA[Benjamin Franklin, copil]]></keywords>
<query><![CDATA[ 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT COUNT(DISTINCT ?uri) 
WHERE { 
        res:Benjamin_Franklin dbo:child ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[3]]></answer></answers></question>

<question id="174" onlydbo="true" answertype="date" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[When did Michael Jackson die?]]></string>
<string lang="de"><![CDATA[Wann starb Michael Jackson?]]></string>
<string lang="es"><![CDATA[¿Cuándo murió Michael Jackson?]]></string>
<string lang="it"><![CDATA[Quando è morto Michael Jackson?]]></string>
<string lang="fr"><![CDATA[Quand mourut Michael Jackson?]]></string>
<string lang="nl"><![CDATA[Wanneer overleed Michael Jackson?]]></string>
<string lang="ro"><![CDATA[Când a murit Michael Jackson?]]></string>
<keywords lang="en"><![CDATA[Michael Jackson, die]]></keywords>
<keywords lang="de"><![CDATA[Michael Jackson, gestorben]]></keywords>
<keywords lang="es"><![CDATA[Michael Jackson, muerto]]></keywords>
<keywords lang="it"><![CDATA[Michael Jackson, morto]]></keywords>
<keywords lang="fr"><![CDATA[Michael Jackson, mort]]></keywords>
<keywords lang="nl"><![CDATA[overleden, Michael Jackson]]></keywords>
<keywords lang="ro"><![CDATA[Michael Jackson, muri]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?date 
WHERE { 
        res:Michael_Jackson dbo:deathDate ?date . 
} 
]]>
</query>
<answers><answer><![CDATA[2009-06-25+02:00]]></answer></answers></question>

<question id="176" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[List the children of Margaret Thatcher.]]></string>
<string lang="de"><![CDATA[Liste die Kinder von Margaret Thatcher auf.]]></string>
<string lang="es"><![CDATA[Dame una lista de los hijos de Margaret Thatcher.]]></string>
<string lang="it"><![CDATA[Elenca i figli di Margaret Thatcher.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les enfants de Margaret Thatcher.]]></string>
<string lang="nl"><![CDATA[Noem alle kinderen van Margaret Thatcher.]]></string>
<string lang="ro"><![CDATA[Enumeră copiii lui Margaret Thatcher.]]></string>
<keywords lang="en"><![CDATA[Margaret Thatcher, child]]></keywords>
<keywords lang="de"><![CDATA[Margaret Thatcher, Kind]]></keywords>
<keywords lang="es"><![CDATA[Margaret Thatcher, hijos]]></keywords>
<keywords lang="it"><![CDATA[Margaret Thatcher, figlio]]></keywords>
<keywords lang="fr"><![CDATA[enfants, Margaret Thatcher]]></keywords>
<keywords lang="nl"><![CDATA[kinderen, Margaret Thatcher]]></keywords>
<keywords lang="ro"><![CDATA[Margaret Thatcher, copil]]></keywords>
<query><![CDATA[ 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Margaret_Thatcher dbo:child ?uri . 
} 
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Carol_Thatcher]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mark_Thatcher]]></answer></answers></question>

<question id="177" answertype="resource" onlydbo="false" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who was called Frank The Tank?]]></string>
<string lang="de"><![CDATA[Wer wurde Frank The Tank genannt?]]></string>
<string lang="es"><![CDATA[¿Quién era llamado Frank The Tank?]]></string>
<string lang="it"><![CDATA[Chi venne chiamato Frank The Tank?]]></string>
<string lang="fr"><![CDATA[Qui était surnommé Frank The Tank?]]></string>
<string lang="nl"><![CDATA[Wie werd er Frank The Tank genoemd?]]></string>
<string lang="ro"><![CDATA[Cine era numit Frank The Tank?]]></string>
<keywords lang="en"><![CDATA[called, Frank The Tank]]></keywords>
<keywords lang="de"><![CDATA[nennen, Frank The Tank]]></keywords>
<keywords lang="es"><![CDATA[llamado, Frank The Tank]]></keywords>
<keywords lang="it"><![CDATA[chiamare, Frank The Tank]]></keywords>
<keywords lang="fr"><![CDATA[surnommé, Frank The Tank]]></keywords>
<keywords lang="nl"><![CDATA[Frank The Tank, bijnaam]]></keywords>
<keywords lang="ro"><![CDATA[numit, Frank The Tank]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbp:nickname 'Frank The Tank'@en . 
}
]]>
</query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Frank_Young_(basketball)]]></answer></answers></question>

<question id="178" onlydbo="true" answertype="boolean" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Was Margaret Thatcher a chemist?]]></string>
<string lang="de"><![CDATA[War Margaret Thatcher Chemikerin?]]></string>
<string lang="es"><![CDATA[¿Fue Margaret Thatcher química?]]></string>
<string lang="it"><![CDATA[Margaret Thatcher era un chimico?]]></string>
<string lang="fr"><![CDATA[Margaret Thatcher était-elle une chimiste?]]></string>
<string lang="nl"><![CDATA[Was Margaret Thatcher een chemicus?]]></string>
<string lang="ro"><![CDATA[A fost Margaret Thatcher un chimist?]]></string>
<keywords lang="en"><![CDATA[Margaret Thatcher, chemist]]></keywords>
<keywords lang="de"><![CDATA[Margaret Thatcher, Chemikerin]]></keywords>
<keywords lang="es"><![CDATA[Margret Thatcher, química]]></keywords>
<keywords lang="it"><![CDATA[Margaret Thatcher, chimico]]></keywords>
<keywords lang="fr"><![CDATA[Margaret Thatcher, chimiste]]></keywords>
<keywords lang="nl"><![CDATA[Margaret Thatcher, chemicus]]></keywords>
<keywords lang="ro"><![CDATA[Margaret Thatcher, chimist]]></keywords>
<query><![CDATA[ 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
ASK 
WHERE { 
        res:Margaret_Thatcher dbo:profession res:Chemist . 
} 
]]>
</query>
<answers><answer><![CDATA[true]]></answer></answers></question>


<question aggregation="false" hybrid="false" answertype="boolean" id="179" onlydbo="false">
<string lang="en"><![CDATA[Was Marc Chagall a jew?]]></string>
<string lang="de"><![CDATA[War Marc Chagall ein Jude?]]></string>
<string lang="es"><![CDATA[¿Fué Marc Chagall judío?]]></string>
<string lang="it"><![CDATA[Marc Chagall era ebreo?]]></string>
<string lang="fr"><![CDATA[Etait Marc Chagall juif?]]></string>
<string lang="nl"><![CDATA[Was Marc Chagall joods?]]></string>
<string lang="ro"><![CDATA[A fost Marc Chagall un evreu?]]></string>
<keywords lang="en"><![CDATA[Marc Chagall, jew]]></keywords>
<keywords lang="de"><![CDATA[Marc Chagall, Jude]]></keywords>
<keywords lang="es"><![CDATA[Marc Chagall, judío]]></keywords>
<keywords lang="it"><![CDATA[Marc Chagall, ebreo]]></keywords>
<keywords lang="fr"><![CDATA[Marc Chagall, juif]]></keywords>
<keywords lang="nl"><![CDATA[Marc Chagall, joods]]></keywords>
<keywords lang="ro"><![CDATA[Marc Chagall, evreu]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
       res:Marc_Chagall dbp:ethnicity 'Jewish'@en .
}
]]></query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="18" onlydbo="true">
<string lang="en"><![CDATA[Which museum exhibits The Scream by Munch?]]></string>
<string lang="de"><![CDATA[In welchem Museum ist Der Schrei von Munch ausgestellt?]]></string>
<string lang="es"><![CDATA[¿En qué museo está expuesto el Grito de Munch?]]></string>
<string lang="it"><![CDATA[In quale museo è esposto l'Urlo di Munch?]]></string>
<string lang="fr"><![CDATA[Dans quel musée est exposé Le Cri de Munch?]]></string>
<string lang="nl"><![CDATA[In welk museum hangt De Schreeuw van Munch?]]></string>
<string lang="ro"><![CDATA[În ce muzeu este expus “Strigătul” lui Munch?]]></string>
<keywords lang="en"><![CDATA[museum, Scream, Munch]]></keywords>
<keywords lang="de"><![CDATA[Museum, Schrei, Munch]]></keywords>
<keywords lang="es"><![CDATA[museo, El Grito, Munch]]></keywords>
<keywords lang="it"><![CDATA[museo, l'Urlo, Munch]]></keywords>
<keywords lang="fr"><![CDATA[musée, le Cri, Munch]]></keywords>
<keywords lang="nl"><![CDATA[museum, De Schreeuw, Munch]]></keywords>
<keywords lang="ro"><![CDATA[muzeu, Strigătul, Munch]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
       res:The_Scream dbo:museum ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/National_Gallery_(Norway)]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="180" onlydbo="true">
<string lang="en"><![CDATA[Give me all books by William Goldman with more than 300 pages.]]></string>
<string lang="de"><![CDATA[Gib mir alle Bücher von William Goldman mit mehr als 300 Seiten.]]></string>
<string lang="es"><![CDATA[Dame todos los libros de Wiliam Goldman con más de 300 páginas.]]></string>
<string lang="it"><![CDATA[Dammi tutti i libri di Wiliam Goldman con più di 300 pagine.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les livres de William Goldman avec plus de 300 pages.]]></string>
<string lang="nl"><![CDATA[Geef alle boeken van William Goldman met meer dan 300 pagina's.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate carțile de William Glodman cu mai mult de 300 de pagini.]]></string>
<keywords lang="en"><![CDATA[book, William Goldman, pages, more than 300]]></keywords>
<keywords lang="de"><![CDATA[Buch, William Goldman, Seiten, mehr als 300]]></keywords>
<keywords lang="es"><![CDATA[libro, William Goldman, más de 300 páginas]]></keywords>
<keywords lang="it"><![CDATA[libro, Wiliam Goldman, pagine, più di 300]]></keywords>
<keywords lang="fr"><![CDATA[livres, William Goldman, plus de 300 pages]]></keywords>
<keywords lang="nl"><![CDATA[boeken, William Goldman, meer dan 300 pagina's]]></keywords>
<keywords lang="ro"><![CDATA[carte, William Goldman, pagini, mai mult de 300]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Book .
        ?uri dbo:author res:William_Goldman .
        ?uri dbo:numberOfPages ?x .
        FILTER (?x > 300)
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Wait_Till_Next_Year]]></answer><answer><![CDATA[http://dbpedia.org/resource/Control_(novel)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F]]></answer><answer><![CDATA[http://dbpedia.org/resource/Marathon_Man_(novel)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Brothers_(Goldman_novel)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tinsel_(novel)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Boys_and_Girls_Together]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hype_and_Glory]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Princess_Bride]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Color_of_Light]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="181" onlydbo="true">
<string lang="en"><![CDATA[Which books by Kerouac were published by Viking Press?]]></string>
<string lang="de"><![CDATA[Welche Bücher von Kerouac wurden von Viking Press verlegt?]]></string>
<string lang="es"><![CDATA[¿Qué libros de Kerouac han sido publicados por Viking Press?]]></string>
<string lang="it"><![CDATA[Quali libri di Kerouac furono pubblicati da Viking Press?]]></string>
<string lang="fr"><![CDATA[Quels lives de Kerouac ont été publiés par Viking Press?]]></string>
<string lang="nl"><![CDATA[Welke boeken van Jack Kerouac werden uitgegeven door Viking Press?]]></string>
<string lang="ro"><![CDATA[Ce cărți de Kerouac a fost publicate de Viking Press?]]></string>
<keywords lang="en"><![CDATA[book, Kerouac, publish, Viking Press]]></keywords>
<keywords lang="de"><![CDATA[Buch, Kerouac, verlegen, Viking Press]]></keywords>
<keywords lang="es"><![CDATA[libro, Kerouac, publicado, Viking Press]]></keywords>
<keywords lang="it"><![CDATA[libro, Kerouac, pubblicare, Viking Press]]></keywords>
<keywords lang="fr"><![CDATA[lives de Kerouac, publiés, Viking Press]]></keywords>
<keywords lang="nl"><![CDATA[boek, Jack Kerouac, uitgever, Viking Press]]></keywords>
<keywords lang="ro"><![CDATA[carte, Kerouac, publica, Viking Press]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Book .
        ?uri dbo:publisher res:Viking_Press .
        ?uri dbo:author res:Jack_Kerouac .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/On_the_Road]]></answer><answer><![CDATA[http://dbpedia.org/resource/Door_Wide_Open]]></answer><answer><![CDATA[http://dbpedia.org/resource/References_in_On_the_Road]]></answer><answer><![CDATA[http://dbpedia.org/resource/Atop_an_Underwood:_Early_Stories_and_Other_Writings]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="183" onlydbo="true">
<string lang="en"><![CDATA[How high is the Mount Everest?]]></string>
<string lang="de"><![CDATA[Wie hoch ist der Mount Everest?]]></string>
<string lang="es"><![CDATA[¿Qué alto es el Monte Everest?]]></string>
<string lang="it"><![CDATA[Quanto è alto il Monte Everest?]]></string>
<string lang="fr"><![CDATA[Quelle est l'altitude du Mont Everest?]]></string>
<string lang="nl"><![CDATA[Hoe hoog is de Mount Everest?]]></string>
<string lang="ro"><![CDATA[Ce altitudine are muntele Everest?]]></string>
<keywords lang="en"><![CDATA[Mount Everest, high]]></keywords>
<keywords lang="de"><![CDATA[Mount Everest, hoch]]></keywords>
<keywords lang="es"><![CDATA[Monte Everest, altura]]></keywords>
<keywords lang="it"><![CDATA[Monte Everest, altezza]]></keywords>
<keywords lang="fr"><![CDATA[altitude, Mont Everest]]></keywords>
<keywords lang="nl"><![CDATA[hoogte, Mount Everest]]></keywords>
<keywords lang="ro"><![CDATA[muntele Everest, altitudine]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num 
WHERE {
        res:Mount_Everest dbo:elevation ?num.
}
]]></query>
<answers><answer><![CDATA[8848.0]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="184" onlydbo="false">
<string lang="en"><![CDATA[Who created the comic Captain America?]]></string>
<string lang="de"><![CDATA[Wer hat den Comic Captain America erfunden?]]></string>
<string lang="es"><![CDATA[¿Quién creó el comic Capitán América?]]></string>
<string lang="it"><![CDATA[Chi ha creato il fumetto Capitan America?]]></string>
<string lang="fr"><![CDATA[Qui a créé la bande dessinée Captain America?]]></string>
<string lang="nl"><![CDATA[Wie schreef het stripverhaal Captain America?]]></string>
<string lang="ro"><![CDATA[Cine a creat banda desenată Captain America?]]></string>
<keywords lang="en"><![CDATA[comic, Captain America, create]]></keywords>
<keywords lang="de"><![CDATA[Comic, Captain America, erfinden]]></keywords>
<keywords lang="es"><![CDATA[creador, comic, Capitán América]]></keywords>
<keywords lang="it"><![CDATA[creatore, fumetto, Capitan America]]></keywords>
<keywords lang="fr"><![CDATA[bande dessinée, créer, Captain America]]></keywords>
<keywords lang="nl"><![CDATA[auteur, stripverhaal, Captain America]]></keywords>
<keywords lang="ro"><![CDATA[bandă desenată, Captain America, creat]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:Captain_America dbo:creator ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Jack_Kirby]]></answer><answer><![CDATA[http://dbpedia.org/resource/Joe_Simon]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="185" onlydbo="true">
<string lang="en"><![CDATA[How many people live in the capital of Australia?]]></string>
<string lang="de"><![CDATA[Wieviele Menschen leben in der Hauptstadt Australiens?]]></string>
<string lang="es"><![CDATA[¿Cuánta gente vive en la capital de Australia?]]></string>
<string lang="it"><![CDATA[Quante persone vivono nella capitale dell'Australia?]]></string>
<string lang="fr"><![CDATA[Quel est le nombre d'habitants de la capitale de l'Australie?]]></string>
<string lang="nl"><![CDATA[Hoeveel mensen wonen er in de hoofdstad van Australië?]]></string>
<string lang="ro"><![CDATA[Câți oameni locuiesc in capitala Australiei?]]></string>
<keywords lang="en"><![CDATA[Australia, capital, people, live]]></keywords>
<keywords lang="de"><![CDATA[Australien, Hauptstadt, Menschen, leben]]></keywords>
<keywords lang="es"><![CDATA[Australia, capital, habitantes]]></keywords>
<keywords lang="it"><![CDATA[Australia, capitale, abitanti]]></keywords>
<keywords lang="fr"><![CDATA[nombre d'habitants, capitale, Australie]]></keywords>
<keywords lang="nl"><![CDATA[inwoners, hoofdstad van Australië]]></keywords>
<keywords lang="ro"><![CDATA[Australia, captital, oameni, locui]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num 
WHERE {
        res:Australia dbo:capital ?x .
        ?x dbo:populationTotal ?num .
}
]]></query>
<answers><answer><![CDATA[381488]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="186" onlydbo="true">
<string lang="en"><![CDATA[What is the largest city in Australia?]]></string>
<string lang="de"><![CDATA[Was ist die größte Stadt in Australien?]]></string>
<string lang="es"><![CDATA[¿Cuál es la cuidad más grande de Australia?]]></string>
<string lang="it"><![CDATA[Qual è la città più grande d'Australia?]]></string>
<string lang="fr"><![CDATA[Quelle est la plus grande ville d'Australie?]]></string>
<string lang="nl"><![CDATA[Wat is de grootste stad van Australië?]]></string>
<string lang="ro"><![CDATA[Care este cel mai mare oraș din Australia?]]></string>
<keywords lang="en"><![CDATA[Australia, largest city]]></keywords>
<keywords lang="de"><![CDATA[Australien, größte Stadt]]></keywords>
<keywords lang="es"><![CDATA[Australia, ciudad más grande]]></keywords>
<keywords lang="it"><![CDATA[Australia, città più grande]]></keywords>
<keywords lang="fr"><![CDATA[plus grande ville, Australie]]></keywords>
<keywords lang="nl"><![CDATA[grootste stad, Australië]]></keywords>
<keywords lang="ro"><![CDATA[Australia, cel mai mare oraș]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
       res:Australia dbo:largestCity ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Sydney]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="187" onlydbo="true">
<string lang="en"><![CDATA[Who composed the music for Harold and Maude?]]></string>
<string lang="de"><![CDATA[Wer hat die Musik für Harold und Maude komponiert?]]></string>
<string lang="es"><![CDATA[¿Quién compuso la música para Harold y Maude?]]></string>
<string lang="it"><![CDATA[Chi ha composto la musica per Harold e Maude?]]></string>
<string lang="fr"><![CDATA[Qui a composé la musique de Harold et Maude?]]></string>
<string lang="nl"><![CDATA[Wie componeerde de muziek voor Harold and Maude]]></string>
<string lang="ro"><![CDATA[Cine a compus coloana sonoră pentru Harold și Maude?]]></string>
<keywords lang="en"><![CDATA[Harold and Maude, compose, music]]></keywords>
<keywords lang="de"><![CDATA[Harold und Maude, komponieren, Musik]]></keywords>
<keywords lang="es"><![CDATA[Harold y Maude, música, compositor]]></keywords>
<keywords lang="it"><![CDATA[Harold e Maude, compositore, musica]]></keywords>
<keywords lang="fr"><![CDATA[composé, musique, Harold et Maude]]></keywords>
<keywords lang="nl"><![CDATA[componist, Harold and Maude]]></keywords>
<keywords lang="ro"><![CDATA[Harold și Maude, compune, coloana sonoră]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
       res:Harold_and_Maude dbo:musicComposer ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Cat_Stevens]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" onlydbo="true" id="188">
<string lang="en"><![CDATA[Which films starring Clint Eastwood did he direct himself?]]></string>
<string lang="de"><![CDATA[Bei welchen Filmen mit Clint Eastwood hat er selber Regie geführt?]]></string>
<string lang="es"><![CDATA[¿En qué películas con Clint Eastwood están dirigidas por él mismo?]]></string>
<string lang="it"><![CDATA[Quali film con Clint Eastwoon erano diretti da lui stesso?]]></string>
<string lang="fr"><![CDATA[Dans quels films de Client Eastwood joue Clint Eastwood?]]></string>
<string lang="nl"><![CDATA[Welke films waarin Clint Eastwood speelde, werden ook door hem geregisseerd?]]></string>
<string lang="ro"><![CDATA[Ce film în care Clint Eastwood joacă rolul principal a fost regizat de el însuși?]]></string>
<keywords lang="en"><![CDATA[film, starring, direct, Clint Eastwood]]></keywords>
<keywords lang="de"><![CDATA[Film, Clint Eastwood, Regie]]></keywords>
<keywords lang="es"><![CDATA[películas, Clint Eastwood, director]]></keywords>
<keywords lang="it"><![CDATA[film, recitare, dirigere, Clint Eastwood]]></keywords>
<keywords lang="fr"><![CDATA[films de Client Eastwood où joue Clint Eastwood]]></keywords>
<keywords lang="nl"><![CDATA[film, Clint Eastwood, regisseur, acteur]]></keywords>
<keywords lang="ro"><![CDATA[film, rol principal, regizor, Clint Eastwood]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        ?uri dbo:director res:Clint_Eastwood .
        ?uri dbo:starring res:Clint_Eastwood .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Million_Dollar_Baby]]></answer><answer><![CDATA[http://dbpedia.org/resource/High_Plains_Drifter]]></answer><answer><![CDATA[http://dbpedia.org/resource/Space_Cowboys]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bronco_Billy]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Outlaw_Josey_Wales]]></answer><answer><![CDATA[http://dbpedia.org/resource/Firefox_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Eiger_Sanction_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Unforgiven]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Gauntlet_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Honkytonk_Man]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Rookie_(1990_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/True_Crime_(1999_film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Bridges_of_Madison_County_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pale_Rider]]></answer><answer><![CDATA[http://dbpedia.org/resource/Play_Misty_for_Me]]></answer><answer><![CDATA[http://dbpedia.org/resource/A_Perfect_World]]></answer><answer><![CDATA[http://dbpedia.org/resource/White_Hunter_Black_Heart]]></answer><answer><![CDATA[http://dbpedia.org/resource/Heartbreak_Ridge]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gran_Torino]]></answer><answer><![CDATA[http://dbpedia.org/resource/Blood_Work_(film)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tightrope_(film)]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="189" onlydbo="true">
<string lang="en"><![CDATA[In which city was the former Dutch queen Juliana buried?]]></string>
<string lang="de"><![CDATA[In welcher Stadt wurde die ehemalige niederländische Königin Juliana beerdigt?]]></string>
<string lang="es"><![CDATA[¿En qué ciudad fué enterrada la antigua reina de los países bajos Juliana?]]></string>
<string lang="it"><![CDATA[In quale città fu sepolta la precedente regina dei Paesi Bassi Juliana?]]></string>
<string lang="fr"><![CDATA[Dans quelle ville a-t-été enterré la reine néerlandaise Juliana?]]></string>
<string lang="nl"><![CDATA[In welke stad is de voormalige Nederlandse koningin Juliana bijgezet?]]></string>
<string lang="ro"><![CDATA[În ce oraș a fost înmormântată fosta regină a Olandei, Juliana?]]></string>
<keywords lang="en"><![CDATA[Dutch queen Juliana, burried, city]]></keywords>
<keywords lang="de"><![CDATA[niederländische Königin Juliana, beerdigen, Stadt]]></keywords>
<keywords lang="es"><![CDATA[reina de los países bajos, Juliana, enterrada, ciudad]]></keywords>
<keywords lang="it"><![CDATA[regina dei Paesi Bassi, Juliana, sepolta, città]]></keywords>
<keywords lang="fr"><![CDATA[ville, enterré, reine néerlandaise, Juliana]]></keywords>
<keywords lang="nl"><![CDATA[stad, koningin Juliana, bijzetting]]></keywords>
<keywords lang="ro"><![CDATA[regina Olandei, Juliana, inmormântată, oraș]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        res:Juliana_of_the_Netherlands dbo:restingPlace ?uri.
        ?uri rdf:type dbo:Settlement .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Delft]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="boolean" id="19" onlydbo="true">
<string lang="en"><![CDATA[Is Egypts largest city also its capital?]]></string>
<string lang="de"><![CDATA[Ist Ägyptens größte Stadt auch seine Hauptstadt?]]></string>
<string lang="es"><![CDATA[¿Es la cuidad más grande de Egipto también capital?]]></string>
<string lang="it"><![CDATA[La città più grande dell'Egitto è anche la sua capitale?]]></string>
<string lang="fr"><![CDATA[La ville la plus grande de l'Egypte est-elle sa capitale?]]></string>
<string lang="nl"><![CDATA[Is de grootste stad van Egypte ook de hoofdstad?]]></string>
<string lang="ro"><![CDATA[Orașul cel mai mare din EGipt este și capital sa?]]></string>
<keywords lang="en"><![CDATA[largest city, Egypt, capital]]></keywords>
<keywords lang="de"><![CDATA[größte Stadt, Ägypten, Hauptstadt]]></keywords>
<keywords lang="es"><![CDATA[cuidad más grande, Egipto, capital]]></keywords>
<keywords lang="it"><![CDATA[città più grande, Egitto, capitale]]></keywords>
<keywords lang="fr"><![CDATA[ville plus grande, Egypte, capitale]]></keywords>
<keywords lang="nl"><![CDATA[grootste stad, Egypte, hoofdstad]]></keywords>
<keywords lang="ro"><![CDATA[cel mai mare oraș, Egipt, capitală]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
ASK 
WHERE {
        res:Egypt dbo:largestCity ?large .
        res:Egypt dbo:capital ?capital .
        FILTER (?large = ?capital)
}
]]></query>
<answers><answer><![CDATA[true]]></answer></answers></question>

