<?xml version="1.0" ?>
<dataset id="qald-5_train">

<question id="151" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all islands that belong to Japan.]]></string>
<string lang="de"><![CDATA[Gib mir alle Inseln, die zu Japan gehören.]]></string>
<string lang="es"><![CDATA[Dame todas la islas que pertenezcan a Japón.]]></string>
<string lang="it"><![CDATA[Dammi tutte le isole che appartengono al Giappone.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les îles qui appartiennent aux Japon.]]></string>
<string lang="nl"><![CDATA[Geef alle eilanden die behoren tot Japan.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate insulele care aparțin Japoniei.]]></string>
<keywords lang="en"><![CDATA[islands, Japan]]></keywords>
<keywords lang="de"><![CDATA[Inseln, Japan]]></keywords>
<keywords lang="es"><![CDATA[islias, Japón]]></keywords>
<keywords lang="it"><![CDATA[isole, Giappone]]></keywords>
<keywords lang="fr"><![CDATA[îles, Japon]]></keywords>
<keywords lang="nl"><![CDATA[eilanden, Japan]]></keywords>
<keywords lang="ro"><![CDATA[insule, Japonia]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Island .  
        ?uri dbo:country res:Japan . 
} 
]]>
</query>
</question>

<question id="16" onlydbo="false" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me the capitals of all countries in Africa.]]></string>
<string lang="de"><![CDATA[Gib mir die Haupstädte von allen Ländern in Afrika.]]></string>
<string lang="es"><![CDATA[Dame las capitales de todos los países africanos.]]></string>
<string lang="it"><![CDATA[Dammi le capitali di tutti gli stati dell'Africa.]]></string>
<string lang="fr"><![CDATA[Donnes-moi la capitale de chaque pays d'Afrique.]]></string>
<string lang="nl"><![CDATA[Noem de hoofdsteden van alle landen in Afrika.]]></string>
<string lang="ro"><![CDATA[Dă-mi capitalele tuturor țărilor din Africa.]]></string>
<keywords lang="en"><![CDATA[Africa, country, capital]]></keywords>
<keywords lang="de"><![CDATA[Afrika, Land, Hauptstadt]]></keywords>
<keywords lang="es"><![CDATA[países, africanos, capital]]></keywords>
<keywords lang="it"><![CDATA[Africa, stato, capitale]]></keywords>
<keywords lang="fr"><![CDATA[capitale, pays, Afrique]]></keywords>
<keywords lang="nl"><![CDATA[Africa, land, hoof]]></keywords>
<keywords lang="ro"><![CDATA[Africa, țară, capitală]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX yago: <http://dbpedia.org/class/yago/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?states rdf:type yago:AfricanCountries . 
        ?states dbo:capital ?uri . 
} 
]]>
</query>
</question>

<question id="161" onlydbo="true" answertype="number" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[How many missions does the Soyuz programme have?]]></string>
<string lang="de"><![CDATA[Wieviele Missionen umfasst das Soyuz-Programm?]]></string>
<string lang="es"><![CDATA[¿Cuántas misiones tiene el programa Soyuz?]]></string>
<string lang="it"><![CDATA[Quante missioni ha il programma Sojuz?]]></string>
<string lang="fr"><![CDATA[Donne-moi le nombre de missions Soyouz.]]></string>
<string lang="nl"><![CDATA[Hoeveel missies zijn er in het Soyuz programma?]]></string>
<string lang="ro"><![CDATA[Câte misiuni are programul Soyuz?]]></string>
<keywords lang="en"><![CDATA[how many, mission, Soyuz programme]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Mission, Soyuz-Programm]]></keywords>
<keywords lang="es"><![CDATA[cuántas, misiones, programa Soyuz]]></keywords>
<keywords lang="it"><![CDATA[quante missioni, programma Sojuz]]></keywords>
<keywords lang="fr"><![CDATA[combien, vols, le programme Soyouz]]></keywords>
<keywords lang="nl"><![CDATA[hoeveel, missie, Soyuz programma]]></keywords>
<keywords lang="ro"><![CDATA[câte, misiune, programul Soyuz]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT COUNT(DISTINCT ?uri)
WHERE { 
        ?uri dbp:programme res:Soyuz_programme . 
}  
]]>
</query>
</question>

<question id="162" onlydbo="true" answertype="boolean" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Did Socrates influence Aristotle?]]></string>
<string lang="de"><![CDATA[Hat Sokrates Aristoteles beeinflusst?]]></string>
<string lang="es"><![CDATA[¿Tuvo Sócrates influencia sobre Aristóteles?]]></string>
<string lang="it"><![CDATA[Socrate ha influenzato Aristotele?]]></string>
<string lang="fr"><![CDATA[Socrate a-t-il influencé Aristote?]]></string>
<string lang="nl"><![CDATA[Beïnvloedde Socrates Aristoteles?]]></string>
<string lang="ro"><![CDATA[L-a influențat Socrate pe Aristotel?]]></string>
<keywords lang="en"><![CDATA[Socrates, influence, Aristotle]]></keywords>
<keywords lang="de"><![CDATA[Sokrates, beeinflussen, Aristoteles]]></keywords>
<keywords lang="es"><![CDATA[Sócrates, influencia, Aristóteles]]></keywords>
<keywords lang="it"><![CDATA[Socrate, influenzare, Aristotele]]></keywords>
<keywords lang="fr"><![CDATA[Socrate, influencer, Aristote]]></keywords>
<keywords lang="nl"><![CDATA[beïnvloeden, Socrates, Aristoteles]]></keywords>
<keywords lang="ro"><![CDATA[Socrate, influență, Aristotel]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Socrates dbo:influenced res:Aristotle . 
} 
]]>
</query>
</question>

<question id="163" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Give me all Danish movies.]]></string>
<string lang="de"><![CDATA[Gib mir alle dänischen Filme.]]></string>
<string lang="es"><![CDATA[Dame todas las películas danesas.]]></string>
<string lang="it"><![CDATA[Dammi tutti i film danesi.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les films danois.]]></string>
<string lang="nl"><![CDATA[Noem alle Deense films.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate filmele daneze.]]></string>
<keywords lang="en"><![CDATA[movie, Denmark]]></keywords>
<keywords lang="de"><![CDATA[Film, Dänemark]]></keywords>
<keywords lang="es"><![CDATA[película, Dinamarca]]></keywords>
<keywords lang="it"><![CDATA[film, Danimarca]]></keywords>
<keywords lang="fr"><![CDATA[films, Danemark]]></keywords>
<keywords lang="nl"><![CDATA[film, Denemarken]]></keywords>
<keywords lang="ro"><![CDATA[film, Danemarca]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Film .  
        ?uri dbo:country res:Denmark . 
} 
]]>
</query>
</question>

<question id="165" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which instruments does Cat Stevens play?]]></string>
<string lang="de"><![CDATA[Welche Instrumente spielt Cat Stevens?]]></string>
<string lang="es"><![CDATA[¿Qué instrumentos tocaba Cat Stevens?]]></string>
<string lang="it"><![CDATA[Quali strumenti suona Cat Stevens?]]></string>
<string lang="fr"><![CDATA[Quels instruments joue Cat Stevens?]]></string>
<string lang="nl"><![CDATA[Welke instrumenten speeld Cat Stevens?]]></string>
<string lang="ro"><![CDATA[La ce instrumente cântă Cat Stevens?]]></string>
<keywords lang="en"><![CDATA[Cat Stevens, instrument]]></keywords>
<keywords lang="de"><![CDATA[Cat Stevens, Instrument]]></keywords>
<keywords lang="es"><![CDATA[Cat Stevens, instrumento, tocaba]]></keywords>
<keywords lang="it"><![CDATA[Cat Stevens, strumenti]]></keywords>
<keywords lang="fr"><![CDATA[Cat Stevens, instrument]]></keywords>
<keywords lang="nl"><![CDATA[Cat Stevens, instrument]]></keywords>
<keywords lang="ro"><![CDATA[Cat Stevens, instrument]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Cat_Stevens dbo:instrument ?uri . 
} 
]]>
</query>
</question>

<question id="17" onlydbo="true" answertype="resource" aggregation="true" hybrid="false">
<string lang="en"><![CDATA[Give me all cities in New Jersey with more than 100000 inhabitants.]]></string>
<string lang="de"><![CDATA[Gib mir alle Städte in New Jersey, die mehr als 100000 Einwohner haben.]]></string>
<string lang="es"><![CDATA[Dame todas las cuidades en New Jersey que tengan más de 100000 habitantes.]]></string>
<string lang="it"><![CDATA[Dammi tutte le città del New Jersey con più di 100000 abitanti.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les villes du New Jersey avec plus de 100000 habitants.]]></string>
<string lang="nl"><![CDATA[Geef alle steden in New Jersey met meer dan 100000 inwoners.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate orașele din New Jersey cu mai mult de 100000 de locuitori.]]></string>
<keywords lang="en"><![CDATA[New Jersey, city, inhabitants, more than 100000]]></keywords>
<keywords lang="de"><![CDATA[New Jersey, Stadt, Einwohner, mehr als 100000]]></keywords>
<keywords lang="es"><![CDATA[New Jersey, ciudad, habitantes, más de 100000]]></keywords>
<keywords lang="it"><![CDATA[New Jersey, città, abitanti, più di 100000]]></keywords>
<keywords lang="fr"><![CDATA[New Jersey, villes, habitants, plus de 100000]]></keywords>
<keywords lang="nl"><![CDATA[New Jersey, stad, inwoners, meer dan 100000]]></keywords>
<keywords lang="ro"><![CDATA[New Jersey, oraș, locuitori, mai mult de 100000]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:City .  
        ?uri dbo:isPartOf res:New_Jersey .  
        ?uri dbo:populationTotal ?inhabitants . 
        FILTER (?inhabitants > 100000) . 
} 
]]>
</query>
</question>

<question id="170" onlydbo="true" answertype="boolean" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Is Rita Wilson the wife of Tom Hanks?]]></string>
<string lang="de"><![CDATA[Ist Rita Wilson die Frau von Tom Hanks?]]></string>
<string lang="es"><![CDATA[¿Es Rita Wilson la esposa de Tom Hanks?]]></string>
<string lang="it"><![CDATA[Rita Wilson è la moglie di Tom Hanks?]]></string>
<string lang="fr"><![CDATA[Rita Wilson est-elle l'épouse de Tom Hanks?]]></string>
<string lang="nl"><![CDATA[Is Rita Wilson de vrouw van Tom Hanks?]]></string>
<string lang="ro"><![CDATA[Este Rita Wilson soția lui Tom Hanks?]]></string>
<keywords lang="en"><![CDATA[Rita Wilson, wife, Tom Hanks]]></keywords>
<keywords lang="de"><![CDATA[Rita Wilson, Frau, Tom Hanks]]></keywords>
<keywords lang="es"><![CDATA[Rita Wilson, esposa, Tom Hanks]]></keywords>
<keywords lang="it"><![CDATA[Rita Wilson, moglie, Tom Hanks]]></keywords>
<keywords lang="fr"><![CDATA[Rita Wilson, épouse, Tom Hanks]]></keywords>
<keywords lang="nl"><![CDATA[Rita Wilson, vrouw, Tom Hanks]]></keywords>
<keywords lang="ro"><![CDATA[Rita Wilson, soție, Tom Hanks]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Tom_Hanks dbo:spouse res:Rita_Wilson . 
} 
]]>
</query>
</question>

<question id="175" onlydbo="true" answertype="resource" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Which Chess players died in the same place they were born in?]]></string>
<string lang="de"><![CDATA[Welche Schachspieler starben an den gleichen Orten, an denen sie geboren wurden?]]></string>
<string lang="es"><![CDATA[¿Qué jugadores de ajedrez murieron en sus lugares de nacimiento?]]></string>
<string lang="it"><![CDATA[Quali giocatori di scacchi morirono nel loro luogo di nascita?]]></string>
<string lang="fr"><![CDATA[Quels joueurs d'échecs moururent dans leur ville de naissance?]]></string>
<string lang="nl"><![CDATA[Welke schakers stierven in hun geboorteplaats?]]></string>
<string lang="ro"><![CDATA[Care jucători de șah au murit în același loc în care s-au născut?]]></string>
<keywords lang="en"><![CDATA[chess players, British earl, die, same, place, born]]></keywords>
<keywords lang="de"><![CDATA[Schachspieler, gestorben, gleich, Ort, geboren]]></keywords>
<keywords lang="es"><![CDATA[jugadores de ajedrez, murieron, lugar de nacimiento]]></keywords>
<keywords lang="it"><![CDATA[giocatori di scacchi, morire, stesso, posto, nate]]></keywords>
<keywords lang="fr"><![CDATA[joueurs d'échecs, mort, ville de naissance]]></keywords>
<keywords lang="nl"><![CDATA[schakers, sterf, in geboorteplaats]]></keywords>
<keywords lang="ro"><![CDATA[jucători de șah, British earl, murit, același, loc, născut]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:ChessPlayer .  
        ?uri dbo:birthPlace ?x .  
        ?uri dbo:deathPlace ?y . 
        FILTER (?x = ?y) . 
} 
]]>
</query>
</question>

<question id="177" answertype="resource" onlydbo="false" aggregation="false" hybrid="false">
<string lang="en"><![CDATA[Who was called Frank The Tank?]]></string>
<string lang="de"><![CDATA[Wer wurde Frank The Tank genannt?]]></string>
<string lang="es"><![CDATA[¿Quién era llamado Frank The Tank?]]></string>
<string lang="it"><![CDATA[Chi venne chiamato Frank The Tank?]]></string>
<string lang="fr"><![CDATA[Qui était surnommé Frank The Tank?]]></string>
<string lang="nl"><![CDATA[Wie werd er Frank The Tank genoemd?]]></string>
<string lang="ro"><![CDATA[Cine era numit Frank The Tank?]]></string>
<keywords lang="en"><![CDATA[called, Frank The Tank]]></keywords>
<keywords lang="de"><![CDATA[nennen, Frank The Tank]]></keywords>
<keywords lang="es"><![CDATA[llamado, Frank The Tank]]></keywords>
<keywords lang="it"><![CDATA[chiamare, Frank The Tank]]></keywords>
<keywords lang="fr"><![CDATA[surnommé, Frank The Tank]]></keywords>
<keywords lang="nl"><![CDATA[Frank The Tank, bijnaam]]></keywords>
<keywords lang="ro"><![CDATA[numit, Frank The Tank]]></keywords>
<query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbp:nickname 'Frank The Tank'@en . 
}
]]>
</query>
</question>

<question aggregation="false" hybrid="false" answertype="boolean" id="179" onlydbo="false">
<string lang="en"><![CDATA[Was Marc Chagall a jew?]]></string>
<string lang="de"><![CDATA[War Marc Chagall ein Jude?]]></string>
<string lang="es"><![CDATA[¿Fué Marc Chagall judío?]]></string>
<string lang="it"><![CDATA[Marc Chagall era ebreo?]]></string>
<string lang="fr"><![CDATA[Etait Marc Chagall juif?]]></string>
<string lang="nl"><![CDATA[Was Marc Chagall joods?]]></string>
<string lang="ro"><![CDATA[A fost Marc Chagall un evreu?]]></string>
<keywords lang="en"><![CDATA[Marc Chagall, jew]]></keywords>
<keywords lang="de"><![CDATA[Marc Chagall, Jude]]></keywords>
<keywords lang="es"><![CDATA[Marc Chagall, judío]]></keywords>
<keywords lang="it"><![CDATA[Marc Chagall, ebreo]]></keywords>
<keywords lang="fr"><![CDATA[Marc Chagall, juif]]></keywords>
<keywords lang="nl"><![CDATA[Marc Chagall, joods]]></keywords>
<keywords lang="ro"><![CDATA[Marc Chagall, evreu]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
       res:Marc_Chagall dbp:ethnicity 'Jewish'@en .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="18" onlydbo="true">
<string lang="en"><![CDATA[Which museum exhibits The Scream by Munch?]]></string>
<string lang="de"><![CDATA[In welchem Museum ist Der Schrei von Munch ausgestellt?]]></string>
<string lang="es"><![CDATA[¿En qué museo está expuesto el Grito de Munch?]]></string>
<string lang="it"><![CDATA[In quale museo è esposto l'Urlo di Munch?]]></string>
<string lang="fr"><![CDATA[Dans quel musée est exposé Le Cri de Munch?]]></string>
<string lang="nl"><![CDATA[In welk museum hangt De Schreeuw van Munch?]]></string>
<string lang="ro"><![CDATA[În ce muzeu este expus “Strigătul” lui Munch?]]></string>
<keywords lang="en"><![CDATA[museum, Scream, Munch]]></keywords>
<keywords lang="de"><![CDATA[Museum, Schrei, Munch]]></keywords>
<keywords lang="es"><![CDATA[museo, El Grito, Munch]]></keywords>
<keywords lang="it"><![CDATA[museo, l'Urlo, Munch]]></keywords>
<keywords lang="fr"><![CDATA[musée, le Cri, Munch]]></keywords>
<keywords lang="nl"><![CDATA[museum, De Schreeuw, Munch]]></keywords>
<keywords lang="ro"><![CDATA[muzeu, Strigătul, Munch]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
       res:The_Scream dbo:museum ?uri .
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="boolean" id="19" onlydbo="true">
<string lang="en"><![CDATA[Is Egypts largest city also its capital?]]></string>
<string lang="de"><![CDATA[Ist Ägyptens größte Stadt auch seine Hauptstadt?]]></string>
<string lang="es"><![CDATA[¿Es la cuidad más grande de Egipto también capital?]]></string>
<string lang="it"><![CDATA[La città più grande dell'Egitto è anche la sua capitale?]]></string>
<string lang="fr"><![CDATA[La ville la plus grande de l'Egypte est-elle sa capitale?]]></string>
<string lang="nl"><![CDATA[Is de grootste stad van Egypte ook de hoofdstad?]]></string>
<string lang="ro"><![CDATA[Orașul cel mai mare din EGipt este și capital sa?]]></string>
<keywords lang="en"><![CDATA[largest city, Egypt, capital]]></keywords>
<keywords lang="de"><![CDATA[größte Stadt, Ägypten, Hauptstadt]]></keywords>
<keywords lang="es"><![CDATA[cuidad más grande, Egipto, capital]]></keywords>
<keywords lang="it"><![CDATA[città più grande, Egitto, capitale]]></keywords>
<keywords lang="fr"><![CDATA[ville plus grande, Egypte, capitale]]></keywords>
<keywords lang="nl"><![CDATA[grootste stad, Egypte, hoofdstad]]></keywords>
<keywords lang="ro"><![CDATA[cel mai mare oraș, Egipt, capitală]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
ASK 
WHERE {
        res:Egypt dbo:largestCity ?large .
        res:Egypt dbo:capital ?capital .
        FILTER (?large = ?capital)
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="193" onlydbo="false">
<string lang="en"><![CDATA[Which movies did Kurosawa direct?]]></string>
<string lang="de"><![CDATA[Welche Filme hat Kurosawa gedreht?]]></string>
<string lang="es"><![CDATA[¿Qué películas ha rodado Kurosawa?]]></string>
<string lang="it"><![CDATA[Che film ha diretto Kurosawa?]]></string>
<string lang="fr"><![CDATA[Quels films ont été realisés par Kurosawa?]]></string>
<string lang="nl"><![CDATA[Welke films heeft Kurosawa geregisseerd?]]></string>
<string lang="ro"><![CDATA[Ce filme a regizat Kurosawa?]]></string>
<keywords lang="en"><![CDATA[film, direct, Kurosawa]]></keywords>
<keywords lang="de"><![CDATA[Film, drehen, Kurosawa]]></keywords>
<keywords lang="es"><![CDATA[película, rodada, Kurosawa?]]></keywords>
<keywords lang="it"><![CDATA[film, dirigere, Kurosawa]]></keywords>
<keywords lang="fr"><![CDATA[films, Kurosawa]]></keywords>
<keywords lang="nl"><![CDATA[film, Kurosawa, regisseur]]></keywords>
<keywords lang="ro"><![CDATA[film, regiza, Kurosawa]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:director res:Akira_Kurosawa .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="string" id="196" onlydbo="true">
<string lang="en"><![CDATA[Give me all B-sides of the Ramones.]]></string>
<string lang="de"><![CDATA[Gib mir alle B-Seiten der Ramones.]]></string>
<string lang="es"><![CDATA[Dame todas las caras B de los Ramones.]]></string>
<string lang="it"><![CDATA[Dammi tutti i lati B dei Ramones.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les faces B des Ramones.]]></string>
<string lang="nl"><![CDATA[Geef alle B-kantjes van singles van de Ramones.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate laturile B ale Ramones]]></string>
<keywords lang="en"><![CDATA[Ramones, B-sides]]></keywords>
<keywords lang="de"><![CDATA[Ramones, B-Seiten]]></keywords>
<keywords lang="es"><![CDATA[Ramones, cara B]]></keywords>
<keywords lang="it"><![CDATA[Ramones, lato B]]></keywords>
<keywords lang="fr"><![CDATA[faces B, Ramones]]></keywords>
<keywords lang="nl"><![CDATA[B-kant, single, de Ramones]]></keywords>
<keywords lang="ro"><![CDATA[Ramones, laturi B]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?string 
WHERE {
        ?x dbo:musicalArtist res:Ramones .
        ?x dbo:bSide ?string . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="197" onlydbo="false">
<string lang="en"><![CDATA[Who painted The Storm on the Sea of Galilee?]]></string>
<string lang="de"><![CDATA[Wer malte Christus im Sturm auf dem See von Galilea?]]></string>
<string lang="es"><![CDATA[¿Quién pintó el Cristo en la tormenta en el lago de Galilea?]]></string>
<string lang="it"><![CDATA[Chi dipinse il Cristo nella tempesta sul mare di Galilea?]]></string>
<string lang="fr"><![CDATA[Qui a peint Christ dans la tempête sur la mer de Galilée?]]></string>
<string lang="nl"><![CDATA[Wie schilderde Christus in de storm op het meer van Galilea?]]></string>
<string lang="ro"><![CDATA[Cine a pictat Furtuna pe Marea Galileii?]]></string>
<keywords lang="en"><![CDATA[The Storm on the Sea of Galilee, paint]]></keywords>
<keywords lang="de"><![CDATA[Christus im Sturm auf dem See von Galilea, malen]]></keywords>
<keywords lang="es"><![CDATA[Cristo en la tormenta en el lago de Galilea, pintor]]></keywords>
<keywords lang="it"><![CDATA[Cristo nella tempesta sul mare di Galilea, pittore]]></keywords>
<keywords lang="fr"><![CDATA[peintre, Christ dans la tempête sur la mer de Galilée]]></keywords>
<keywords lang="nl"><![CDATA[schilder, Christus in de storm op het meer van Galilea]]></keywords>
<keywords lang="ro"><![CDATA[Furtuna pe Marea Galileii, picta]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:The_Storm_on_the_Sea_of_Galilee dbo:author ?uri .
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="199" onlydbo="true">
<string lang="en"><![CDATA[For which label did Elvis record his first album?]]></string>
<string lang="de"><![CDATA[Welche Plattenfirma hat Elvis' erstes Album aufgenommen?]]></string>
<string lang="es"><![CDATA[¿Qué discográfica grabó el primer album de Elvis?]]></string>
<string lang="it"><![CDATA[Quale casa discografica ha inciso il primo album di Elvis?]]></string>
<string lang="fr"><![CDATA[Quel est le label discographe qui a publié le premier disque d'Elvis?]]></string>
<string lang="nl"><![CDATA[Bij welk platenlabel verscheen het eerste album van Elvis Presley?]]></string>
<string lang="ro"><![CDATA[Ce casă discografică a înregistrat primul album al lui Elvis?]]></string>
<keywords lang="en"><![CDATA[Elvis, first, album, label]]></keywords>
<keywords lang="de"><![CDATA[Elvis, erstes, Album, Plattenfirma]]></keywords>
<keywords lang="es"><![CDATA[discográfica, primer album de Elvis]]></keywords>
<keywords lang="it"><![CDATA[Elvis, primo, album, casa discografica]]></keywords>
<keywords lang="fr"><![CDATA[label discographe, publié, premier disque, Elvis]]></keywords>
<keywords lang="nl"><![CDATA[platenlabel, eerste album, Elvis]]></keywords>
<keywords lang="ro"><![CDATA[Elvis, prim, album, casă discografică]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?x rdf:type dbo:Album .
        ?x dbo:artist res:Elvis_Presley .
        ?x dbo:releaseDate ?y .
        ?x dbo:recordLabel ?uri .
}
ORDER BY ASC(?y) 
OFFSET 0 LIMIT 1
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="date" id="2" onlydbo="true">
<string lang="en"><![CDATA[Give me the birthdays of all actors of the television show Charmed.]]></string>
<string lang="de"><![CDATA[Gib mir die Geburtstage von allen Darstellern der Fernsehserie Charmed.]]></string>
<string lang="es"><![CDATA[Dame los cumpleaños de los actores de la serie de televisión Charmed.]]></string>
<string lang="it"><![CDATA[Dammi le date dei compleanni di tutti gli attori della serie televisiva Charmed.]]></string>
<string lang="fr"><![CDATA[Donnes-moi les dates de naissance des acteurs de la série télévisée Charmed.]]></string>
<string lang="nl"><![CDATA[Noem de verjaardag van alle acteurs uit de televisieserie Charmed.]]></string>
<string lang="ro"><![CDATA[Dă-mi zilele de naștere a tuturor actorilor din serialul de televiziune Charmed]]></string>
<keywords lang="en"><![CDATA[television show, Charmed, actor, birthday]]></keywords>
<keywords lang="de"><![CDATA[Fernsehserie, Charmed, Darsteller, Geburtstag]]></keywords>
<keywords lang="es"><![CDATA[serie televisiva, Charmed, actores, cumpleaños]]></keywords>
<keywords lang="it"><![CDATA[serie televisiva, Charmed, attore, compleanno]]></keywords>
<keywords lang="fr"><![CDATA[série télévisée, Charmed, acteurs, date de naissance]]></keywords>
<keywords lang="nl"><![CDATA[verjaardag, acteur, televisieserie, Charmed]]></keywords>
<keywords lang="ro"><![CDATA[serial de televiziune, Charmed, actor, zi de naștere]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE { 
        res:Charmed dbo:starring ?actor .
        ?actor dbo:birthDate ?date .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="number" id="20" onlydbo="true">
<string lang="en"><![CDATA[How many employees does IBM have?]]></string>
<string lang="de"><![CDATA[Wieviele Angestellte hat IBM?]]></string>
<string lang="es"><![CDATA[¿Cuántos empleados tiene IBM?]]></string>
<string lang="it"><![CDATA[Quanti dipendenti ha IBM?]]></string>
<string lang="fr"><![CDATA[Combien d'employés a IBM?]]></string>
<string lang="nl"><![CDATA[Hoeveel medewerkers heeft IBM?]]></string>
<string lang="ro"><![CDATA[Câți angajați are IBM?]]></string>
<keywords lang="en"><![CDATA[IBM, employees]]></keywords>
<keywords lang="de"><![CDATA[IBM, Angestellte]]></keywords>
<keywords lang="es"><![CDATA[IBM, empleados]]></keywords>
<keywords lang="it"><![CDATA[IBM, dipendenti]]></keywords>
<keywords lang="fr"><![CDATA[employés, IBM]]></keywords>
<keywords lang="nl"><![CDATA[medewerkers, IBM]]></keywords>
<keywords lang="ro"><![CDATA[IBM, angajați]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?number 
WHERE {
        res:IBM dbo:numberOfEmployees ?number .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="21" onlydbo="false">
<string lang="en"><![CDATA[Which states border Illinois?]]></string>
<string lang="de"><![CDATA[Welche Staaten grenzen an Illinois?]]></string>
<string lang="es"><![CDATA[¿Qué estados tienen frontera con Illinois?]]></string>
<string lang="it"><![CDATA[Con quali stati confina l'Illinois?]]></string>
<string lang="fr"><![CDATA[Quels sont les états voisins de l'Illinois?]]></string>
<string lang="nl"><![CDATA[Welke staten grenzen aan Illinois?]]></string>
<string lang="ro"><![CDATA[Ce state formează granite cu Illinois?]]></string>
<keywords lang="en"><![CDATA[state, border, Illinois]]></keywords>
<keywords lang="de"><![CDATA[Staat, angrenzen, Illinois]]></keywords>
<keywords lang="es"><![CDATA[estado, frontera, Illinois]]></keywords>
<keywords lang="it"><![CDATA[stati, confine, Illinois]]></keywords>
<keywords lang="fr"><![CDATA[états voisins, Illinois]]></keywords>
<keywords lang="nl"><![CDATA[staat, grenzen aan, Illinois]]></keywords>
<keywords lang="ro"><![CDATA[stat, granite, Illinois]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri 
WHERE {
        res:Illinois dbp:borderingstates ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="22" onlydbo="true">
<string lang="en"><![CDATA[In which country is the Limerick Lake?]]></string>
<string lang="de"><![CDATA[In welchem Land befindet sich der Limerick Lake?]]></string>
<string lang="es"><![CDATA[¿En qué país se encuentra el lago Limerick?]]></string>
<string lang="it"><![CDATA[In quale stato si trova il lago Limerick?]]></string>
<string lang="fr"><![CDATA[Dans quel pays se trouve le lac Limerick?]]></string>
<string lang="nl"><![CDATA[In welk land ligt Limerick Lake?]]></string>
<string lang="ro"><![CDATA[În ce țară este lacul Limerick?]]></string>
<keywords lang="en"><![CDATA[Limerick Lake, country]]></keywords>
<keywords lang="de"><![CDATA[Limerick Lake, Land]]></keywords>
<keywords lang="es"><![CDATA[lago Limerick, país]]></keywords>
<keywords lang="it"><![CDATA[lago Limerick, stato]]></keywords>
<keywords lang="fr"><![CDATA[pays, lac Limerick]]></keywords>
<keywords lang="nl"><![CDATA[Limerick Lake, land]]></keywords>
<keywords lang="ro"><![CDATA[lacul Limerick, țară]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        res:Limerick_Lake dbo:country ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="23" onlydbo="true">
<string lang="en"><![CDATA[Which television shows were created by John Cleese?]]></string>
<string lang="de"><![CDATA[Welche Fernsehserien hat John Cleese entworfen?]]></string>
<string lang="es"><![CDATA[¿Qué series televisivas ideó John Cleese?]]></string>
<string lang="it"><![CDATA[Quali serie televisive sono state create dalla John Cleese?]]></string>
<string lang="fr"><![CDATA[Quelles séries télevisées ont été créées par John Cleese?]]></string>
<string lang="nl"><![CDATA[Welke televisieseries werden bedacht door John Cleese?]]></string>
<string lang="ro"><![CDATA[Ce seriale de televiziune au fost create de John Cleese?]]></string>
<keywords lang="en"><![CDATA[television show, create, John Cleese]]></keywords>
<keywords lang="de"><![CDATA[Fernsehserie, entwerfen, John Cleese]]></keywords>
<keywords lang="es"><![CDATA[serie televisica, ideó, John Cleese]]></keywords>
<keywords lang="it"><![CDATA[serie televisiva, ideata, John Cleese?]]></keywords>
<keywords lang="fr"><![CDATA[séries télevisées, créées, John Cleese]]></keywords>
<keywords lang="nl"><![CDATA[televisieserie, bedacht, John Cleese]]></keywords>
<keywords lang="ro"><![CDATA[serial de televiziune, creat, John Cleese]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:TelevisionShow .
        ?uri dbo:creator res:John_Cleese .
}
]]></query>
</question>

