<?xml version="1.0" ?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="44" onlydbo="true">
<string lang="en"><![CDATA[Who designed the Brooklyn Bridge?]]></string>
<string lang="de"><![CDATA[Wer hat die Brooklyn Bridge entworfen?]]></string>
<string lang="es"><![CDATA[¿Quién diseñó la Brooklyn Bridge?]]></string>
<string lang="it"><![CDATA[Chi ha progettato il ponte di Brooklyn?]]></string>
<string lang="fr"><![CDATA[Qui a conçu le pont de Brooklyn?]]></string>
<string lang="nl"><![CDATA[Wie ontwierp de Brooklyn Bridge?]]></string>
<string lang="ro"><![CDATA[Cine a proiectat podul din Brooklyn?]]></string>
<keywords lang="en"><![CDATA[Brooklyn Bridge, design]]></keywords>
<keywords lang="de"><![CDATA[Brooklyn Bridge, entwerfen]]></keywords>
<keywords lang="es"><![CDATA[diseñador, Brooklyn Bridge]]></keywords>
<keywords lang="it"><![CDATA[ponte di Brooklyn, progettare]]></keywords>
<keywords lang="fr"><![CDATA[pont de Brooklyn, conçu]]></keywords>
<keywords lang="nl"><![CDATA[ontwerp, Brooklyn Bridge]]></keywords>
<keywords lang="ro"><![CDATA[podul din Brooklyn, proiecta]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
        res:Brooklyn_Bridge dbo:architect ?uri .
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="boolean" id="46" onlydbo="true">
<string lang="en"><![CDATA[Is Frank Herbert still alive?]]></string>
<string lang="de"><![CDATA[Lebt Frank Herbert noch?]]></string>
<string lang="es"><![CDATA[¿Todavía vive Frank Herbert?]]></string>
<string lang="it"><![CDATA[Frank Herbert è ancora vivo?]]></string>
<string lang="fr"><![CDATA[Frank Herbert est-il encore en vie?]]></string>
<string lang="nl"><![CDATA[Leeft Frank Herbert nog?]]></string>
<string lang="ro"><![CDATA[Este Frank Herbert încă în viață?]]></string>
<keywords lang="en"><![CDATA[Frank Herbert, alive]]></keywords>
<keywords lang="de"><![CDATA[Frank Herbert, leben]]></keywords>
<keywords lang="es"><![CDATA[Frank Herbert, vive]]></keywords>
<keywords lang="it"><![CDATA[Frank Herbert, vivente]]></keywords>
<keywords lang="fr"><![CDATA[Frank Herbert, en vie]]></keywords>
<keywords lang="nl"><![CDATA[Frank Herbert, leeft]]></keywords>
<keywords lang="ro"><![CDATA[Frak Herbert, în viață]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        OPTIONAL { res:Frank_Herbert dbo:deathDate ?date . }
        FILTER (!BOUND(?date))
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="47" onlydbo="false">
<string lang="en"><![CDATA[What is the highest place of the Urals?]]></string>
<string lang="de"><![CDATA[Was ist die höhchste Stelle des Ural?]]></string>
<string lang="es"><![CDATA[¿Cuál es el punto más alto del montes Urales?]]></string>
<string lang="it"><![CDATA[Qual è il punto più alto del Uràli?]]></string>
<string lang="fr"><![CDATA[Quel est l'endroit le plus haut d'Oural?]]></string>
<string lang="nl"><![CDATA[Wat is het hoogste punt van de Oeral?]]></string>
<string lang="ro"><![CDATA[Care este cel mai înalt punct de pe munții Urali?]]></string>
<keywords lang="en"><![CDATA[Urals, highest place]]></keywords>
<keywords lang="de"><![CDATA[Ural, höchste Stelle]]></keywords>
<keywords lang="es"><![CDATA[los montes Urales, punto más alto]]></keywords>
<keywords lang="it"><![CDATA[Uràli, punto più alto]]></keywords>
<keywords lang="fr"><![CDATA[l'Oural, endroit le plus haut]]></keywords>
<keywords lang="nl"><![CDATA[Oeral, hoogste punt]]></keywords>
<keywords lang="ro"><![CDATA[munții Urali, cel mai înalt punct]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {       
        res:Ural_Mountains dbp:highest ?uri .  
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="48" onlydbo="true">
<string lang="en"><![CDATA[Who is the editor of Forbes?]]></string>
<string lang="de"><![CDATA[Wer ist der Herausgeber von Forbes?]]></string>
<string lang="es"><![CDATA[¿Quién es el editor de Forbes?]]></string>
<string lang="it"><![CDATA[Chi è l'editore di Forbes?]]></string>
<string lang="fr"><![CDATA[Qui est le rédacteur en chef de Forbes?]]></string>
<string lang="nl"><![CDATA[Wie is de uitgever van Forbes.]]></string>
<string lang="ro"><![CDATA[Cine este editorul Forbes?]]></string>
<keywords lang="en"><![CDATA[Forbes, editor]]></keywords>
<keywords lang="de"><![CDATA[Forbes, Herausgeber]]></keywords>
<keywords lang="es"><![CDATA[Forbes, editor]]></keywords>
<keywords lang="it"><![CDATA[Forbes, editore]]></keywords>
<keywords lang="fr"><![CDATA[Forbes, rédacteur en chef]]></keywords>
<keywords lang="nl"><![CDATA[Forbes, uitgever]]></keywords>
<keywords lang="ro"><![CDATA[Forbes, editor]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
        res:Forbes dbo:editor ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="49" onlydbo="false">
<string lang="en"><![CDATA[Give me all companies in the advertising industry.]]></string>
<string lang="de"><![CDATA[Gib mir alle Unternehmen, die in der Werbebranche tätig sind.]]></string>
<string lang="es"><![CDATA[Dame todas las empresas publicitarias.]]></string>
<string lang="it"><![CDATA[Dammi tutte le aziende pubblicitarie.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les agences de publicité.]]></string>
<string lang="nl"><![CDATA[Noem alle bedrijven die in de reclamebranche actief zijn.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate companiile din industria publicitară.]]></string>
<keywords lang="en"><![CDATA[company, advertising industry]]></keywords>
<keywords lang="de"><![CDATA[Unternehmen, Werbebranche]]></keywords>
<keywords lang="es"><![CDATA[empresas publicitarias]]></keywords>
<keywords lang="it"><![CDATA[aziende pubblicitarie]]></keywords>
<keywords lang="fr"><![CDATA[agences de publicité]]></keywords>
<keywords lang="nl"><![CDATA[bedrijf, reclamebranche]]></keywords>
<keywords lang="ro"><![CDATA[companii, industria publicitară]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?uri)
WHERE { 
        ?uri rdf:type dbo:Company  .
      { ?uri dbo:industry res:Advertising } 
      UNION 
      { ?uri dbo:industry ?industry . 
        FILTER regex(?industry,'advertising','i') . }
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="number" id="5" onlydbo="false">
<string lang="en"><![CDATA[How many countries are there in Europe?]]></string>
<string lang="de"><![CDATA[Wieviele Länder gibt es in Europa?]]></string>
<string lang="es"><![CDATA[¿Cuántos países existen en Europa?]]></string>
<string lang="it"><![CDATA[Quanti stati ci sono in Europa?]]></string>
<string lang="fr"><![CDATA[Combien de pays sont-il en Europe?]]></string>
<string lang="nl"><![CDATA[Hoeveel landen zijn er in Europa?]]></string>
<string lang="ro"><![CDATA[Câte țări sunt în Europa?]]></string>
<keywords lang="en"><![CDATA[Europe, countries]]></keywords>
<keywords lang="de"><![CDATA[Europa, Länder]]></keywords>
<keywords lang="es"><![CDATA[Europa, países]]></keywords>
<keywords lang="it"><![CDATA[Europa, stati]]></keywords>
<keywords lang="fr"><![CDATA[Europe, pays]]></keywords>
<keywords lang="nl"><![CDATA[Europa, landen]]></keywords>
<keywords lang="ro"><![CDATA[Europa, țări]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?uri) 
WHERE {
        ?uri rdf:type yago:EuropeanCountries .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="50" onlydbo="true">
<string lang="en"><![CDATA[What did Bruce Carver die from?]]></string>
<string lang="de"><![CDATA[Woran ist Bruce Carver gestorben?]]></string>
<string lang="es"><![CDATA[¿De qué murió Bruce Carver?]]></string>
<string lang="it"><![CDATA[Di cosa è morto Bruce Carver?]]></string>
<string lang="fr"><![CDATA[Quel est la cause de décès de Bruce Carver?]]></string>
<string lang="nl"><![CDATA[Waaraan overleed Bruce Carver?]]></string>
<string lang="ro"><![CDATA[Din ce cauză a murit Bruce Carver?]]></string>
<keywords lang="en"><![CDATA[Bruce Carver, die]]></keywords>
<keywords lang="de"><![CDATA[Bruce Carver, gestorben an]]></keywords>
<keywords lang="es"><![CDATA[Bruce Caver, muerte]]></keywords>
<keywords lang="it"><![CDATA[Bruce Caver, morire]]></keywords>
<keywords lang="fr"><![CDATA[cause de décès, Bruce Carver]]></keywords>
<keywords lang="nl"><![CDATA[Bruce Carver, gestorven aan]]></keywords>
<keywords lang="ro"><![CDATA[Bruce Carver, muri]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri
WHERE {
        res:Bruce_Carver dbo:deathCause ?uri .     
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="51" onlydbo="false">
<string lang="en"><![CDATA[Give me all libraries established earlier than 1400.]]></string>
<string lang="de"><![CDATA[Gib mir alle Bibliotheken, die vor 1400 gegründet worden.]]></string>
<string lang="es"><![CDATA[Dame todas las bibliotecas que fueron establecidas antes de 1400.]]></string>
<string lang="it"><![CDATA[Dammi tutte le biblioteche fondate prima del 1400.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les bibliothèques établies avant 1400.]]></string>
<string lang="nl"><![CDATA[Geef me alle bibliotheken die voor 1400 werden opgericht.]]></string>
<string lang="ro"><![CDATA[Dă-mi tote bibliotecile înființate înainte de 1400]]></string>
<keywords lang="en"><![CDATA[libraries, established, earlier than 1400]]></keywords>
<keywords lang="de"><![CDATA[Bibliotheken, gegründet, vor 1400]]></keywords>
<keywords lang="es"><![CDATA[bibliotecas, establecidas, antes de 1400]]></keywords>
<keywords lang="it"><![CDATA[biblioteche, fondate, prima del 1400]]></keywords>
<keywords lang="fr"><![CDATA[bibliothèques, établies, avant 1400]]></keywords>
<keywords lang="nl"><![CDATA[bibliotheken, opgericht, voor 1400]]></keywords>
<keywords lang="ro"><![CDATA[biblioteci, înființat, înainte de 1400]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Library .
        ?uri dbp:established ?year . 
        FILTER (?year < 1400)
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="52" onlydbo="true">
<string lang="en"><![CDATA[Which presidents were born in 1945?]]></string>
<string lang="de"><![CDATA[Welche Präsidenten wurden 1945 geboren?]]></string>
<string lang="es"><![CDATA[¿Qué presidentes nacieron en 1945?]]></string>
<string lang="it"><![CDATA[Quali presidenti sono nati nel 1945?]]></string>
<string lang="fr"><![CDATA[Quels présidents sont nés en 1945?]]></string>
<string lang="nl"><![CDATA[Welke presidenten werden geboren in 1945?]]></string>
<string lang="ro"><![CDATA[Ce președinți au fost născuți în 1945]]></string>
<keywords lang="en"><![CDATA[president, born, 1945]]></keywords>
<keywords lang="de"><![CDATA[Präsident, geboren, 1945]]></keywords>
<keywords lang="es"><![CDATA[presidentes nacidos 1945]]></keywords>
<keywords lang="it"><![CDATA[presidente, nato, 1945]]></keywords>
<keywords lang="fr"><![CDATA[présidents, nés, 1945]]></keywords>
<keywords lang="nl"><![CDATA[president, geboren, 1945]]></keywords>
<keywords lang="ro"><![CDATA[președinte, născut, 1945]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:President . 
        ?uri dbo:birthDate ?date .
        FILTER regex(?date, '^1945') .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="53" onlydbo="true">
<string lang="en"><![CDATA[Give me all federal chancellors of Germany.]]></string>
<string lang="de"><![CDATA[Gib mir alle Bundeskanzler.]]></string>
<string lang="es"><![CDATA[Dame todos los cancilleres alemanos.]]></string>
<string lang="it"><![CDATA[Dammi tutti i cancellieri tedeschi.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les chancelièrs allemands.]]></string>
<string lang="nl"><![CDATA[Noem alle Duitse bondskanseliers.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți cancelarii federali ai Germaniei]]></string>
<keywords lang="en"><![CDATA[Germany, federal chancellors]]></keywords>
<keywords lang="de"><![CDATA[Bundeskanzler]]></keywords>
<keywords lang="es"><![CDATA[cancilleres, alemanos]]></keywords>
<keywords lang="it"><![CDATA[cancellieri, tedeschi]]></keywords>
<keywords lang="fr"><![CDATA[chanceliers, allemands]]></keywords>
<keywords lang="nl"><![CDATA[Duits, bondskanseliers]]></keywords>
<keywords lang="ro"><![CDATA[Germania, cancelar federal]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
          ?uri rdf:type dbo:Person .
        { ?uri dbo:office 'Chancellor of Germany' . }
        UNION
        { ?uri dbp:office res:Chancellor_of_Germany . }
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="54" onlydbo="true">
<string lang="en"><![CDATA[Who was the wife of U.S. president Lincoln?]]></string>
<string lang="de"><![CDATA[Wer war die Frau von US-Präsident Lincoln?]]></string>
<string lang="es"><![CDATA[¿Quién fué la mujer del presidente americano Lincoln?]]></string>
<string lang="it"><![CDATA[Chi era la moglie del presidente degli Stati Uniti Lincoln?]]></string>
<string lang="fr"><![CDATA[Qui était l'épouse du président américain Lincoln?]]></string>
<string lang="nl"><![CDATA[Wie was de vrouw van de Amerikaanse president Lincoln?]]></string>
<string lang="ro"><![CDATA[Cine a fost soția președintelui American Lincoln?]]></string>
<keywords lang="en"><![CDATA[U.S. president, Lincoln, wife]]></keywords>
<keywords lang="de"><![CDATA[US-Präsident, Lincoln, Frau]]></keywords>
<keywords lang="es"><![CDATA[presidente Americano, Lincoln, mujer]]></keywords>
<keywords lang="it"><![CDATA[presidente degli Stati Uniti, Lincoln, moglie]]></keywords>
<keywords lang="fr"><![CDATA[épouse, président américain Lincoln]]></keywords>
<keywords lang="nl"><![CDATA[vrouw, president van America, Lincoln]]></keywords>
<keywords lang="ro"><![CDATA[președinte American, Lincoln, soție]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:Abraham_Lincoln dbo:spouse ?uri.
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="55" onlydbo="true">
<string lang="en"><![CDATA[Who developed the video game World of Warcraft?]]></string>
<string lang="de"><![CDATA[Wer hat das Videospiel World of Warcraft entwickelt?]]></string>
<string lang="es"><![CDATA[¿Quién desarrolló el videojuego Warcraft?]]></string>
<string lang="it"><![CDATA[Chi ha creato il videogioco World of Warcraft?]]></string>
<string lang="fr"><![CDATA[Qui a développé World of Warcraft?]]></string>
<string lang="nl"><![CDATA[Wie heeft het videospel World of Warcraft ontwikkeld?]]></string>
<string lang="ro"><![CDATA[Cine a dezvoltat jocul video World of Warcraft?]]></string>
<keywords lang="en"><![CDATA[video game, World of Warcraft, develop]]></keywords>
<keywords lang="de"><![CDATA[Videospiel, World of Warcraft, entwickeln]]></keywords>
<keywords lang="es"><![CDATA[videojuego, Warcraft, desarrollar]]></keywords>
<keywords lang="it"><![CDATA[videogioco, World of Warcraft, creare]]></keywords>
<keywords lang="fr"><![CDATA[développé, World of Warcraft]]></keywords>
<keywords lang="nl"><![CDATA[World of Warcraft, ontwikkelaar]]></keywords>
<keywords lang="ro"><![CDATA[joc video, World of Warcraft, dezvolta]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:World_of_Warcraft dbo:developer ?uri . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="string" id="56" onlydbo="false">
<string lang="en"><![CDATA[What is the official website of Tom Cruise?]]></string>
<string lang="de"><![CDATA[Was ist die offizielle Website von Tom Cruise?]]></string>
<string lang="es"><![CDATA[¿Cuál el la página de Web oficial de Tom Cruise?]]></string>
<string lang="it"><![CDATA[Qual è il sito internet ufficiale di Tom Cruise?]]></string>
<string lang="fr"><![CDATA[Quel est le site web officiel de Tom Cruise?]]></string>
<string lang="nl"><![CDATA[Wat is de officiële website van Tom Cruise?]]></string>
<string lang="ro"><![CDATA[Care este website-ul oficial al lui Tom Cruise?]]></string>
<keywords lang="en"><![CDATA[Tom Cruise, official website]]></keywords>
<keywords lang="de"><![CDATA[Tom Cruise, offizielle Website]]></keywords>
<keywords lang="es"><![CDATA[Tom Cruise, página de Web oficial]]></keywords>
<keywords lang="it"><![CDATA[Tom Cruise, sito internet ufficiale]]></keywords>
<keywords lang="fr"><![CDATA[site web officiel, Tom Cruise]]></keywords>
<keywords lang="nl"><![CDATA[officiële website, Tom Cruise]]></keywords>
<keywords lang="ro"><![CDATA[Tom Cruise, website oficial]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?string 
WHERE { 
        res:Tom_Cruise dbp:website ?string .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="57" onlydbo="true">
<string lang="en"><![CDATA[List all episodes of the first season of the HBO television series The Sopranos.]]></string>
<string lang="de"><![CDATA[Liste alle Episoden der ersten Staffel der HBO-Fernsehserie Die Sopranos auf.]]></string>
<string lang="es"><![CDATA[Dame todos los episodios de la prímera época de la serie de HBO Los Sporanos.]]></string>
<string lang="it"><![CDATA[Elenca tutti gli episodi della prima stagione della serie televisiva di HBO i Sopranos.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les épisodes de la première saison de la série télévisée de HBO les Sopranos.]]></string>
<string lang="nl"><![CDATA[Noem alle afleveringen van het eerste seizoen van de HBO-serie The Sopranos.]]></string>
<string lang="ro"><![CDATA[Listează toate episodele din primul sezon al serialului HBO de televiziune The Sopranos]]></string>
<keywords lang="en"><![CDATA[HBO, television series, Sopranos, first season, episode]]></keywords>
<keywords lang="de"><![CDATA[HBO-Fernsehserie, Sopranos, erste Staffel, Episode]]></keywords>
<keywords lang="es"><![CDATA[serie televisiva de HBO, Los Sopranos, primera época, episodios]]></keywords>
<keywords lang="it"><![CDATA[serie televisiva di HBO, i Sopranos, prima stagione, episodio]]></keywords>
<keywords lang="fr"><![CDATA[épisodes de la première saison, HBO, les Sopranos]]></keywords>
<keywords lang="nl"><![CDATA[HBO-serie, The Sopranos, eerste seizoen, aflevering]]></keywords>
<keywords lang="ro"><![CDATA[HBO, serial de televiziune, Sopranos, primul sezon, episod]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        ?uri dbo:series res:The_Sopranos  .
        ?uri dbo:seasonNumber 1 .
}
]]></query>
</question>

<question aggregation="true" hybrid="false" answertype="resource" id="58" onlydbo="true">
<string lang="en"><![CDATA[Who produced the most films?]]></string>
<string lang="de"><![CDATA[Wer hat die meisten Filme produziert?]]></string>
<string lang="es"><![CDATA[¿Quién ha producido más películas?]]></string>
<string lang="it"><![CDATA[Chi ha prodotto più film?]]></string>
<string lang="fr"><![CDATA[Qui a produit le plus de films?]]></string>
<string lang="nl"><![CDATA[Wie produceerde de meeste films?]]></string>
<string lang="ro"><![CDATA[Cine a produs cele mai multe filme?]]></string>
<keywords lang="en"><![CDATA[film, produced, most]]></keywords>
<keywords lang="de"><![CDATA[Film, produzieren, die meisten]]></keywords>
<keywords lang="es"><![CDATA[películas, producido más]]></keywords>
<keywords lang="it"><![CDATA[film, prodotto, più]]></keywords>
<keywords lang="fr"><![CDATA[films, le plus de]]></keywords>
<keywords lang="nl"><![CDATA[producent, films, de meeste]]></keywords>
<keywords lang="ro"><![CDATA[film, produs, cel mai mult]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?film rdf:type dbo:Film .
        ?film dbo:producer ?uri .
} 
ORDER BY DESC(COUNT(?film)) 
OFFSET 0 LIMIT 1
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="59" onlydbo="false">
<string lang="en"><![CDATA[Give me all people with first name Jimmy.]]></string>
<string lang="de"><![CDATA[Gib mir alle Personen, die den Vornamen Jimmy haben.]]></string>
<string lang="es"><![CDATA[Dame todas las personas con el nombre propio Jimmy.]]></string>
<string lang="it"><![CDATA[Dammi tutte le persone il cui nome è Jimmy.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les personnes dont le prénom est Jimmy.]]></string>
<string lang="nl"><![CDATA[Noem alle personen met de voornaam Jimmy.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate persoanele cu prenumele Jimmy]]></string>
<keywords lang="en"><![CDATA[person, first name, Jimmy]]></keywords>
<keywords lang="de"><![CDATA[Person, Vorname, Jimmy]]></keywords>
<keywords lang="es"><![CDATA[personas, nombre propio, Jimmy]]></keywords>
<keywords lang="it"><![CDATA[persone, nome, Jimmy]]></keywords>
<keywords lang="fr"><![CDATA[personnes, prénom, Jimmy]]></keywords>
<keywords lang="nl"><![CDATA[persoon, voornaam, Jimmy]]></keywords>
<keywords lang="ro"><![CDATA[persoană, prenume, Jimmy]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type foaf:Person .  
        ?uri foaf:givenName 'Jimmy'@en .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="6" onlydbo="true">
<string lang="en"><![CDATA[In which city did John F. Kennedy die?]]></string>
<string lang="de"><![CDATA[In welcher Stadt ist John F. Kennedy gestorben?]]></string>
<string lang="es"><![CDATA[¿En qué ciudad murió John F. Kennedy?]]></string>
<string lang="it"><![CDATA[In quale città morì John F. Kennedy?]]></string>
<string lang="fr"><![CDATA[Dans quelle ville est mort John F. Kennedy?]]></string>
<string lang="nl"><![CDATA[In welke stad kwam John F. Kennedy om het leven?]]></string>
<string lang="ro"><![CDATA[În ce oraș a murit John F. Kennedy?]]></string>
<keywords lang="en"><![CDATA[city, John F. Kennedy, die]]></keywords>
<keywords lang="de"><![CDATA[Stadt, John F. Kennedy, gestorben]]></keywords>
<keywords lang="es"><![CDATA[cuidad, John F. Kennedy, murió]]></keywords>
<keywords lang="it"><![CDATA[città, John F. Kennedy, morto]]></keywords>
<keywords lang="fr"><![CDATA[ville, John F. Kennedy]]></keywords>
<keywords lang="nl"><![CDATA[stad, John F. Kennedy, gestorven]]></keywords>
<keywords lang="ro"><![CDATA[oraș, John F. Kennedy, muri]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE { 
        res:John_F._Kennedy dbo:deathPlace ?uri .
        ?uri rdf:type dbo:City .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="boolean" id="60" onlydbo="true">
<string lang="en"><![CDATA[Is there a video game called Battle Chess?]]></string>
<string lang="de"><![CDATA[Gibt es ein Videospiel, das Battle Chess heißt?]]></string>
<string lang="es"><![CDATA[¿Hay algún videojuego que se llame Battle Chess?]]></string>
<string lang="it"><![CDATA[Esiste un videogioco che si chiama Battle Chess?]]></string>
<string lang="fr"><![CDATA[Existe-t-il un jeu vidéo appelé Battle Chess?]]></string>
<string lang="nl"><![CDATA[Bestaat er een videospel met de naam Battle Chess?]]></string>
<string lang="ro"><![CDATA[Există un joc video numit Battle Chess?]]></string>
<keywords lang="en"><![CDATA[video game, Battle Chess]]></keywords>
<keywords lang="de"><![CDATA[Videospiel, Battle Chess]]></keywords>
<keywords lang="es"><![CDATA[videojuego, Battle Chess]]></keywords>
<keywords lang="it"><![CDATA[videogioco, Battle Chess]]></keywords>
<keywords lang="fr"><![CDATA[jeu vidéo, Battle Chess]]></keywords>
<keywords lang="nl"><![CDATA[videospel, Battle Chess]]></keywords>
<keywords lang="ro"><![CDATA[joc video, Battle Chess]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
ASK 
WHERE {
        ?uri rdf:type dbo:VideoGame .
        ?uri rdfs:label 'Battle Chess'@en .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="62" onlydbo="true">
<string lang="en"><![CDATA[Who created Wikipedia?]]></string>
<string lang="de"><![CDATA[Wer hat Wikipedia gegründet?]]></string>
<string lang="es"><![CDATA[¿Quién creó Wikipedia?]]></string>
<string lang="it"><![CDATA[Chi ha creato Wikipedia?]]></string>
<string lang="fr"><![CDATA[Qui est le créateur de Wikipedia?]]></string>
<string lang="nl"><![CDATA[Wie heeft Wikipedia opgericht?]]></string>
<string lang="ro"><![CDATA[Cine a creat Wikipedia?]]></string>
<keywords lang="en"><![CDATA[Wikipedia, created]]></keywords>
<keywords lang="de"><![CDATA[Wikipedia, gründen]]></keywords>
<keywords lang="es"><![CDATA[Wikipedia, creador]]></keywords>
<keywords lang="it"><![CDATA[Wikipedia, creatore]]></keywords>
<keywords lang="fr"><![CDATA[créateur, Wikipedia]]></keywords>
<keywords lang="nl"><![CDATA[Wikipedia, oprichter]]></keywords>
<keywords lang="ro"><![CDATA[Wikipedia, creat]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Wikipedia dbo:author ?uri .
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="63" onlydbo="true">
<string lang="en"><![CDATA[Give me all actors starring in Last Action Hero.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.]]></string>
<string lang="es"><![CDATA[Dame todos los actores que hayan actuado en Last Action Hero.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli attori che hanno recitato in Last Action Hero.]]></string>
<string lang="fr"><![CDATA[Noem alle acteurs uit de film Last Action Hero.]]></string>
<string lang="nl"><![CDATA[Noem alle acteurs uit de film Last Action Hero.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți actorii cu roluri principale în Last Action Hero.]]></string>
<keywords lang="en"><![CDATA[actor, starring, Last Action Hero]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, mitspielen, Last Action Hero]]></keywords>
<keywords lang="es"><![CDATA[actores, Last Action Hero]]></keywords>
<keywords lang="it"><![CDATA[attori, Last Action Hero]]></keywords>
<keywords lang="fr"><![CDATA[acteurs, Last Action Hero]]></keywords>
<keywords lang="nl"><![CDATA[acteur, Last Action Hero]]></keywords>
<keywords lang="ro"><![CDATA[actor, rol principal, Last Action Hero]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Last_Action_Hero dbo:starring ?uri . 
}
]]></query>
</question>

<question aggregation="false" hybrid="false" answertype="resource" id="64" onlydbo="true">
<string lang="en"><![CDATA[Which software has been developed by organizations founded in California?]]></string>
<string lang="de"><![CDATA[Welche Softwareprodukte wurde von Unternehmen entwickelt, die in Kalifornien gegründet wurden?]]></string>
<string lang="es"><![CDATA[¿Qué productos de software han sido desarrollados por empresas fundadas en California?]]></string>
<string lang="it"><![CDATA[Quali software sono stati sviluppati da aziende fondate in California?]]></string>
<string lang="fr"><![CDATA[Quels logiciels ont été dévelopés par des agences fondées en Californie?]]></string>
<string lang="nl"><![CDATA[Welke software is ontwikkeld door bedrijven opgericht in Californië?]]></string>
<string lang="ro"><![CDATA[Ce software a fost dezvoltat de organizații fondate în California]]></string>
<keywords lang="en"><![CDATA[organization, founded, California, develop, software]]></keywords>
<keywords lang="de"><![CDATA[Unternehmen, gründen, Kalifornien, entwickeln, Softwareprodukt]]></keywords>
<keywords lang="es"><![CDATA[empresas, fundadas, California, desarrolar, productos de software]]></keywords>
<keywords lang="it"><![CDATA[azienda, fondata, California, sviluppare, software]]></keywords>
<keywords lang="fr"><![CDATA[Californie, agences, fondées, logiciels]]></keywords>
<keywords lang="nl"><![CDATA[bedrijf, opgericht, Californië, ontwikkeld, software]]></keywords>
<keywords lang="ro"><![CDATA[organizație, fondată, California, dezvolta, software]]></keywords>
<query><![CDATA[
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {         
        ?uri rdf:type dbo:Software .
        ?company rdf:type dbo:Company .
        ?uri dbo:developer ?company . 
        ?company dbo:foundationPlace res:California .
   
}
]]></query>
</question>

