{
  "dataset": {
    "id": "qald-5_train"
  },
  "questions": [
    {
      "id": "71",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "body": [
        {
          "language": "en",
          "string": "Give me all video games published by Mean Hamster Software.",
          "keywords": "video game, publish, Mean Hamster Software"
        },
        {
          "language": "de",
          "string": "Gib mir alle Videospiele von Mean Hamster Software.",
          "keywords": "Videospiel, Mean Hamster Software"
        },
        {
          "language": "es",
          "string": "Dame todos los videojuegos de Mean Hamster Software.",
          "keywords": "videojuego, Mean Hamster Software"
        },
        {
          "language": "it",
          "string": "Dammi tutti i videogiochi di Mean Hamster Software.",
          "keywords": "videogioco, prodotto, Mean Hamster Software"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les jeux vidéos publiés par Mean Hamster Software.",
          "keywords": "jeux vidéos, publiés, Mean Hamster Software"
        },
        {
          "language": "nl",
          "string": "Geef me alle videogames van Mean Hamster Software.",
          "keywords": "videogame, Mean Hamster Software"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate jocurile video publicate de Mean Hamster Software",
          "keywords": "joc video, publicat, Mean Hamster Software"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame . ?uri dbo:publisher res:Mean_Hamster_Software . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Riven"
        },
        {
          "string": "http://dbpedia.org/resource/Crossbow_(video_game)"
        }
      ]
    },
    {
      "id": "80",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all Canadian Grunge record labels.",
          "keywords": "record label, Canadian, Grunge"
        },
        {
          "language": "de",
          "string": "Gib mir alle kanadischen Grunge-Plattenfirmen.",
          "keywords": "kanadisch, Plattenfirma, Grunge"
        },
        {
          "language": "es",
          "string": "Dame todos las empresas canadienses productoras de música Grunge.",
          "keywords": "empresa productora de música, canadiense, Grunge"
        },
        {
          "language": "it",
          "string": "Dammi tutti i produttori canadesi di musica Grunge.",
          "keywords": "produttore di musica, canadese, Grunge"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les labels discographiques canadiens de grunge.",
          "keywords": "labels discographiques, canadiens, grunge"
        },
        {
          "language": "nl",
          "string": "Noem alle Canadese grunge-platenlabels.",
          "keywords": "Canadees, platenlabel, Grunge"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate casele canadiene Grunge de înregistrări.",
          "keywords": "casă de înregistrări, canadian, Grunge"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel . ?uri dbo:genre res:Grunge . ?uri dbo:country res:Canada .}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Murderecords"
        }
      ]
    },
    {
      "id": "84",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all movies with Tom Cruise.",
          "keywords": "movie, Tom Cruise"
        },
        {
          "language": "de",
          "string": "Gib mir alle Filme mit Tom Cruise.",
          "keywords": "Film, Tom Cruise"
        },
        {
          "language": "es",
          "string": "Dame todas las películas con Tom Cruise",
          "keywords": "películas, Tom Cruise"
        },
        {
          "language": "it",
          "string": "Dammi tutti i film con Tom Cruise.",
          "keywords": "film, Tom Cruise"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les films avec Tom Cruise.",
          "keywords": "films, Tom Cruise"
        },
        {
          "language": "nl",
          "string": "Noem alle films met Tom Cruise.",
          "keywords": "film, Tom Cruise"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate filmele cu Tom Cruise.",
          "keywords": "film, Tom Cruise"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:Film. ?uri dbo:starring res:Tom_Cruise .}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Vanilla_Sky"
        },
        {
          "string": "http://dbpedia.org/resource/Interview_with_the_Vampire:_The_Vampire_Chronicles"
        },
        {
          "string": "http://dbpedia.org/resource/Eyes_Wide_Shut"
        },
        {
          "string": "http://dbpedia.org/resource/Days_of_Thunder"
        },
        {
          "string": "http://dbpedia.org/resource/Losin'_It"
        },
        {
          "string": "http://dbpedia.org/resource/Jerry_Maguire"
        },
        {
          "string": "http://dbpedia.org/resource/Minority_Report_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/Rain_Man"
        },
        {
          "string": "http://dbpedia.org/resource/The_Color_of_Money"
        },
        {
          "string": "http://dbpedia.org/resource/Top_Gun"
        },
        {
          "string": "http://dbpedia.org/resource/A_Few_Good_Men"
        },
        {
          "string": "http://dbpedia.org/resource/Mission:_Impossible_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/The_Firm_(1993_film)"
        },
        {
          "string": "http://dbpedia.org/resource/Lions_for_Lambs"
        },
        {
          "string": "http://dbpedia.org/resource/Cocktail_(1988_film)"
        },
        {
          "string": "http://dbpedia.org/resource/Valkyrie_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/Risky_Business"
        },
        {
          "string": "http://dbpedia.org/resource/Red_Dawn_(2012_film)"
        },
        {
          "string": "http://dbpedia.org/resource/Magnolia_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/The_Last_Samurai"
        },
        {
          "string": "http://dbpedia.org/resource/Mission:_Impossible_%E2%80%93_Ghost_Protocol"
        },
        {
          "string": "http://dbpedia.org/resource/Mission:_Impossible_(film_series)"
        },
        {
          "string": "http://dbpedia.org/resource/Mission:_Impossible_III"
        },
        {
          "string": "http://dbpedia.org/resource/Rock_of_Ages_(2012_film)"
        },
        {
          "string": "http://dbpedia.org/resource/Jack_Reacher_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/Knight_and_Day"
        },
        {
          "string": "http://dbpedia.org/resource/Collateral_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/Legend_(1985_film)"
        },
        {
          "string": "http://dbpedia.org/resource/The_Outsiders_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/War_of_the_Worlds_(2005_film)"
        },
        {
          "string": "http://dbpedia.org/resource/Born_on_the_Fourth_of_July_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/All_the_Right_Moves_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/Far_and_Away"
        }
      ]
    },
    {
      "id": "89",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all soccer clubs in the Premier League.",
          "keywords": "Premier League, soccer club"
        },
        {
          "language": "de",
          "string": "Gib mir alle Vereine in der Premier League.",
          "keywords": "Premier League, Verein"
        },
        {
          "language": "es",
          "string": "Dame todos los clubs de la Premier League.",
          "keywords": "Premier League, club"
        },
        {
          "language": "it",
          "string": "Dammi tutti i club calcistici nella Premier League.",
          "keywords": "Premier League, club calcistici"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les équipes de la Premier League.",
          "keywords": "équipes, Premier League"
        },
        {
          "language": "nl",
          "string": "Noem alle clubs uit de Premier League.",
          "keywords": "club, Premier League"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate cluburile de fotbal din Premier League",
          "keywords": "Premier League, club de fotbal"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:SoccerClub . ?uri dbo:league res:Premier_League . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Aston_Villa_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Newcastle_United_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/West_Bromwich_Albion_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/West_Ham_United_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Arsenal_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Chelsea_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Fulham_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Liverpool_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Manchester_United_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Everton_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Southampton_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Tottenham_Hotspur_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Cardiff_City_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Crystal_Palace_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Swansea_City_A.F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Manchester_City_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Norwich_City_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Stoke_City_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Sunderland_A.F.C."
        },
        {
          "string": "http://dbpedia.org/resource/History_of_Blackburn_Rovers_F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Melchester_Rovers"
        },
        {
          "string": "http://dbpedia.org/resource/Hull_City_A.F.C."
        },
        {
          "string": "http://dbpedia.org/resource/Leicester_City_F.C."
        }
      ]
    },
    {
      "id": "240",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me the grandchildren of Bruce Lee.",
          "keywords": "Bruce Lee, grandchildren"
        },
        {
          "language": "de",
          "string": "Gib mir die Enkel von Bruce Lee.",
          "keywords": "Bruce Lee, Enkel"
        },
        {
          "language": "es",
          "string": "Dame todos los nietos de Bruce Lee.",
          "keywords": "Bruce Lee, nietos"
        },
        {
          "language": "it",
          "string": "Dammi i nipoti di Bruce Lee.",
          "keywords": "Bruce Lee, nipoti"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les petit-enfants de Bruce Lee.",
          "keywords": "petit-enfants, Bruce Lee"
        },
        {
          "language": "nl",
          "string": "Toon alle kleinkinderen van Bruce Lee.",
          "keywords": "Bruce Lee, kleinkinderen"
        },
        {
          "language": "ro",
          "string": "Dă-mi nepoții lui Bruce Lee.",
          "keywords": "Bruce Lee, nepoți"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uriWHERE { res:Bruce_Le dbo:child ?child . ?child dbo:child ?uri .}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Shannon_Lee"
        }
      ]
    },
    {
      "id": "218",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "true",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all films produced by Steven Spielberg with a budget of at least $80 million.",
          "keywords": "films, producer, Steven Spielberg, production budget, $80 million"
        },
        {
          "language": "de",
          "string": "Gib mir alle Filme, die von Steven Spielberg produziert worden und ein Budget von mindestens 80 Millionen Dollar hatten.",
          "keywords": "Film, Produzent, Steven Spielberg, Budget, $80 Millionen"
        },
        {
          "language": "es",
          "string": "Dame todas las películas producidas por Steven Spielberg con un presupuesto de al menos 80 milliones de dólares.",
          "keywords": "películas, productor, Steven Spielberg, presupuesto de al menos 80 milliones de dólares"
        },
        {
          "language": "it",
          "string": "Dammi tutti i film prodotti da Steven Spielberg con un budget finale di produzione di almeno 80 milioni di dollari.",
          "keywords": "film, produttore, Steven Spielberg, butget di produzione, 80 milioni di dollari"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les films produit par Steven Spielberg ayant un budget d'au moins $80 millions.",
          "keywords": "films, Steven Spielberg, budget, au moins $80 millions"
        },
        {
          "language": "nl",
          "string": "Toon alle films die door Steven Spielberg worden geproduceerd en die een budget van minstens 80 miljoen dollar hadden.",
          "keywords": "films, geproduceert door, Steven Spielberg, budget, minstens 80 miljoen dollar"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate filmele produse de Steven Spielberg, cu un buget final de producție de cel puțin 80 milioane de dolari.",
          "keywords": "filme, producător, Steven Spielberg, buget, 80 milioane de dolari"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film . ?uri dbo:director res:Steven_Spielberg . ?uri dbo:budget ?b . FILTER( xsd:double(?b) >= 8.0E7 )}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Jurassic_Park"
        },
        {
          "string": "http://dbpedia.org/resource/A.I._Artificial_Intelligence"
        },
        {
          "string": "http://dbpedia.org/resource/Minority_Report_(film)"
        },
        {
          "string": "http://dbpedia.org/resource/War_of_the_Worlds_(2005_film)"
        },
        {
          "string": "http://dbpedia.org/resource/Indiana_Jones_and_the_Kingdom_of_the_Crystal_Skull"
        }
      ]
    },
    {
      "id": "241",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all writers that won the Nobel Prize in literature.",
          "keywords": "writer, win, Nobel Prize in literature"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schriftsteller, die den Literaturnobelpreis gewonnen haben.",
          "keywords": "Schritfsteller, Literaturnobelpreis"
        },
        {
          "language": "es",
          "string": "Dame todos los escritores que hayan recibido el premio nobel de literatura.",
          "keywords": "escritores, premio nobel de literatura"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli scrittori che hanno vinto il Premio Nobel della letteratura.",
          "keywords": "scrittori, Premio Nobel della Letteratura"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les auteurs qui ont gagné le prix Nobel de litérature.",
          "keywords": "auteurs, prix Nobel de litérature"
        },
        {
          "language": "nl",
          "string": "Toon alle schrijvers die de Nobelprijs in literatuur hebben gewonnen.",
          "keywords": "schrijvers, Nobelprijs in literatuur, gewonnen"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți scriitorii care au câștigat premiul Nobel pentru literatură.",
          "keywords": "scriitor, câștigat, premiul Nobel pentru literatură"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:Writer . ?uri dbo:award res:Nobel_Prize_in_Literature . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Ivo_Andri%C4%87"
        },
        {
          "string": "http://dbpedia.org/resource/Seamus_Heaney"
        },
        {
          "string": "http://dbpedia.org/resource/Aleksandr_Solzhenitsyn"
        },
        {
          "string": "http://dbpedia.org/resource/Czes%C5%82aw_Mi%C5%82osz"
        },
        {
          "string": "http://dbpedia.org/resource/John_Steinbeck"
        },
        {
          "string": "http://dbpedia.org/resource/Naguib_Mahfouz"
        },
        {
          "string": "http://dbpedia.org/resource/T._S._Eliot"
        },
        {
          "string": "http://dbpedia.org/resource/Eugene_O'Neill"
        },
        {
          "string": "http://dbpedia.org/resource/Harold_Pinter"
        },
        {
          "string": "http://dbpedia.org/resource/Alice_Munro"
        },
        {
          "string": "http://dbpedia.org/resource/Juan_Ram%C3%B3n_Jim%C3%A9nez"
        }
      ]
    },
    {
      "id": "201",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all taikonauts.",
          "keywords": "taikonauts"
        },
        {
          "language": "de",
          "string": "Gib mir alle Taikonauten.",
          "keywords": "Taikonauten"
        },
        {
          "language": "es",
          "string": "Dame todas las taikonautas.",
          "keywords": "taikonautas"
        },
        {
          "language": "it",
          "string": "Dammi tutte i taikonauti.",
          "keywords": "taikonauti"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les taïkonautes.",
          "keywords": "taïkonautes"
        },
        {
          "language": "nl",
          "string": "Toon alle taikonauten.",
          "keywords": "taikonauten"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți taikonauții.",
          "keywords": "taikonaut"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:Astronaut . ?uri dbo:nationality res:China .}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Fei_Junlong"
        },
        {
          "string": "http://dbpedia.org/resource/Jing_Haipeng"
        },
        {
          "string": "http://dbpedia.org/resource/Nie_Haisheng"
        },
        {
          "string": "http://dbpedia.org/resource/Zhai_Zhigang"
        },
        {
          "string": "http://dbpedia.org/resource/Tao_Jiali"
        },
        {
          "string": "http://dbpedia.org/resource/Liu_Boming_(astronaut)"
        }
      ]
    },
    {
      "id": "247",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "body": [
        {
          "language": "en",
          "string": "Give me all actors called Baldwin.",
          "keywords": "actors, called, Baldwin"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schauspieler, die Baldwin heißen.",
          "keywords": "Schauspieler, heißen, Baldwin"
        },
        {
          "language": "es",
          "string": "Dame todos los actores llamados Baldwin.",
          "keywords": "actores, llamados Baldwin"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli attori che si chiamano Baldwin.",
          "keywords": "attori, chiamarsi, Baldwin"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les acteurs appelés Baldwin.",
          "keywords": "Acteury, appelés, Baldwin"
        },
        {
          "language": "nl",
          "string": "Toon alle acteurs die Baldwin heten.",
          "keywords": "acteurs, heten, Baldwin"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți actorii numiți Baldwin.",
          "keywords": "actori, numit, Baldwin"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX foaf: <http://xmlns.com/foaf/0.1/>SELECT DISTINCT ?uriWHERE { ?uri foaf:surname 'Baldwin'@en . { ?uri dbo:occupation res:Actor . } UNION { ?uri rdf:type dbo:Actor . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Lise_Baldwin"
        },
        {
          "string": "http://dbpedia.org/resource/A._Michael_Baldwin"
        },
        {
          "string": "http://dbpedia.org/resource/Alec_Baldwin"
        },
        {
          "string": "http://dbpedia.org/resource/Greg_Baldwin"
        },
        {
          "string": "http://dbpedia.org/resource/Judith_Baldwin"
        },
        {
          "string": "http://dbpedia.org/resource/Robert_Baldwin_(actor)"
        },
        {
          "string": "http://dbpedia.org/resource/Talon_(pornographic_actor)"
        }
      ]
    },
    {
      "id": "205",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all Dutch parties.",
          "keywords": "Dutch, party"
        },
        {
          "language": "de",
          "string": "Gib mir alle Niederländischen Parteien.",
          "keywords": "Niederländisch, Partei"
        },
        {
          "language": "es",
          "string": "Dame todos los partidos políticos holandeses",
          "keywords": "partidos políticos holandeses"
        },
        {
          "language": "it",
          "string": "Dammi tutti i partiti politici olandesi.",
          "keywords": "partiti politici olandesi"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les partis politiques néerlandais.",
          "keywords": "partis poliques, néerlandais"
        },
        {
          "language": "nl",
          "string": "Toon alle Nederlandse partijen.",
          "keywords": "Nederlandse partijen."
        },
        {
          "language": "ro",
          "string": "Dă-mi toate partidele politice olandeze.",
          "keywords": "partide politice olandeze"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:PoliticalParty . ?uri dbo:country res:Netherlands .}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Christian_Democratic_Appeal"
        },
        {
          "string": "http://dbpedia.org/resource/People's_Party_for_Freedom_and_Democracy"
        },
        {
          "string": "http://dbpedia.org/resource/Reformed_Political_Party"
        },
        {
          "string": "http://dbpedia.org/resource/Anti-Revolutionary_Party"
        },
        {
          "string": "http://dbpedia.org/resource/GreenLeft"
        },
        {
          "string": "http://dbpedia.org/resource/Centre_Democrats_(Netherlands)"
        },
        {
          "string": "http://dbpedia.org/resource/Frisian_National_Party"
        },
        {
          "string": "http://dbpedia.org/resource/Independent_Citizens'_Party"
        },
        {
          "string": "http://dbpedia.org/resource/Proud_of_the_Netherlands"
        },
        {
          "string": "http://dbpedia.org/resource/Socialist_Party_(Netherlands)"
        },
        {
          "string": "http://dbpedia.org/resource/Free_Union_(anarchist_organisation)"
        },
        {
          "string": "http://dbpedia.org/resource/Democratic_Political_Turning_Point"
        },
        {
          "string": "http://dbpedia.org/resource/Party_for_Freedom"
        }
      ]
    },
    {
      "id": "243",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all Swedish oceanographers.",
          "keywords": "Swedish, oceanographer"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schwedischen Ozeanographen.",
          "keywords": "Schwedisch, Ozeanographen"
        },
        {
          "language": "es",
          "string": "Dame todos los oceanógrafos suecos.",
          "keywords": "oceanógrafos suecos"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli oceanografi svedesi.",
          "keywords": "svedesi, oceanografi"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les océanographes suédois.",
          "keywords": "Océanographes, suédois"
        },
        {
          "language": "nl",
          "string": "Toon alle Zweedse oceanograafen.",
          "keywords": "Zweedse, oceanograafen"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți oceanografii suedezi.",
          "keywords": "oceanograf, suedez"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uriWHERE { ?uri dbo:field res:Oceanography . ?uri dbo:birthPlace res:Sweden . }",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Vagn_Walfrid_Ekman"
        }
      ]
    },
    {
      "id": "226",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "body": [
        {
          "language": "en",
          "string": "Give me all actors who were born in Berlin.",
          "keywords": "actors, born, Berlin"
        },
        {
          "language": "de",
          "string": "Gib mir alle in Berlin geborenenen Schauspieler.",
          "keywords": "Schauspieler, geboren, Berlin"
        },
        {
          "language": "es",
          "string": "Dame todos los actores nacidos en Berlin.",
          "keywords": "actores, nacidos, Berlin"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli attori nati a Berlino.",
          "keywords": "attori, nati, Berlino"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les acteurs nés à Berlin.",
          "keywords": "acteurs, lieu de naissance, Berlin"
        },
        {
          "language": "nl",
          "string": "Toon alle acteurs die in Berlijn zijn geboren.",
          "keywords": "actuers, geboren, Berlijn"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți actorii care s-au născut la Berlin.",
          "keywords": "actori, născut, Berlin"
        }
      ],
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Actor . ?uri dbo:birthPlace res:Berlin .}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Dru_Berrymore"
        },
        {
          "string": "http://dbpedia.org/resource/Jack_Trevor"
        },
        {
          "string": "http://dbpedia.org/resource/Lena_Nitro"
        }
      ]
    },
    {
      "id": "233",
      "hybrid": "false",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "body": [
        {
          "language": "en",
          "string": "Give me the capitals of all countries that the Himalayas run through.",
          "keywords": "countries Himalayas run through, capitals"
        },
        {
          "language": "de",
          "string": "Gib mir die Haupstädte aller Länder, über die sich der Himalaya erstreckt.",
          "keywords": "Länder, erstrecken, Himalaya, Haupstadt"
        },
        {
          "language": "es",
          "string": "Dame las capitales de todos los países que atraviesa el Himalaya.",
          "keywords": "capital de países, atraviesa el Himalaya"
        },
        {
          "language": "it",
          "string": "Dammi tutte le capitali degli stati attraversati dall'Himalaya.",
          "keywords": "capitali, stati attraversati dall'Himalaya"
        },
        {
          "language": "fr",
          "string": "Donne-moi les capitales de tous les pays que l'Himalaya traverse.",
          "keywords": "capitales, pays, traversé, Himalaya"
        },
        {
          "language": "nl",
          "string": "Toon de hoofdsteden van alle landen waardoor de Himalaya loopt.",
          "keywords": "Himalaya, lopen door, landen, hoofdsteden"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate țările traversate de Himalaya și capitalele lor.",
          "keywords": "țări, traversate de Himalaya, capitale"
        }
      ],
      "query": "PREFIX dbp: <http://dbpedia.org/property/>PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uriWHERE { res:Himalayas dbp:country ?country . ?country dbo:capital ?uri .}",
      "answers": [
        {
          "string": "http://dbpedia.org/resource/Beijing"
        },
        {
          "string": "http://dbpedia.org/resource/New_Delhi"
        },
        {
          "string": "http://dbpedia.org/resource/Islamabad"
        },
        {
          "string": "http://dbpedia.org/resource/Thimphu"
        }
      ]
    }
  ]
}