<?xml version="1.0"?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="233" onlydbo="false">
<string lang="en"><![CDATA[Give me the capitals of all countries that the Himalayas run through.]]></string>
<string lang="de"><![CDATA[Gib mir die Haupstädte aller Länder, über die sich der Himalaya erstreckt.]]></string>
<string lang="es"><![CDATA[Dame las capitales de todos los países que atraviesa el Himalaya.]]></string>
<string lang="it"><![CDATA[Dammi tutte le capitali degli stati attraversati dall'Himalaya.]]></string>
<string lang="fr"><![CDATA[Donne-moi les capitales de tous les pays que l'Himalaya traverse.]]></string>
<string lang="nl"><![CDATA[Toon de hoofdsteden van alle landen waardoor de Himalaya loopt.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate țările traversate de Himalaya și capitalele lor.]]></string>
<keywords lang="en"><![CDATA[countries Himalayas run through, capitals]]></keywords>
<keywords lang="de"><![CDATA[Länder, erstrecken, Himalaya, Haupstadt]]></keywords>
<keywords lang="es"><![CDATA[capital de países, atraviesa el Himalaya]]></keywords>
<keywords lang="it"><![CDATA[capitali, stati attraversati dall'Himalaya]]></keywords>
<keywords lang="fr"><![CDATA[capitales, pays, traversé, Himalaya]]></keywords>
<keywords lang="nl"><![CDATA[Himalaya, lopen door, landen, hoofdsteden]]></keywords>
<keywords lang="ro"><![CDATA[țări, traversate de Himalaya, capitale]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
         res:Himalayas dbp:country ?country . 
         ?country dbo:capital ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Beijing]]></answer><answer><![CDATA[http://dbpedia.org/resource/New_Delhi]]></answer><answer><![CDATA[http://dbpedia.org/resource/Islamabad]]></answer><answer><![CDATA[http://dbpedia.org/resource/Thimphu]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="239" onlydbo="false">
<string lang="en"><![CDATA[Which actor played Chewbacca?]]></string>
<string lang="de"><![CDATA[Welcher Schauspieler hat Chewbacca gespielt?]]></string>
<string lang="es"><![CDATA[¿Qué actor hizo el papel de Chewbacca?]]></string>
<string lang="it"><![CDATA[Quale attore ha recitato il ruolo di Chewbacca?]]></string>
<string lang="fr"><![CDATA[Quel acteurs ont joué le role de Chewbacca?]]></string>
<string lang="nl"><![CDATA[Welke acteur heeft Chewbacca gespeeld?]]></string>
<string lang="ro"><![CDATA[Ce actor l-a jucat pe Chewbacca?]]></string>
<keywords lang="en"><![CDATA[actor, play, Chewbacca]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, spielen, Chewbacca]]></keywords>
<keywords lang="es"><![CDATA[actor,papel de Chewbacca]]></keywords>
<keywords lang="it"><![CDATA[attore, recitare il ruolo, Chewbacca]]></keywords>
<keywords lang="fr"><![CDATA[acteur, Chewbacca]]></keywords>
<keywords lang="nl"><![CDATA[acteur, spelen, Chewbacca]]></keywords>
<keywords lang="ro"><![CDATA[actor, jucat, Chewbacca]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Chewbacca dbp:portrayer ?uri . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Peter_Mayhew]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="213" onlydbo="true">
<string lang="en"><![CDATA[Which ingredients do I need for carrot cake?]]></string>
<string lang="de"><![CDATA[Welche Zutaten brauche ich für Möhrenkuchen?]]></string>
<string lang="es"><![CDATA[¿Qué ingredientes son necesarios para una tarta de zanahorias?]]></string>
<string lang="it"><![CDATA[Di quali ingredienti ho bisogno per la torta di carote?]]></string>
<string lang="fr"><![CDATA[Quels sont les ingrédients du gateau aux carottes?]]></string>
<string lang="nl"><![CDATA[Welke ingrediënten heb ik nodig voor worteltaart?]]></string>
<string lang="ro"><![CDATA[De ce ingrediente am nevoie pentru tort de morcovi?]]></string>
<keywords lang="en"><![CDATA[carrot cake, ingredients]]></keywords>
<keywords lang="de"><![CDATA[Möhrenkuchen, Zutaten]]></keywords>
<keywords lang="es"><![CDATA[ingredientes, tarta de zanahorias?]]></keywords>
<keywords lang="it"><![CDATA[ingredienti, torta di carote]]></keywords>
<keywords lang="fr"><![CDATA[ingrédients, gateau aux carottes]]></keywords>
<keywords lang="nl"><![CDATA[worteltaart, ingrediënten]]></keywords>
<keywords lang="ro"><![CDATA[tort de morcovi, ingrediente]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Carrot_cake dbo:ingredient ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Flour]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nutmeg]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sugar]]></answer><answer><![CDATA[http://dbpedia.org/resource/Icing_(food)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Egg_(food)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Allspice]]></answer><answer><![CDATA[http://dbpedia.org/resource/Marzipan]]></answer><answer><![CDATA[http://dbpedia.org/resource/Carrot]]></answer><answer><![CDATA[http://dbpedia.org/resource/Cream_cheese]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="boolean" id="219" onlydbo="true">
<string lang="en"><![CDATA[Is Cola a beverage?]]></string>
<string lang="de"><![CDATA[Ist Cola ein Getränk?]]></string>
<string lang="es"><![CDATA[¿La Coca Cola es una bebida?]]></string>
<string lang="it"><![CDATA[La Cola è una bevanda?]]></string>
<string lang="fr"><![CDATA[Le Coca est-il une boisson?]]></string>
<string lang="nl"><![CDATA[Is cola een drank?]]></string>
<string lang="ro"><![CDATA[Cola este o băutură?]]></string>
<keywords lang="en"><![CDATA[Cola, beverage]]></keywords>
<keywords lang="de"><![CDATA[Cola, Getränk]]></keywords>
<keywords lang="es"><![CDATA[Coca Cola, bebida]]></keywords>
<keywords lang="it"><![CDATA[Cola, bevanda]]></keywords>
<keywords lang="fr"><![CDATA[Coca, boisson]]></keywords>
<keywords lang="nl"><![CDATA[Cola, drank]]></keywords>
<keywords lang="ro"><![CDATA[Cola, băutură]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK 
WHERE {
        res:Cola rdf:type dbo:Beverage .
}
]]></query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="215" onlydbo="true">
<string lang="en"><![CDATA[Who has Tom Cruise been married to?]]></string>
<string lang="de"><![CDATA[Mit wem war Tom Cruise verheiratet?]]></string>
<string lang="es"><![CDATA[¿Quién ha estado casado con Tom Cruise?]]></string>
<string lang="it"><![CDATA[Con chi è stato sposato Tom Cruise?]]></string>
<string lang="fr"><![CDATA[Qui est l'épouse de Tom Cruise?]]></string>
<string lang="nl"><![CDATA[Met wie was Tom Cruise getrouwd?]]></string>
<string lang="ro"><![CDATA[Cu cine a fost căsătorit Tom Cruise?]]></string>
<keywords lang="en"><![CDATA[Tom Cruise, married]]></keywords>
<keywords lang="de"><![CDATA[Tom Cruise, verheiratet]]></keywords>
<keywords lang="es"><![CDATA[esposas, Tom Cruise]]></keywords>
<keywords lang="it"><![CDATA[Tom Cruise, mogli]]></keywords>
<keywords lang="fr"><![CDATA[épouse, Tom Cruise]]></keywords>
<keywords lang="nl"><![CDATA[Tom Cruise, getrouwd]]></keywords>
<keywords lang="ro"><![CDATA[Tom Cruise, căsătorit]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        ?uri dbo:spouse res:Tom_Cruise.
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Mimi_Rogers]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="222" onlydbo="true">
<string lang="en"><![CDATA[Which of Tim Burton's films had the highest budget?]]></string>
<string lang="de"><![CDATA[Welcher von Tim Burtons Filmen hatte das höchste Budget?]]></string>
<string lang="es"><![CDATA[¿Cuál es la película de Tim Burton con el mayor presupuesto?]]></string>
<string lang="it"><![CDATA[Quali film di Tim Burton hanno avuto il budget più alto?]]></string>
<string lang="fr"><![CDATA[Quel film de Tim Burton a le budget le plus haut?]]></string>
<string lang="nl"><![CDATA[Welke van Tim Burton's films had het hoogste budget?]]></string>
<string lang="ro"><![CDATA[Care dintre filmele lui Tom Burton a avut cel mai mare buget?]]></string>
<keywords lang="en"><![CDATA[highest budget, film, Tim Burton]]></keywords>
<keywords lang="de"><![CDATA[höchstes Budget, Film, Tim Burton]]></keywords>
<keywords lang="es"><![CDATA[película de Tim Burton, mayor presupuesto]]></keywords>
<keywords lang="it"><![CDATA[budget più alto, film, Tim Burton]]></keywords>
<keywords lang="fr"><![CDATA[budget le plus haut, Tim Burton]]></keywords>
<keywords lang="nl"><![CDATA[film, Tim Burton, hoogste budget]]></keywords>
<keywords lang="ro"><![CDATA[cel mai mare buget, film, Tim Burton]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:director res:Tim_Burton .
        ?uri dbo:budget ?b .
}
ORDER BY ?b
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Big_Eyes]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="209" onlydbo="false">
<string lang="en"><![CDATA[How heavy is Jupiter's lightest moon?]]></string>
<string lang="de"><![CDATA[Wie schwer ist Jupiters leichtester Mond?]]></string>
<string lang="es"><![CDATA[¿Cuánto pesa el satélite más ligero de Júpiter?]]></string>
<string lang="it"><![CDATA[¿Cuánto pesa il satellite più leggero di Giove?]]></string>
<string lang="fr"><![CDATA[Combien pèse le satellite le plus léger de Jupiter?]]></string>
<string lang="nl"><![CDATA[Hoe zwaar is de lichtste maan van Jupiter?]]></string>
<string lang="ro"><![CDATA[Cât de greu este cel mai ușor satelit al lui Jupiter?]]></string>
<keywords lang="en"><![CDATA[how heavy, Jupiter, moon, lightest]]></keywords>
<keywords lang="de"><![CDATA[wie schwer, Jupiter, Mond, leichtester]]></keywords>
<keywords lang="es"><![CDATA[peso, satélite más ligero, Júpiter]]></keywords>
<keywords lang="it"><![CDATA[peso, satellite più leggero di Giove]]></keywords>
<keywords lang="fr"><![CDATA[poids, satellite le plus léger, Jupiter]]></keywords>
<keywords lang="nl"><![CDATA[hoe zwaar, Jupiter, maan, lichtste]]></keywords>
<keywords lang="ro"><![CDATA[greu, Jupiter, satelit, cel mai ușor]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?n
WHERE {
        ?uri dbp:satelliteOf res:Jupiter .
        ?uri dbo:mass ?n .
}
ORDER BY ASC(?n)
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[1100.0]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="220" onlydbo="true">
<string lang="en"><![CDATA[Which actor was casted in the most movies?]]></string>
<string lang="de"><![CDATA[Welcher Schauspieler spielte in den meisten Filmen mit?]]></string>
<string lang="es"><![CDATA[¿Qué actor ha actuado en el mayor número de películas?]]></string>
<string lang="it"><![CDATA[Quale attore è stato scritturato in piùfilm?]]></string>
<string lang="fr"><![CDATA[Quel acteur a joué dans le plus de films?]]></string>
<string lang="nl"><![CDATA[Welke acteur speelde in de meeste films?]]></string>
<string lang="ro"><![CDATA[Ce actor a fost distribuit în cele mai multe filme?]]></string>
<keywords lang="en"><![CDATA[actor, casted, most movies]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, meiste Filme]]></keywords>
<keywords lang="es"><![CDATA[actor, mayor número de películas]]></keywords>
<keywords lang="it"><![CDATA[attore, scritturato, maggior numero di film]]></keywords>
<keywords lang="fr"><![CDATA[acteur, maximum de films]]></keywords>
<keywords lang="nl"><![CDATA[acteur, spelen, meeste films]]></keywords>
<keywords lang="ro"><![CDATA[actor, distribuit, cele mai multe filme]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Actor .
        ?f rdf:type dbo:Film .
        ?f dbo:starring ?uri .
} 
ORDER BY DESC(COUNT(DISTINCT(?f))) 
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Andy_Lau]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="boolean" id="245" onlydbo="true">
<string lang="en"><![CDATA[Is James Bond married?]]></string>
<string lang="de"><![CDATA[Ist James Bond verheiratet?]]></string>
<string lang="es"><![CDATA[¿Está James Bond casado?]]></string>
<string lang="it"><![CDATA[James è Bond sposato?]]></string>
<string lang="fr"><![CDATA[James Bond est-il marié?]]></string>
<string lang="nl"><![CDATA[Is James Bond getrouwd?]]></string>
<string lang="ro"><![CDATA[James Bond este căsătorit?]]></string>
<keywords lang="en"><![CDATA[James Bond, married]]></keywords>
<keywords lang="de"><![CDATA[James Bond, verheiratet]]></keywords>
<keywords lang="es"><![CDATA[James Bond, casado]]></keywords>
<keywords lang="it"><![CDATA[James Bond, sposato]]></keywords>
<keywords lang="fr"><![CDATA[James Bond, marié]]></keywords>
<keywords lang="nl"><![CDATA[James Bond, getrouwd]]></keywords>
<keywords lang="ro"><![CDATA[James Bond, căsătorit]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        res:James_Bond dbo:spouse ?uri . 
}
]]></query>
<answers><answer><![CDATA[false]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="229" onlydbo="true">
<string lang="en"><![CDATA[Give me all Australian metalcore bands.]]></string>
<string lang="de"><![CDATA[Gib mir alle australischen Metalcore-Bands.]]></string>
<string lang="es"><![CDATA[Dame todos los grupos australianos de metalcore.]]></string>
<string lang="it"><![CDATA[Dammi tutte i gruppi metalcore australiani.]]></string>
<string lang="fr"><![CDATA[Donnes les groupes de métalcode australiens.]]></string>
<string lang="nl"><![CDATA[Toon alle Australisch metalcore bands.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate trupele metalcore australiene.]]></string>
<keywords lang="en"><![CDATA[Australian, metalcore bands]]></keywords>
<keywords lang="de"><![CDATA[australisch, Metalcore-Bands]]></keywords>
<keywords lang="es"><![CDATA[grupos australianos metalcore]]></keywords>
<keywords lang="it"><![CDATA[gruppi metalcore, australiani]]></keywords>
<keywords lang="fr"><![CDATA[groupe, métalcode, australien]]></keywords>
<keywords lang="nl"><![CDATA[Australisch, metalcore bands]]></keywords>
<keywords lang="ro"><![CDATA[australian, trupe metalcore]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Band .
        ?uri dbo:genre res:Metalcore .
      { ?uri dbo:hometown res:Australia . }
      UNION 
      { ?uri dbo:hometown ?h .
        ?h dbo:country res:Australia . }
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Confession_(band)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Our_Last_Enemy]]></answer><answer><![CDATA[http://dbpedia.org/resource/Buried_in_Verona]]></answer><answer><![CDATA[http://dbpedia.org/resource/House_vs._Hurricane]]></answer><answer><![CDATA[http://dbpedia.org/resource/Shoreside]]></answer><answer><![CDATA[http://dbpedia.org/resource/Wish_for_Wings]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mindsnare]]></answer><answer><![CDATA[http://dbpedia.org/resource/Parkway_Drive]]></answer><answer><![CDATA[http://dbpedia.org/resource/I_Killed_the_Prom_Queen]]></answer><answer><![CDATA[http://dbpedia.org/resource/The_Amity_Affliction]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dyscord]]></answer><answer><![CDATA[http://dbpedia.org/resource/Capture_the_Crown]]></answer><answer><![CDATA[http://dbpedia.org/resource/Double_Dragon_(band)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Northlane]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="227" onlydbo="true">
<string lang="en"><![CDATA[Give me all actors who were born in Paris after 1950.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schauspieler, die nach 1950 in Paris geboren wurden.]]></string>
<string lang="es"><![CDATA[Dame todos los actores nacidos en Paris después de 1950.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli attori nati a Parigi dopo il 1950.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les acteurs nés à Berlin après 1950.]]></string>
<string lang="nl"><![CDATA[Toon alle acteurs die na 1950 in Parijs zijn geboren.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți actorii care s-au născut la Paris după 1950.]]></string>
<keywords lang="en"><![CDATA[actors, born, Paris, after 1950]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, geboren, nach 1950, in Paris]]></keywords>
<keywords lang="es"><![CDATA[actores,nacidos en Paris, después de 1950]]></keywords>
<keywords lang="it"><![CDATA[attori, nati, dopo il 1950, a Parigi]]></keywords>
<keywords lang="fr"><![CDATA[acteurs, lieu de naissance, Berlin, date de naissance, après 1950]]></keywords>
<keywords lang="nl"><![CDATA[actuers, geboren, na 1950, in Parijs]]></keywords>
<keywords lang="ro"><![CDATA[actori, născut, Paris, după 1950]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Actor .
        ?uri dbo:birthPlace res:Paris .
        ?uri dbo:birthDate ?date .
        FILTER ( ?date >= xsd:dateTime('1950-12-31T00:00:00Z')) 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Coralie_Trinh_Thi]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gr%C3%A9gory_Fitoussi]]></answer><answer><![CDATA[http://dbpedia.org/resource/Chiara_Mastroianni]]></answer><answer><![CDATA[http://dbpedia.org/resource/Roxane_Duran]]></answer><answer><![CDATA[http://dbpedia.org/resource/Chems_Dahmani]]></answer><answer><![CDATA[http://dbpedia.org/resource/Melvil_Poupaud]]></answer><answer><![CDATA[http://dbpedia.org/resource/Estelle_Skornik]]></answer><answer><![CDATA[http://dbpedia.org/resource/C%C3%A9cile_Cassel]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mehdi_Belhaj_Kacem]]></answer><answer><![CDATA[http://dbpedia.org/resource/Antoine_de_Caunes]]></answer><answer><![CDATA[http://dbpedia.org/resource/%C3%89douard_Baer]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pierre_Boulanger]]></answer><answer><![CDATA[http://dbpedia.org/resource/Samir_Guesmi]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nora_Arnezeder]]></answer><answer><![CDATA[http://dbpedia.org/resource/R%C3%A9gis_Laspal%C3%A8s]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rebecca_Lord]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mathilde_Seigner]]></answer><answer><![CDATA[http://dbpedia.org/resource/Angelique_Morgan]]></answer><answer><![CDATA[http://dbpedia.org/resource/No%C3%A9mie_Lvovsky]]></answer><answer><![CDATA[http://dbpedia.org/resource/Christa_Theret]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lucie_Jeanne]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nikolai_Kinski]]></answer><answer><![CDATA[http://dbpedia.org/resource/St%C3%A9phane_Freiss]]></answer><answer><![CDATA[http://dbpedia.org/resource/Judy_Minx]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="date" id="206" onlydbo="false">
<string lang="en"><![CDATA[When was Carlo Giuliani shot?]]></string>
<string lang="de"><![CDATA[Wann wurde Carlo Giuliani erschossen?]]></string>
<string lang="es"><![CDATA[¿Cuándo fue disparado Carlo Giuliani?]]></string>
<string lang="it"><![CDATA[Quando è stato ucciso Carlo Giuliani?]]></string>
<string lang="fr"><![CDATA[Quand a été tué Carlo Giuliani?]]></string>
<string lang="nl"><![CDATA[Wanneer werd Carlo Giuliani neergeschoten?]]></string>
<string lang="ro"><![CDATA[Când a fost ucis Carlo Giuliani?]]></string>
<keywords lang="en"><![CDATA[date, Carlo Giuliani, shot]]></keywords>
<keywords lang="de"><![CDATA[Datum, Carlo Giuliani, erschossen]]></keywords>
<keywords lang="es"><![CDATA[fecha, disparo, Carlo Giuliani]]></keywords>
<keywords lang="it"><![CDATA[data, Carlo Giuliani, ucciso]]></keywords>
<keywords lang="fr"><![CDATA[date de décès, Carlo Guiliani]]></keywords>
<keywords lang="nl"><![CDATA[datum, Carlo Giuliani, neergeschoten]]></keywords>
<keywords lang="ro"><![CDATA[dată, Carlo Giuliani, ucis]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date
WHERE {
        res:Death_of_Carlo_Giuliani dbp:dateOfDeath ?date .
}
]]></query>
<answers><answer><![CDATA[2001-07-20+02:00]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="224" onlydbo="false">
<string lang="en"><![CDATA[Who are the four youngest MVP basketball players?]]></string>
<string lang="de"><![CDATA[Wer sind die vier jüngsten MVP Baskettballspieler?]]></string>
<string lang="es"><![CDATA[¿Cuáles son los cuatro jugadores de baloncesto de categoría MVP más jóvenes?]]></string>
<string lang="it"><![CDATA[Chi sono i quattro più giovani giocatori di maggior valore (MVP)?]]></string>
<string lang="fr"><![CDATA[Quels sont les quatres plus jeunes MVP de basketball?]]></string>
<string lang="nl"><![CDATA[Wie zijn de vier jongste MVP basketballers?]]></string>
<string lang="ro"><![CDATA[Care sunt cei patru cei mai tineri jucători de baschet MVP?]]></string>
<keywords lang="en"><![CDATA[four, youngest, MVP, basketball player]]></keywords>
<keywords lang="de"><![CDATA[vier jüngsten, MVP, Basketballspieler]]></keywords>
<keywords lang="es"><![CDATA[cuatro jugadores de baloncesto más jóvenes,categoría MVP]]></keywords>
<keywords lang="it"><![CDATA[quattro, più giovani, giocatori di maggior valore (MVP)]]></keywords>
<keywords lang="fr"><![CDATA[quatre plus jeunes, MVP, basketball]]></keywords>
<keywords lang="nl"><![CDATA[vier jongste, MVP basketballers]]></keywords>
<keywords lang="ro"><![CDATA[patru, cei mai tineri, MVP, jucători de baschet]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:BasketballPlayer .
        ?uri dbo:birthDate ?date.
        ?uri dbp:highlights ?h .
        FILTER regex(?h,'MVP')
} 
ORDER BY DESC(?date) 
OFFSET 0 LIMIT 4
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Cliff_Alexander]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aaron_Gordon]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jabari_Parker]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mario_Hezonja]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="252" onlydbo="true">
<string lang="en"><![CDATA[Give all swimmers that were born in Moscow.]]></string>
<string lang="de"><![CDATA[Zeig mir alle Schwimmer, die in Moskau geboren wurden.]]></string>
<string lang="es"><![CDATA[Dame todos los nadadores nacidos en Moscú]]></string>
<string lang="it"><![CDATA[Dammi tutti i nuotatori che sono nati a Mosca.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les nageurs nés à Moscou.]]></string>
<string lang="nl"><![CDATA[Toen alle zwemmers die werden geboren in Moskou.]]></string>
<string lang="ro"><![CDATA[Numește toți înotătorii născuți în Moscova.]]></string>
<keywords lang="en"><![CDATA[swimmer, born, Moscow]]></keywords>
<keywords lang="de"><![CDATA[Schwimmer, geboren in, Moskau]]></keywords>
<keywords lang="es"><![CDATA[nadadores, nacidos, Moscú]]></keywords>
<keywords lang="it"><![CDATA[nuotatori, nati, Mosca]]></keywords>
<keywords lang="fr"><![CDATA[nageurs, nés, Moscou]]></keywords>
<keywords lang="nl"><![CDATA[zwemmers, geboren, Moskou]]></keywords>
<keywords lang="ro"><![CDATA[înotători, născuți, Moscova]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
         ?uri rdf:type dbo:Swimmer .
         ?uri dbo:birthPlace res:Moscow .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Aleksandr_Samsonov]]></answer><answer><![CDATA[http://dbpedia.org/resource/Olesya_Vladykina]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tamara_Sosnova]]></answer><answer><![CDATA[http://dbpedia.org/resource/Viktor_Mazanov]]></answer><answer><![CDATA[http://dbpedia.org/resource/Valentina_Tutayeva]]></answer><answer><![CDATA[http://dbpedia.org/resource/Valentina_Poznyak]]></answer><answer><![CDATA[http://dbpedia.org/resource/Maria_Gromova_(swimmer)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Anastasia_Chaun]]></answer><answer><![CDATA[http://dbpedia.org/resource/Alexey_Zinovyev]]></answer><answer><![CDATA[http://dbpedia.org/resource/Oleg_Fotin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nina_Zhivanevskaya]]></answer><answer><![CDATA[http://dbpedia.org/resource/Artem_Lobuzov]]></answer><answer><![CDATA[http://dbpedia.org/resource/Yekaterina_Vinogradova]]></answer><answer><![CDATA[http://dbpedia.org/resource/Vladimir_Kravchenko]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mikhail_Polischuk]]></answer><answer><![CDATA[http://dbpedia.org/resource/Daniela_In%C3%A1cio]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nikolay_Suhorukov]]></answer><answer><![CDATA[http://dbpedia.org/resource/Elena_Sokolova_(swimmer)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Irina_Pozdnyakova]]></answer><answer><![CDATA[http://dbpedia.org/resource/Semyon_Belits-Geiman]]></answer><answer><![CDATA[http://dbpedia.org/resource/Marina_Chepurkova]]></answer><answer><![CDATA[http://dbpedia.org/resource/Valentin_Kuzmin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aleksandr_Pletnev]]></answer><answer><![CDATA[http://dbpedia.org/resource/Anastasia_Gloushkov]]></answer><answer><![CDATA[http://dbpedia.org/resource/Danil_Haustov]]></answer><answer><![CDATA[http://dbpedia.org/resource/Andrey_Dunayev]]></answer><answer><![CDATA[http://dbpedia.org/resource/Yevgeny_Korotyshkin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sergey_Lavrenov]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="253" onlydbo="false">
<string lang="en"><![CDATA[Who was called Rodzilla?]]></string>
<string lang="de"><![CDATA[Wer wurde Rodzilla genannt?]]></string>
<string lang="es"><![CDATA[¿Quien se llamaba Rodzilla?]]></string>
<string lang="it"><![CDATA[Chi era chiamato Rodzilla?]]></string>
<string lang="fr"><![CDATA[Qui était appelé Rodzilla?]]></string>
<string lang="nl"><![CDATA[Wie werd Rodzilla genoemd?]]></string>
<string lang="ro"><![CDATA[Cine a fost numit Rodzilla?]]></string>
<keywords lang="en"><![CDATA[called, Rodzilla]]></keywords>
<keywords lang="de"><![CDATA[genannt, Rodzilla]]></keywords>
<keywords lang="es"><![CDATA[llamaba, Rodzilla]]></keywords>
<keywords lang="it"><![CDATA[chiamato, Rodzilla]]></keywords>
<keywords lang="fr"><![CDATA[appelé, Rodzilla]]></keywords>
<keywords lang="nl"><![CDATA[genoemd, Rodzilla]]></keywords>
<keywords lang="ro"><![CDATA[numit, Rodzilla]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE { 
         ?uri dbp:nickname "Rodzilla"@en .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Rodney_Blake]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="254" onlydbo="true">
<string lang="en"><![CDATA[Show me the book that Muhammad Ali wrote.]]></string>
<string lang="de"><![CDATA[Zeig mir das Buch, das Muhammad Ali geschrieben hat.]]></string>
<string lang="es"><![CDATA[Muéstrame el libro escrito por Muhammad Ali.]]></string>
<string lang="it"><![CDATA[Mostrami il libro scritto da Muhammad Ali.]]></string>
<string lang="fr"><![CDATA[Donne-moi le livre écrit par Muhammad Ali.]]></string>
<string lang="nl"><![CDATA[Toen het boek dat Muhammad Ali heeft geschreven.]]></string>
<string lang="ro"><![CDATA[Arată-mi cartea pe care a scris-o Muhammad Ali.]]></string>
<keywords lang="en"><![CDATA[book, wrote, Muhammad Ali]]></keywords>
<keywords lang="de"><![CDATA[Buch, geschrieben, Muhammad Ali]]></keywords>
<keywords lang="es"><![CDATA[libro, autor, Muhammad Ali]]></keywords>
<keywords lang="it"><![CDATA[libro, autore, Muhammad Ali]]></keywords>
<keywords lang="fr"><![CDATA[livre, par Muhammad Ali]]></keywords>
<keywords lang="nl"><![CDATA[boek, geschreven, Muhammad Ali]]></keywords>
<keywords lang="ro"><![CDATA[carte, scris, Muhammad Ali]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
         ?uri rdf:type dbo:Book . 
         ?uri dbo:author res:Muhammad_Ali . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/The_Soul_of_a_Butterfly]]></answer></answers></question>

