<?xml version="1.0"?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="255" onlydbo="true">
<string lang="en"><![CDATA[How many museums does Paris have?]]></string>
<string lang="de"><![CDATA[Wieviele Museen hat Paris?]]></string>
<string lang="es"><![CDATA[¿Cuantos museos hay en Paris?]]></string>
<string lang="it"><![CDATA[Quanti musei ha Parigi?]]></string>
<string lang="fr"><![CDATA[Combien de musées y a-t-il à Paris?]]></string>
<string lang="nl"><![CDATA[Hoeveel museas heeft Parijs?]]></string>
<string lang="ro"><![CDATA[Câte muzee are Parisul?]]></string>
<keywords lang="en"><![CDATA[how many, museum, Paris]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Museen, Paris]]></keywords>
<keywords lang="es"><![CDATA[cuantos, museos, Paris]]></keywords>
<keywords lang="it"><![CDATA[quanti, musei, Parigi]]></keywords>
<keywords lang="fr"><![CDATA[nombre de musées, Paris]]></keywords>
<keywords lang="nl"><![CDATA[hoeveel, museas, Parijs]]></keywords>
<keywords lang="ro"><![CDATA[câte, muzee, Paris]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
         ?uri rdf:type dbo:Museum . 
         ?uri dbo:location res:Paris . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Mus%C3%A9e_national_Gustave_Moreau]]></answer><answer><![CDATA[http://dbpedia.org/resource/Galerie_de_pal%C3%A9ontologie_et_d'anatomie_compar%C3%A9e]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mus%C3%A9e_d'Art_Moderne_de_la_Ville_de_Paris]]></answer><answer><![CDATA[http://dbpedia.org/resource/Grand_Palais]]></answer><answer><![CDATA[http://dbpedia.org/resource/Free_Art_and_Technology_Lab]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bridgeman_Art_Library]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jardin_des_Plantes]]></answer><answer><![CDATA[http://dbpedia.org/resource/Carnavalet_Museum]]></answer><answer><![CDATA[http://dbpedia.org/resource/Cent_Quatre]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mus%C3%A9e_Rodin]]></answer><answer><![CDATA[http://dbpedia.org/resource/National_Museum_of_Natural_History_(France)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mus%C3%A9e_des_Arts_Forains]]></answer><answer><![CDATA[http://dbpedia.org/resource/Cit%C3%A9_des_Sciences_et_de_l'Industrie]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mus%C3%A9e_Marmottan_Monet]]></answer><answer><![CDATA[http://dbpedia.org/resource/Cit%C3%A9_de_l'%C3%A9conomie_et_de_la_monnaie]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mus%C3%A9e_de_l'Homme]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mus%C3%A9e_du_Vin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mus%C3%A9e_d%E2%80%99histoire_de_la_m%C3%A9decine]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="256" onlydbo="true">
<string lang="en"><![CDATA[Which city has the most inhabitants?]]></string>
<string lang="de"><![CDATA[Welche Stadt hat die meisten Einwohner?]]></string>
<string lang="es"><![CDATA[¿Que ciudad tiene la mayor población?]]></string>
<string lang="it"><![CDATA[Quale città ha il maggior numero di abitanti?]]></string>
<string lang="fr"><![CDATA[Quel ville a le plus grand nombre d'habitants?]]></string>
<string lang="nl"><![CDATA[Welke stad heeft de meeste inwoners?]]></string>
<string lang="ro"><![CDATA[Care oraș are cei mai mulți locuitori?]]></string>
<keywords lang="en"><![CDATA[city, the most inhabitants]]></keywords>
<keywords lang="de"><![CDATA[Stadt, meisten Einwohner]]></keywords>
<keywords lang="es"><![CDATA[ciudad, mayor población]]></keywords>
<keywords lang="it"><![CDATA[città, maggior numero di abitanti]]></keywords>
<keywords lang="fr"><![CDATA[ville, plus grand nombre d'habitants]]></keywords>
<keywords lang="nl"><![CDATA[stad, meeste inwoners]]></keywords>
<keywords lang="ro"><![CDATA[oraș, cei mai mulți locuitori]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
         ?uri rdf:type dbo:City . 
         ?uri dbo:populationTotal ?pop . 
}
ORDER BY DESC(?pop)
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Karachi]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="257" onlydbo="true">
<string lang="en"><![CDATA[Which city has the least inhabitants?]]></string>
<string lang="de"><![CDATA[Welche Stadt hat die wenigsten Einwohner?]]></string>
<string lang="es"><![CDATA[¿Que ciudad tiene la menor población?]]></string>
<string lang="it"><![CDATA[Quale città ha il minor numero di abitanti?]]></string>
<string lang="fr"><![CDATA[Quelle ville a le plus petit nombre d'habitants?]]></string>
<string lang="nl"><![CDATA[Welke stad heeft de minste inwoners?]]></string>
<string lang="ro"><![CDATA[Care oraș are cei mai puțini locuitori?]]></string>
<keywords lang="en"><![CDATA[city, the least inhabitants]]></keywords>
<keywords lang="de"><![CDATA[Stadt, wenigsten Einwohner]]></keywords>
<keywords lang="es"><![CDATA[ciudad, menor población]]></keywords>
<keywords lang="it"><![CDATA[città, minor numero di abitanti]]></keywords>
<keywords lang="fr"><![CDATA[ville, plus petit nombre d'habitants]]></keywords>
<keywords lang="nl"><![CDATA[stad, minste inwoners]]></keywords>
<keywords lang="ro"><![CDATA[oraș, cei mai puțini locuitori]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
         ?uri rdf:type dbo:City . 
         ?uri dbo:populationTotal ?pop . 
}
ORDER BY ASC(?pop)
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Lakeside,_Missouri]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="258" onlydbo="true">
<string lang="en"><![CDATA[Give me all the TV shows with Neil Patrick Harris.]]></string>
<string lang="de"><![CDATA[Gib mir alle Fernsehserien mit Neil Patrick Harris.]]></string>
<string lang="es"><![CDATA[Dame todos los programas de televisión con Neil Patrick Harris.]]></string>
<string lang="it"><![CDATA[Dammi tutti i programmi televisivi con Neil Patrick Harris.]]></string>
<string lang="fr"><![CDATA[Donne-moi toutes les émissions de télé avec Neil Patrick Harris.]]></string>
<string lang="nl"><![CDATA[Toen alle TV programma's met Neil Patrick Harris.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate emisiunile TV cu Neil Patrick Harris]]></string>
<keywords lang="en"><![CDATA[TV shows, Neil Patrick Harris]]></keywords>
<keywords lang="de"><![CDATA[Fernsehserien, Neil Patrick Harris]]></keywords>
<keywords lang="es"><![CDATA[programas de televisión, Neil Patrick Harris]]></keywords>
<keywords lang="it"><![CDATA[programmi televisivi, Neil Patrick Harris]]></keywords>
<keywords lang="fr"><![CDATA[émissions de télé, Neil Patrick Harris]]></keywords>
<keywords lang="nl"><![CDATA[TV programma's, Neil Patrick Harris]]></keywords>
<keywords lang="ro"><![CDATA[emisiuni TV, Neil Patrick Harris]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
         ?uri rdf:type dbo:TelevisionShow . 
         ?uri dbo:starring res:Neil_Patrick_Harris . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Neil's_Puppet_Dreams]]></answer><answer><![CDATA[http://dbpedia.org/resource/How_I_Met_Your_Mother]]></answer><answer><![CDATA[http://dbpedia.org/resource/Doogie_Howser,_M.D.]]></answer><answer><![CDATA[http://dbpedia.org/resource/Stark_Raving_Mad_(TV_series)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Capitol_Critters]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="259" onlydbo="true">
<string lang="en"><![CDATA[Who wrote The Hunger Games?]]></string>
<string lang="de"><![CDATA[Wer hat Die Tribute von Panem geschrieben?]]></string>
<string lang="es"><![CDATA[¿Quien escribió Los juegos del hambre?]]></string>
<string lang="it"><![CDATA[Chi ha scritto Hunger Games?]]></string>
<string lang="fr"><![CDATA[Qui est l'auteur de The Hunger Games]]></string>
<string lang="nl"><![CDATA[Wie heeft De Hongerspelen geschreven?]]></string>
<string lang="ro"><![CDATA[Cine a scris Jocurile Foamei?]]></string>
<keywords lang="en"><![CDATA[wrote, Hunger Games]]></keywords>
<keywords lang="de"><![CDATA[geschrieben, Die Tribute von Panem]]></keywords>
<keywords lang="es"><![CDATA[autor, Los juegos del hambre]]></keywords>
<keywords lang="it"><![CDATA[autore, Hunger Games]]></keywords>
<keywords lang="fr"><![CDATA[auteur, The Hunger Games]]></keywords>
<keywords lang="nl"><![CDATA[geschreven, De Hongerspelen]]></keywords>
<keywords lang="ro"><![CDATA[scris, Jocurile Foamei]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri
WHERE { 
        res:The_Hunger_Games dbo:author ?uri . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Suzanne_Collins]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="260" onlydbo="true">
<string lang="en"><![CDATA[Show a list of soccer clubs that play in the Bundesliga.]]></string>
<string lang="de"><![CDATA[Zeig mir eine Liste der Fußballvereine, die in der Bundesliga spielen.]]></string>
<string lang="es"><![CDATA[Dame una lista de los clubs de futbol que juegan en Bundesliga.]]></string>
<string lang="it"><![CDATA[Dammi una lista di club calcistici che giocano nella Bundesliga.]]></string>
<string lang="fr"><![CDATA[Donne-moi la liste des clubs de football qui jouent dans la Bundesliga.]]></string>
<string lang="nl"><![CDATA[Toen een lijst van voetbalclubs die in de Bundesliga spelen.]]></string>
<string lang="ro"><![CDATA[Arată o listă a cluburilor de fotbal care joacă în Bundesliga.]]></string>
<keywords lang="en"><![CDATA[soccer clubs, play, Bundesliga]]></keywords>
<keywords lang="de"><![CDATA[Fußballvereine, spielen, Bundesliga]]></keywords>
<keywords lang="es"><![CDATA[clubs de futbol, Bundesliga]]></keywords>
<keywords lang="it"><![CDATA[club calcistici, Bundesliga]]></keywords>
<keywords lang="fr"><![CDATA[clubs de football, Bundesliga]]></keywords>
<keywords lang="nl"><![CDATA[voetbalclubs, spelen, Bundesliga]]></keywords>
<keywords lang="ro"><![CDATA[cluburi de fotbal, joacă, Bundesliga]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:SoccerClub .
        ?uri dbo:league res:Bundesliga . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/SC_Freiburg]]></answer><answer><![CDATA[http://dbpedia.org/resource/FC_Bayern_Munich]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hannover_96]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hamburger_SV]]></answer><answer><![CDATA[http://dbpedia.org/resource/Borussia_Dortmund]]></answer><answer><![CDATA[http://dbpedia.org/resource/TSG_1899_Hoffenheim]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bayer_04_Leverkusen]]></answer><answer><![CDATA[http://dbpedia.org/resource/Eintracht_Frankfurt]]></answer><answer><![CDATA[http://dbpedia.org/resource/Eintracht_Braunschweig]]></answer><answer><![CDATA[http://dbpedia.org/resource/SV_Werder_Bremen]]></answer><answer><![CDATA[http://dbpedia.org/resource/VfL_Wolfsburg]]></answer><answer><![CDATA[http://dbpedia.org/resource/Borussia_M%C3%B6nchengladbach]]></answer><answer><![CDATA[http://dbpedia.org/resource/FC_Schalke_04]]></answer><answer><![CDATA[http://dbpedia.org/resource/VfB_Stuttgart]]></answer><answer><![CDATA[http://dbpedia.org/resource/1._FC_N%C3%BCrnberg]]></answer><answer><![CDATA[http://dbpedia.org/resource/FC_Augsburg]]></answer><answer><![CDATA[http://dbpedia.org/resource/1._FSV_Mainz_05]]></answer><answer><![CDATA[http://dbpedia.org/resource/Hertha_BSC]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="261" onlydbo="false">
<string lang="en"><![CDATA[What country is Mount Everest in?]]></string>
<string lang="de"><![CDATA[In welchem Land ist der Mount Everest?]]></string>
<string lang="es"><![CDATA[¿En que país esta el monte Everest?]]></string>
<string lang="it"><![CDATA[In quale stato si trova il Monte Everest?]]></string>
<string lang="fr"><![CDATA[Dans quel pays se trouve le mont Everest?]]></string>
<string lang="nl"><![CDATA[In welke land is de Mount Everest?]]></string>
<string lang="ro"><![CDATA[În ce țară se află muntele Everest?]]></string>
<keywords lang="en"><![CDATA[country, Mount Everest]]></keywords>
<keywords lang="de"><![CDATA[Land, Mount Everest]]></keywords>
<keywords lang="es"><![CDATA[país, monte Everest]]></keywords>
<keywords lang="it"><![CDATA[stato, Monte Everest]]></keywords>
<keywords lang="fr"><![CDATA[pays, Everest]]></keywords>
<keywords lang="nl"><![CDATA[land, Mount Everest]]></keywords>
<keywords lang="ro"><![CDATA[țară, muntele Everest]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        res:Mount_Everest dbo:locatedInArea ?uri . 
        ?uri rdf:type dbo:Country .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/China]]></answer><answer><![CDATA[http://dbpedia.org/resource/Nepal]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="262" onlydbo="true">
<string lang="en"><![CDATA[Who is the founder of Penguin Books?]]></string>
<string lang="de"><![CDATA[Wer hat Penguin Books gegründet?]]></string>
<string lang="es"><![CDATA[¿Quien es el fundador de Penguin Books?]]></string>
<string lang="it"><![CDATA[Chi è il fondatore di Penguin Books?]]></string>
<string lang="fr"><![CDATA[Qui est le fondateur de Penguin  Books?]]></string>
<string lang="nl"><![CDATA[Wie is de oprichter van Penguin Books?]]></string>
<string lang="ro"><![CDATA[Cine este fondatorul Penguin Books?]]></string>
<keywords lang="en"><![CDATA[founder, Penguin Books]]></keywords>
<keywords lang="de"><![CDATA[gegründet, Penguin Books]]></keywords>
<keywords lang="es"><![CDATA[fundador, Penguin Books]]></keywords>
<keywords lang="it"><![CDATA[fondatore, Penguin Books]]></keywords>
<keywords lang="fr"><![CDATA[fondateur, Penguin Books]]></keywords>
<keywords lang="nl"><![CDATA[oprichter, Penguin Books]]></keywords>
<keywords lang="ro"><![CDATA[fondator, Penguin Books]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        res:Penguin_Books dbo:founder ?uri .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Allen_Lane]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="263" onlydbo="true">
<string lang="en"><![CDATA[Which programming languages influenced Javascript?]]></string>
<string lang="de"><![CDATA[Welche Programmiersprachen haben Javascript beeinflusst?]]></string>
<string lang="es"><![CDATA[¿Que lenguajes de programación influenciaron el Javascript?]]></string>
<string lang="it"><![CDATA[Quali linguaggi di programmazione hanno influenzato Javascript?]]></string>
<string lang="fr"><![CDATA[Quels langages de programmation ont influencé Javascript?]]></string>
<string lang="nl"><![CDATA[Welke pogrammeertalen hadden invloed op Javascript?]]></string>
<string lang="ro"><![CDATA[Ce limbaje de programare au influențat Javascript?]]></string>
<keywords lang="en"><![CDATA[programming languages, influenced, Javascript]]></keywords>
<keywords lang="de"><![CDATA[Programmiersprachen, beeinflusst, Javascript]]></keywords>
<keywords lang="es"><![CDATA[lenguajes de programación, influenciaron, Javascript]]></keywords>
<keywords lang="it"><![CDATA[linguaggi di programmazione, hanno influenzato, Javascript]]></keywords>
<keywords lang="fr"><![CDATA[langages de programmation, influencés, Javascript]]></keywords>
<keywords lang="nl"><![CDATA[programmeertalen, invloed op, Javascript]]></keywords>
<keywords lang="ro"><![CDATA[limbaje de programare, influențat, Javascript]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:ProgrammingLanguage .
        ?uri dbo:influenced res:JavaScript . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Self_(programming_language)]]></answer><answer><![CDATA[http://dbpedia.org/resource/C_(programming_language)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Java_(programming_language)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lisp_(programming_language)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Perl]]></answer><answer><![CDATA[http://dbpedia.org/resource/Python_(programming_language)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Scheme_(programming_language)]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="boolean" id="264" onlydbo="true">
<string lang="en"><![CDATA[Did Che Guevara have children?]]></string>
<string lang="de"><![CDATA[Hatte Che Guevara Kinder?]]></string>
<string lang="es"><![CDATA[¿Tuvo hijos el Che Guevara?]]></string>
<string lang="it"><![CDATA[Che Guevara aveva dei figli?]]></string>
<string lang="fr"><![CDATA[Est-ce que Che Guevara a eu des enfants?]]></string>
<string lang="nl"><![CDATA[Had Che Guevara kinderen?]]></string>
<string lang="ro"><![CDATA[Che Guevara a avut copii?]]></string>
<keywords lang="en"><![CDATA[children, Che Guevara]]></keywords>
<keywords lang="de"><![CDATA[Kinder, Che Guevara]]></keywords>
<keywords lang="es"><![CDATA[hijos, Che Guevara]]></keywords>
<keywords lang="it"><![CDATA[figli, Che Guevara]]></keywords>
<keywords lang="fr"><![CDATA[enfants, Che Guevara]]></keywords>
<keywords lang="nl"><![CDATA[kinderen, Che Guevara]]></keywords>
<keywords lang="ro"><![CDATA[copii, Che Guevara]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE { 
        res:Che_Guevara dbo:child ?uri . 
}
]]></query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="265" onlydbo="true">
<string lang="en"><![CDATA[List all the musicals with music by Elton John.]]></string>
<string lang="de"><![CDATA[Liste alle Musicals mit Musik von Elton John auf.]]></string>
<string lang="es"><![CDATA[Dame todos los musicales con música de Elton John.]]></string>
<string lang="it"><![CDATA[Elenca tutti i musicals con musiche di Elton John.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les musicals avec de la musique de de Elton John.]]></string>
<string lang="nl"><![CDATA[Toen een lijst van alle musicals met muziek van Elton John.]]></string>
<string lang="ro"><![CDATA[Listează toate muzicalurile cu muzică de Elton John.]]></string>
<keywords lang="en"><![CDATA[musicals, music by, Elton John]]></keywords>
<keywords lang="de"><![CDATA[Musicals, Musik von, Elton John]]></keywords>
<keywords lang="es"><![CDATA[musicales, música, Elton John]]></keywords>
<keywords lang="it"><![CDATA[musicals, musiche, Elton John]]></keywords>
<keywords lang="fr"><![CDATA[musicals, musique, Elton John]]></keywords>
<keywords lang="nl"><![CDATA[musicals, muziek van, Elton John]]></keywords>
<keywords lang="ro"><![CDATA[muzicaluri, muzică de Elton John]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Musical .
        ?uri dbo:musicBy res:Elton_John .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/The_Lion_King_(musical)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lestat_(musical)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Billy_Elliot_the_Musical]]></answer><answer><![CDATA[http://dbpedia.org/resource/Aida_(musical)]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="date" id="267" onlydbo="true">
<string lang="en"><![CDATA[When was the Titanic completed?]]></string>
<string lang="de"><![CDATA[Wann wurde die Titanic fertiggestellt?]]></string>
<string lang="es"><![CDATA[¿Cuando se completo el Titanic?]]></string>
<string lang="it"><![CDATA[Quando è stato completato il Titanic?]]></string>
<string lang="fr"><![CDATA[Quand a été terminé le Titanic?]]></string>
<string lang="nl"><![CDATA[Wanneer was de Titanic afgewerkt?]]></string>
<string lang="ro"><![CDATA[Când a fost terminat Titanicul?]]></string>
<keywords lang="en"><![CDATA[Titanic, completion date]]></keywords>
<keywords lang="de"><![CDATA[Titanic, fertiggestellt, Datum]]></keywords>
<keywords lang="es"><![CDATA[fecha de acabado, Titanic]]></keywords>
<keywords lang="it"><![CDATA[Titanic, data, completamento]]></keywords>
<keywords lang="fr"><![CDATA[data de terminaison, Titanic]]></keywords>
<keywords lang="nl"><![CDATA[Titanic, wanneer, afgewerkt]]></keywords>
<keywords lang="ro"><![CDATA[Titanic, data terminării]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date
WHERE { 
        res:RMS_Titanic dbo:completionDate ?date . 
}
]]></query>
<answers><answer><![CDATA[1912-04-02+02:00]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="268" onlydbo="true">
<string lang="en"><![CDATA[How much did Pulp Fiction cost?]]></string>
<string lang="de"><![CDATA[Wieviel hat Pulp Fiction gekostet?]]></string>
<string lang="es"><![CDATA[¿Cuanto costo Pulp Fiction?]]></string>
<string lang="it"><![CDATA[Quanto è costato Pulp Fiction?]]></string>
<string lang="fr"><![CDATA[Combien a coûté Pulp Fiction?]]></string>
<string lang="nl"><![CDATA[Howeveel koste Pulp Fiction?]]></string>
<string lang="ro"><![CDATA[Cât a costat Pulp Fiction?]]></string>
<keywords lang="en"><![CDATA[cost, Pulp Fiction]]></keywords>
<keywords lang="de"><![CDATA[Kosten, Pulp Fiction]]></keywords>
<keywords lang="es"><![CDATA[costo, Pulp Fiction]]></keywords>
<keywords lang="it"><![CDATA[costo, Pulp Fiction]]></keywords>
<keywords lang="fr"><![CDATA[prix, Pulp Fiction]]></keywords>
<keywords lang="nl"><![CDATA[kosten, Pulp Fiction]]></keywords>
<keywords lang="ro"><![CDATA[cost, Pulp Fiction]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?n
WHERE { 
        res:Pulp_Fiction dbo:budget ?n . 
}
]]></query>
<answers><answer><![CDATA[8500000.0]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="number" id="269" onlydbo="true">
<string lang="en"><![CDATA[How many airlines are there?]]></string>
<string lang="de"><![CDATA[Wieviele Fluggesellschaften gibt es?]]></string>
<string lang="es"><![CDATA[¿Cuantas líneas aéreas existen?]]></string>
<string lang="it"><![CDATA[Quante compagnie aeree esistono?]]></string>
<string lang="fr"><![CDATA[Combien de companies aériennes existe-t-il?]]></string>
<string lang="nl"><![CDATA[Hoeveel luchtvaartmaatschappijen zijn er?]]></string>
<string lang="ro"><![CDATA[Câte companii aeriene există?]]></string>
<keywords lang="en"><![CDATA[how many, airlines]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Fluggesellschaften]]></keywords>
<keywords lang="es"><![CDATA[cuantas, líneas aéreas]]></keywords>
<keywords lang="it"><![CDATA[quante, compagnie aeree]]></keywords>
<keywords lang="fr"><![CDATA[nombre, companies aériennes]]></keywords>
<keywords lang="nl"><![CDATA[hoeveel, luchtvaartmaatschappijen]]></keywords>
<keywords lang="ro"><![CDATA[câte, companii aeriene]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT COUNT(DISTINCT ?uri)
WHERE { 
        ?uri rdf:type dbo:Airline . 
}
]]></query>
<answers><answer><![CDATA[3387]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="270" onlydbo="false">
<string lang="en"><![CDATA[Who played Agent Smith in Matrix?]]></string>
<string lang="de"><![CDATA[Wer hat Agent Smith in Matrix gespielt?]]></string>
<string lang="es"><![CDATA[¿Quien actuó como el agente Smith en Matrix?]]></string>
<string lang="it"><![CDATA[Chi interpretava l'agente Smith in Matrix?]]></string>
<string lang="fr"><![CDATA[Qui a joué Agent Smith dans Matrix?]]></string>
<string lang="nl"><![CDATA[Wie speelde Agent Smith in Matrix?]]></string>
<string lang="ro"><![CDATA[Cine l-a jucat pe Agent Smith în Matrix?]]></string>
<keywords lang="en"><![CDATA[played, Agent Smith, Matrix]]></keywords>
<keywords lang="de"><![CDATA[gespielt, Agent Smith, Matrix]]></keywords>
<keywords lang="es"><![CDATA[actor, agente Smith, Matrix]]></keywords>
<keywords lang="it"><![CDATA[attore, agente Smith, Matrix]]></keywords>
<keywords lang="fr"><![CDATA[acteur, Agent Smith, Matrix]]></keywords>
<keywords lang="nl"><![CDATA[speelde, Agent Smith, Matrix]]></keywords>
<keywords lang="ro"><![CDATA[jucat, Agent Smith, Matrix]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Agent_Smith dbp:portrayer ?uri . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Hugo_Weaving]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ian_Bliss]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="271" onlydbo="false">
<string lang="en"><![CDATA[How much carbs does peanut butter have?]]></string>
<string lang="de"><![CDATA[Wieviele Kohlenhydrate hat Erdnussbutter?]]></string>
<string lang="es"><![CDATA[¿Cuantos hidrates de carbono tienen la manteca de cacahuete?]]></string>
<string lang="it"><![CDATA[Quanti carboidrati ha il burro di noccioline?]]></string>
<string lang="fr"><![CDATA[Quelle quantité de glucides est contenue dans les arachides?]]></string>
<string lang="nl"><![CDATA[Hoeveel koolhydraten heeft pindakaas?]]></string>
<string lang="ro"><![CDATA[Câți carbohidrați conține untul de arahide?]]></string>
<keywords lang="en"><![CDATA[how much, carbs, peanut butter]]></keywords>
<keywords lang="de"><![CDATA[wieviele, Kohlenhydrate, Erdnussbutter]]></keywords>
<keywords lang="es"><![CDATA[hidrates de carbono, manteca de cacahuete]]></keywords>
<keywords lang="it"><![CDATA[quanti, carboidrati, burro di noccioline]]></keywords>
<keywords lang="fr"><![CDATA[glucides, arachides]]></keywords>
<keywords lang="nl"><![CDATA[koolhydraten, pindakaas]]></keywords>
<keywords lang="ro"><![CDATA[câți, carbohidrați, unt de arahide]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?carbs
WHERE { 
        res:Peanut_butter dbp:carbs ?carbs .
}
]]></query>
<answers><answer><![CDATA[20.0]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="272" onlydbo="true">
<string lang="en"><![CDATA[Which book has the most pages?]]></string>
<string lang="de"><![CDATA[Welches Buch hat die meisten Seiten?]]></string>
<string lang="es"><![CDATA[¿Que libro tiene el mayor numero de paginas?]]></string>
<string lang="it"><![CDATA[Quale libro ha il maggior numero di pagine?]]></string>
<string lang="fr"><![CDATA[Quel livre a le plus de pages?]]></string>
<string lang="nl"><![CDATA[Welk boek heeft de meeste pagina's?]]></string>
<string lang="ro"><![CDATA[Ce carte are cele mai multe pagini?]]></string>
<keywords lang="en"><![CDATA[book, the most pages]]></keywords>
<keywords lang="de"><![CDATA[Buch, meisten Seiten]]></keywords>
<keywords lang="es"><![CDATA[libro, mayor numero paginas]]></keywords>
<keywords lang="it"><![CDATA[libro, maggior numero di pagine]]></keywords>
<keywords lang="fr"><![CDATA[livre, le plus de pages]]></keywords>
<keywords lang="nl"><![CDATA[boek, meeste pagina's]]></keywords>
<keywords lang="ro"><![CDATA[carte, cele mai multe pagini]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Book . 
        ?uri dbo:numberOfPages ?n .
}
ORDER BY DESC(?n)
OFFSET 0 LIMIT 1
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/The_Tolkien_Reader]]></answer></answers></question>

