<?xml version="1.0"?>
<dataset id="qald-5_train">

<question id="317" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Which buildings in art deco style did Shreve, Lamb and Harmon design?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri dbo:architect <http://dbpedia.org/resource/Shreve,_Lamb_&_Harmon> .
      { ?uri dbo:architecturalStyle res:Art_Deco . }
      UNION
      { ?uri text:"style text:"art deco" . } 
}
]]>
</pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Empire_State_Building]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Joel_W._Solomon_Federal_Building_and_United_States_Courthouse]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Hill_Building]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/500_Fifth_Avenue]]></answer>
</answers>
</question>

<question id="318" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Which birds are protected under the National Parks and Wildlife Act?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
    ?uri rdf:type dbo:Bird .    
    ?uri text:"protected under" text:"National Parks and Wildlife Act".
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Australian_Shelduck]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Chestnut_Teal]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Bar-shouldered_Dove]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Black-faced_Cuckoo-shrike]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Yellow_Thornbill]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Australian_Shoveler]]></answer>
</answers>
</question>

<question id="319" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Which country did the first known photographer of snowflakes come from?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        ?uri text:"is" text:"first known photographer of snowflakes" .
        ?uri dbo:birthPlace ?x .
        ?x rdf:type dbo:Country .   
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/United_States]]></answer>
</answers>
</question>

<question id="320" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[List all the battles commanded by the lover of Cleopatra.]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
    ?x text:"lover" text:"Cleopatra".   
    ?uri dbo:commander ?x .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_Pharsalus]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_Gergovia]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Avaricum]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Gallic_Wars]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_Zela]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Siege_of_Uxellodunum]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Siege_of_Alexandria_(47_BC)]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_Dyrrhachium_(48_BC)]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_Munda]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_Thapsus]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_Alesia]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_Vosges_(58_BC)]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_the_Sabis]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Siege_of_Massilia]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_the_Arar]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_Bibracte]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_the_Axona]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Caesar's_Civil_War]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_Ruspina]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_the_Nile_(47_BC)]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Battle_of_Ilerda]]></answer>
<answer><![CDATA[http://dbpedia.org/resource/Caesar's_invasions_of_Britain]]></answer>
</answers>
</question>

<question id="321" answertype="boolean" aggregation="true" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Are the Rosetta Stone and the Gayer-Andersen cat exhibited in the same museum?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE {
        ?m1 text:"exhibits" res:Rosetta_Stone . 
        res:Gayer-Anderson_cat dbo:museum ?x .
        ?m2 rdfs:label ?m2 .
        FILTER (?m1=?m2)
}
]]></pseudoquery>
<answers>
<answer><![CDATA[true]]></answer>
</answers>
</question>

<question id="322" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Which actress starring in the TV series Friends owns the production company Coquette Productions?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
    res:Friends dbo:starring ?uri . 
    ?uri text:"own" text:"the production company Coquette Productions" .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Courteney_Cox]]></answer>
</answers>
</question>

<question id="323" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Gaborone is the capital of which country member of the African Union?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
    ?uri text:"member of" text:"African Union" .    
    ?uri dbo:capital res:Gaborone .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Botswana]]></answer>
</answers>
</question>

<question id="324" answertype="date" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[When was the composer of the opera Madame Butterfly born?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE {
    res:Madama_Butterfly text:"composer" ?x .
    ?x dbo:birthDate ?date .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[1858-12-22]]></answer>
</answers>
</question>

<question id="325" answertype="resource" aggregation="false" onlydbo="false" hybrid="true">
<string lang="en"><![CDATA[Which street basketball player was diagnosed with Sarcoidosis?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
  ?uri rdf:type yago:StreetBasketballPlayers .
  ?uri text:"diagnosed with" text:"Sarcoidosis".
}
]]>
</pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Slick_Watts]]></answer>
</answers>
</question>

<question id="326" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[For which movie did the daughter of Francis Ford Coppola receive an Oscar?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Francis_Ford_Coppola dbo:child ?x .
        ?x text:"receive Oscar for" ?uri .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Lost_in_Translation_(film)]]></answer>
</answers>
</question>

<question id="327" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Which city does the first person to climb all 14 eight-thousanders come from?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE {
        ?x text:"is" text:"first person to climb all fourteen eight-thousanders" .
        ?x dbo:birthPlace ?uri .
        ?uri rdf:type dbo:Settlement .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://http://dbpedia.org/page/Brixen]]></answer>
</answers>
</question>

<question id="328" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[At which college did the only American actor that received the César Award study?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?string
WHERE {
        ?x text:"is" text:"the only American actor that received the César Award" .
        ?x dbo:almaMater ?uri .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Queens_College,_City_University_of_New_York]]></answer>
</answers>
</question>

<question id="329" answertype="boolean" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Did Napoleon's first wife die in France?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        ?x text:"first wife of" text:"Napoleon" .
        ?x dbo:deathPlace res:France .  
}
]]></pseudoquery>
<answers>
<answer><![CDATA[true]]></answer>
</answers>
</question>

<question id="330" answertype="number" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[How old is James Bond in the latest Bond book by William Boyd?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:James_Bond dbo:lastAppearance ?x .
        ?x dbo:author <http://dbpedia.org/resource/William_Boyd_(writer)> .
        ?x text:"age of Bond" ?n .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[45]]></answer>
</answers>
</question>

<question id="331" answertype="resource" aggregation="false" onlydbo="false" hybrid="true">
<string lang="en"><![CDATA[What eating disorder is characterized by an appetite for substances such as clay and sand?]]></string>
<pseudoquery><![CDATA[
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX yago: <http://dbpedia.org/class/yago/>
SELECT ?uri WHERE
{
  ?uri rdf:type yago:EatingDisorders .
  ?uri text:"characterized by" "appetite for clay and sand" .
}
]]></pseudoquery>
<answers>  
<answer><![CDATA[http://dbpedia.org/resource/Pica_(disorder)]]></answer>
</answers>
</question>

<question id="332" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[What is the native city of Hollywood's highest-paid actress?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE {
        ?x text:"is" text:"Hollywood's highest-paid actress" .
        ?x dbo:birthPlace ?uri .
        ?x rdf:type dbo:City .
}
]]></pseudoquery>
<answers>  
<answer><![CDATA[http://dbpedia.org/resource/Los_Angeles]]></answer>
</answers>
</question>

<question id="333" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[In which city does the former main presenter of the Xposé girls live?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        ?x text:"is" text:"former presenter of the Xposé girls" .
        ?x dbo:residence ?uri .
]]></pseudoquery>
<answers>  
<answer><![CDATA[http://dbpedia.org/resource/Dublin]]></answer>
</answers>
</question>

<question id="334" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Who plays Phileas Fogg in the adaptation of Around the World in 80 Days directed by Buzz Kulik?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri 
WHERE {
        ?x rdfs:label ?l .
        FILTER regex(?l,"Around the World in 80 Days","i")
        ?x dbo:director res:Buzz_Kulik .
        ?x dbo:starring ?uri .
        ?uri text:"as" text:"Phileas Fogg" .
}       
]]></pseudoquery>
<answers>  
<answer><![CDATA[http://dbpedia.org/resource/Pierce_Brosnan]]></answer>
</answers>
</question>

<question id="335" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Who is the front man of the band that wrote Coffee & TV?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
        <http://dbpedia.org/page/Coffee_&_TV> dbo:musicalArtist ?x .
        ?x dbo:bandMember ?uri .
        ?uri text:"is" text:"frontman" .
}      
]]></pseudoquery>
<answers>  
<answer><![CDATA[http://dbpedia.org/resource/Damon_Albarn]]></answer>
</answers>
</question>

<question id="336" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Which Chinese-speaking country is a former Portguese colony?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        res:Chinese_language dbo:spokenIn ?uri . 
        ?uri text:"is" text:"former Portuguese colony" . 
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Macau]]></answer>
</answers>
</question>

<question id="337" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[What is the largest city in the county in which Faulkner spent most of his life?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        res:William_Faulkner text:"spent most of his life in" ?x . 
        ?x dbo:largestCity ?uri . 
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Oxford,_Mississippi]]></answer>
</answers>
</question>

<question id="338" answertype="number" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[In which year did the Hungarian-American actor called "The King of Horror" make his first film?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?year
WHERE {
        ?x rdf:type dbo:Actor .
        ?x dbo:alias "The King Of Horror" .
        ?x text:"made his first movie in" ?year .
]]></pseudoquery>
<answers>
<answer><![CDATA[1917]]></answer>
</answers>
</question>

<question id="339" answertype="string" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[Under which pseudonym did Charles Dickens publish some of his books?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?s
WHERE { 
        ?x dbo:author res:Charles_Dickens . 
        ?x text:"published under pseudonyn" ?s . 
}
]]></pseudoquery>
<answers>
<answer><![CDATA[Boz]]></answer>
</answers>
</question>

<question id="340" answertype="resource" aggregation="false" onlydbo="true" hybrid="true">
<string lang="en"><![CDATA[A landmark of which city is the home of the Mona Lisa?]]></string>
<pseudoquery><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Mona_Lisa dbo:museum ?x .
        ?x text:"landmark in" ?uri .
}
]]></pseudoquery>
<answers>
<answer><![CDATA[http://dbpedia.org/resource/Paris]]></answer>
</answers>
</question>

</dataset>