<?xml version="1.0"?>
<dataset id="qald-5_train">

<question aggregation="false" hybrid="false" answertype="resource" id="63" onlydbo="true">
<string lang="en"><![CDATA[Give me all actors starring in Last Action Hero.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.]]></string>
<string lang="es"><![CDATA[Dame todos los actores que hayan actuado en Last Action Hero.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli attori che hanno recitato in Last Action Hero.]]></string>
<string lang="fr"><![CDATA[Noem alle acteurs uit de film Last Action Hero.]]></string>
<string lang="nl"><![CDATA[Noem alle acteurs uit de film Last Action Hero.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți actorii cu roluri principale în Last Action Hero.]]></string>
<keywords lang="en"><![CDATA[actor, starring, Last Action Hero]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, mitspielen, Last Action Hero]]></keywords>
<keywords lang="es"><![CDATA[actores, Last Action Hero]]></keywords>
<keywords lang="it"><![CDATA[attori, Last Action Hero]]></keywords>
<keywords lang="fr"><![CDATA[acteurs, Last Action Hero]]></keywords>
<keywords lang="nl"><![CDATA[acteur, Last Action Hero]]></keywords>
<keywords lang="ro"><![CDATA[actor, rol principal, Last Action Hero]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Last_Action_Hero dbo:starring ?uri . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Robert_Prosky]]></answer><answer><![CDATA[http://dbpedia.org/resource/Anthony_Quinn]]></answer><answer><![CDATA[http://dbpedia.org/resource/Arnold_Schwarzenegger]]></answer><answer><![CDATA[http://dbpedia.org/resource/Austin_O'Brien]]></answer><answer><![CDATA[http://dbpedia.org/resource/Art_Carney]]></answer><answer><![CDATA[http://dbpedia.org/resource/F._Murray_Abraham]]></answer><answer><![CDATA[http://dbpedia.org/resource/Charles_Dance]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tom_Noonan]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bridgette_Wilson]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="65" onlydbo="false">
<string lang="en"><![CDATA[Which companies work in the aerospace industry as well as in medicine?]]></string>
<string lang="de"><![CDATA[Welche Unternehmen sind sowohl in der Luft- und Raumfahrt als auch im Bereich der Medizin tätig?]]></string>
<string lang="es"><![CDATA[¿Qué empresas aerospaciales trabajar también en en medicina?]]></string>
<string lang="it"><![CDATA[Quali aziende si occupano sia nell'industria aerospaziale che in ambito medico?]]></string>
<string lang="fr"><![CDATA[Quelles companies travaillent dans l'aérospatial et dans la médecine?]]></string>
<string lang="nl"><![CDATA[Welke bedrijven zijn zowel actief in de ruimtevaartindustrie als in de geneeskunde?]]></string>
<string lang="ro"><![CDATA[Ce companii lucrează în industria aerospațială, precum și în medicină?]]></string>
<keywords lang="en"><![CDATA[company, aerospace industry, medicine]]></keywords>
<keywords lang="de"><![CDATA[Unternehmen, Luft- und Raumfahrt, Medizin]]></keywords>
<keywords lang="es"><![CDATA[empresas, areospaciales, medicina]]></keywords>
<keywords lang="it"><![CDATA[azienda, industria aerospaziale, ambito medico]]></keywords>
<keywords lang="fr"><![CDATA[companies, aérospatial, médecine]]></keywords>
<keywords lang="nl"><![CDATA[bedrijf, ruimtevaartindustrie, geneeskunde]]></keywords>
<keywords lang="ro"><![CDATA[companii, industrie aerospațială, medicină]]></keywords>
<query><![CDATA[
PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Company  .
        ?uri dbo:industry res:Aerospace . 
        ?uri dbo:industry res:Medicine .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Radiall]]></answer><answer><![CDATA[http://dbpedia.org/resource/Makino]]></answer><answer><![CDATA[http://dbpedia.org/resource/ATI_425_Titanium_Alloy]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="boolean" id="66" onlydbo="true">
<string lang="en"><![CDATA[Is Christian Bale starring in Velvet Goldmine?]]></string>
<string lang="de"><![CDATA[Spielt Christian Bale in Velvet Goldmine mit?]]></string>
<string lang="es"><![CDATA[¿Actúa Christian Bale en Velvet Goldmine?]]></string>
<string lang="it"><![CDATA[Christian Bale ha recitato in Velvet Goldmine?]]></string>
<string lang="fr"><![CDATA[Christian Bale joue-t-il dans Velvet Goldmine?]]></string>
<string lang="nl"><![CDATA[Speelt Christian Bale in Velvet Goldmine?]]></string>
<string lang="ro"><![CDATA[Joacă Christian Bale un rol principal în Velvet Goldmine?]]></string>
<keywords lang="en"><![CDATA[Christian Bale, starring, Velvet Goldmine]]></keywords>
<keywords lang="de"><![CDATA[Christian Bale, mitspielen, Velvet Goldmine]]></keywords>
<keywords lang="es"><![CDATA[Christian Bale, actúa, Velvet Goldmine]]></keywords>
<keywords lang="it"><![CDATA[Christian Bale, recitare, Velvet Goldmine]]></keywords>
<keywords lang="fr"><![CDATA[Christian Bale, joue, Velvet Goldmine]]></keywords>
<keywords lang="nl"><![CDATA[Christian Bale, speelt in, Velvet Goldmine]]></keywords>
<keywords lang="ro"><![CDATA[Christian Bale, rol principal, Velevet Goldmine]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE {
        res:Velvet_Goldmine dbo:starring res:Christian_Bale .
}
]]></query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="string" id="67" onlydbo="false">
<string lang="en"><![CDATA[Give me the websites of companies with more than 500000 employees.]]></string>
<string lang="de"><![CDATA[Gib mir alle Webseiten von Unternehmen mit mehr als 500000 Angestellten.]]></string>
<string lang="es"><![CDATA[Dame todas las páginas de Web de empresas con más de 500000 empleados.]]></string>
<string lang="it"><![CDATA[Dammi tutti i siti internet di aziende con più di 500000 dipendenti.]]></string>
<string lang="fr"><![CDATA[Donnes-moi les sites webs de companies avec plus de 500000 employés.]]></string>
<string lang="nl"><![CDATA[Geef me de websites van alle ondernemingen met meer dan 500000 werknemers.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate website-urile de la companiile cu mai mult de 500000 de angajați]]></string>
<keywords lang="en"><![CDATA[website, company, employee, more than 500000]]></keywords>
<keywords lang="de"><![CDATA[Webseite, Unternehmen, Angestellte, mehr als 500000]]></keywords>
<keywords lang="es"><![CDATA[página de Web, empreasas, empleados, más de 500000]]></keywords>
<keywords lang="it"><![CDATA[sito internet, azienda, dipendenti, più di 500000]]></keywords>
<keywords lang="fr"><![CDATA[sites webs, companies, plus de 500000 employés]]></keywords>
<keywords lang="nl"><![CDATA[website, onderneming, werknemers, meer dan 500000]]></keywords>
<keywords lang="ro"><![CDATA[website, companie, angajat, mai mult de 500000]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
SELECT DISTINCT ?string
WHERE {
         ?c rdf:type dbo:Company .
       { ?c dbo:numberOfEmployees ?employees . }
       UNION
       { ?c dbp:numEmployees ?employees . }
         FILTER( xsd:integer(?employees) > 500000 ) .
         ?c dbp:homepage ?string .
}
]]></query>
<answers><answer><![CDATA[http://volkswagenag.com]]></answer><answer><![CDATA[http://www.centro.co.id/]]></answer><answer><![CDATA[http://www.parkson.com.cn/]]></answer><answer><![CDATA[http://www.parkson.com.sg/]]></answer><answer><![CDATA[http://www.parkson.com.vn/]]></answer><answer><![CDATA[http://www.parkson.my/]]></answer><answer><![CDATA[http://www.wistron.com]]></answer><answer><![CDATA[http://www.g4s.com/]]></answer><answer><![CDATA[http://www.spb.gov.cn/]]></answer><answer><![CDATA[http://www.karsan.com/]]></answer><answer><![CDATA[http://www.crec.cn/]]></answer><answer><![CDATA[http://www.petrochina.com.cn/ptr/]]></answer><answer><![CDATA[http://www.sgcc.com.cn/ywlm/default.shtml]]></answer><answer><![CDATA[http://www.foxconn.com]]></answer><answer><![CDATA[http://www.issworld.com/]]></answer><answer><![CDATA[http://www.veritaslanguagesolutions.com]]></answer><answer><![CDATA[http://www.cnpc.com.cn/en/]]></answer><answer><![CDATA[http://www.koelnmesse.com]]></answer><answer><![CDATA[http://rostec.ru]]></answer><answer><![CDATA[http://www.walmart.com/]]></answer><answer><![CDATA[http://www.corporate.walmart.com]]></answer><answer><![CDATA[http://www.ixys.com/]]></answer><answer><![CDATA[http://www.zilog.com/]]></answer><answer><![CDATA[http://www.samsungcnt.com/]]></answer><answer><![CDATA[http://www.ringpower.com/]]></answer><answer><![CDATA[http://lamborghini.com/en/home/]]></answer><answer><![CDATA[http://www.slimmingworld.com]]></answer><answer><![CDATA[http://www.brother.com/]]></answer><answer><![CDATA[http://www.redcross.fi/en_GB/]]></answer><answer><![CDATA[http://www.jtekt.co.jp/e/index.html]]></answer><answer><![CDATA[http://www.servpro.com/]]></answer><answer><![CDATA[http://portlandgeneral.com/]]></answer><answer><![CDATA[http://www.verabradley.com/]]></answer><answer><![CDATA[http://www.nippon1.co.jp/index.html]]></answer><answer><![CDATA[http://www.nisamerica.com/]]></answer><answer><![CDATA[http://www.babcockborsigservice.com/index.php?id=27&amp;L=1]]></answer><answer><![CDATA[http://www.ohe-transport.de/]]></answer><answer><![CDATA[http://www.stx.co.kr]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="68" onlydbo="true">
<string lang="en"><![CDATA[Which actors were born in Germany?]]></string>
<string lang="de"><![CDATA[Welche Schauspieler wurden in Deutschland geboren?]]></string>
<string lang="es"><![CDATA[¿Qué actores nacieron en Alemania?]]></string>
<string lang="it"><![CDATA[Quali attori sono nati in Germania?]]></string>
<string lang="fr"><![CDATA[Quels acteurs sont nés en Allemagne?]]></string>
<string lang="nl"><![CDATA[Welke acteurs zijn geboren in Duitsland?]]></string>
<string lang="ro"><![CDATA[Ce actori au fost născuți în Germania?]]></string>
<keywords lang="en"><![CDATA[actor, born, Germany]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, geboren, Deutschland]]></keywords>
<keywords lang="es"><![CDATA[Actores, nacidos, Alemania]]></keywords>
<keywords lang="it"><![CDATA[attore, nato, Germania]]></keywords>
<keywords lang="fr"><![CDATA[acteurs, nés, Allemagne]]></keywords>
<keywords lang="nl"><![CDATA[acteur, geboren, Duitsland]]></keywords>
<keywords lang="ro"><![CDATA[actor, născut, Germania]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Actor .
      { ?uri dbo:birthPlace res:Germany . }
      UNION 
      { ?uri dbo:birthPlace ?place .
        ?place dbo:country res:Germany . }
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Kelly_Trump]]></answer><answer><![CDATA[http://dbpedia.org/resource/Dru_Berrymore]]></answer><answer><![CDATA[http://dbpedia.org/resource/Harry_S._Morgan]]></answer><answer><![CDATA[http://dbpedia.org/resource/Annette_Schwarz]]></answer><answer><![CDATA[http://dbpedia.org/resource/Karin_Schubert]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jack_Trevor]]></answer><answer><![CDATA[http://dbpedia.org/resource/Janine_Chang]]></answer><answer><![CDATA[http://dbpedia.org/resource/Freddy_Dalton]]></answer><answer><![CDATA[http://dbpedia.org/resource/Vince_Rockland]]></answer><answer><![CDATA[http://dbpedia.org/resource/Briana_Banks]]></answer><answer><![CDATA[http://dbpedia.org/resource/Julie_K._Smith]]></answer><answer><![CDATA[http://dbpedia.org/resource/Subaru_Kimura]]></answer><answer><![CDATA[http://dbpedia.org/resource/Michaela_Schaffrath]]></answer><answer><![CDATA[http://dbpedia.org/resource/Till_Kraemer]]></answer><answer><![CDATA[http://dbpedia.org/resource/Brigitte_Maier]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sascha_(pornographic_actor)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lena_Nitro]]></answer><answer><![CDATA[http://dbpedia.org/resource/Shyla_Jennings]]></answer><answer><![CDATA[http://dbpedia.org/resource/Susan_Wayland]]></answer><answer><![CDATA[http://dbpedia.org/resource/Anja_Juliette_Laval]]></answer><answer><![CDATA[http://dbpedia.org/resource/Shimon_Schwarzschild]]></answer><answer><![CDATA[http://dbpedia.org/resource/Tyra_Misoux]]></answer><answer><![CDATA[http://dbpedia.org/resource/Norman_Wooland]]></answer><answer><![CDATA[http://dbpedia.org/resource/Shy_Love]]></answer><answer><![CDATA[http://dbpedia.org/resource/Logan_McCree]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gordon_Hopkirk]]></answer><answer><![CDATA[http://dbpedia.org/resource/Amy_Ried]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ellen_Pollock]]></answer><answer><![CDATA[http://dbpedia.org/resource/Thom_Barron]]></answer><answer><![CDATA[http://dbpedia.org/resource/Katja_Kassin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Michel_Auclair]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ana_Nova]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gisela_Birkemeyer]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="resource" id="69" onlydbo="false">
<string lang="en"><![CDATA[Which caves have more than 3 entrances?]]></string>
<string lang="de"><![CDATA[Welche Höhlen haben mehr als 3 Eingänge?]]></string>
<string lang="es"><![CDATA[¿Qué cuevas tienen más de 3 entradas?]]></string>
<string lang="it"><![CDATA[Quali grotte hanno più di 3 entrate?]]></string>
<string lang="fr"><![CDATA[Quelles grottes ont plus de 3 entrées?]]></string>
<string lang="nl"><![CDATA[Welke grotten hebben meer dan drie ingangen?]]></string>
<string lang="ro"><![CDATA[Ce peșteri au mai mult de 3 intrări?]]></string>
<keywords lang="en"><![CDATA[cave, entrance, more than 3]]></keywords>
<keywords lang="de"><![CDATA[Höhle, Eingang, mehr als 3]]></keywords>
<keywords lang="es"><![CDATA[cueva, entrada, más de 3]]></keywords>
<keywords lang="it"><![CDATA[grotta, entrata, più di 3]]></keywords>
<keywords lang="fr"><![CDATA[grottes, plus de 3 entrées]]></keywords>
<keywords lang="nl"><![CDATA[grot, ingang, meer dan drie]]></keywords>
<keywords lang="ro"><![CDATA[peșteră, intrare, mai mult de 3]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Cave .
        ?uri dbp:entranceCount ?entrance .
        FILTER (?entrance > 3) .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Wookey_Hole_Caves]]></answer><answer><![CDATA[http://dbpedia.org/resource/Green_Grotto_Caves]]></answer><answer><![CDATA[http://dbpedia.org/resource/Jackson's_Bay_Cave]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mahakali_Caves]]></answer><answer><![CDATA[http://dbpedia.org/resource/Porth_yr_Ogof]]></answer><answer><![CDATA[http://dbpedia.org/resource/Fingal's_Cave]]></answer><answer><![CDATA[http://dbpedia.org/resource/Karla_Caves]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sistema_Sac_Actun]]></answer><answer><![CDATA[http://dbpedia.org/resource/S%C6%A1n_%C4%90o%C3%B2ng_Cave]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kharosa]]></answer><answer><![CDATA[http://dbpedia.org/resource/Seneca_Caverns_(Ohio)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Seneca_Caverns_(West_Virginia)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Callao_Cave]]></answer><answer><![CDATA[http://dbpedia.org/resource/Ingleborough_Cave]]></answer><answer><![CDATA[http://dbpedia.org/resource/Boho_Caves]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gaping_Gill]]></answer><answer><![CDATA[http://dbpedia.org/resource/Buchan_Caves]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gargantua_(cave)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Steinbr%C3%BCcken_Cave]]></answer><answer><![CDATA[http://dbpedia.org/resource/Easegill_System]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sistema_Ox_Bel_Ha]]></answer><answer><![CDATA[http://dbpedia.org/resource/Mammoth_Cave_(Utah)]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kazumura_Cave]]></answer><answer><![CDATA[http://dbpedia.org/resource/Paisley_Caves]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sistema_Dos_Ojos]]></answer><answer><![CDATA[http://dbpedia.org/resource/Shuang_River_Cave_Group]]></answer><answer><![CDATA[http://dbpedia.org/resource/Traungold_Cave]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gouffre_Jean-Bernard]]></answer><answer><![CDATA[http://dbpedia.org/resource/Redmond_Caves]]></answer><answer><![CDATA[http://dbpedia.org/resource/Great_Douk_Cave]]></answer><answer><![CDATA[http://dbpedia.org/resource/Candelaria_Caves]]></answer><answer><![CDATA[http://dbpedia.org/resource/Gruta_das_Torres]]></answer><answer><![CDATA[http://dbpedia.org/resource/Windsor_Great_Cave]]></answer><answer><![CDATA[http://dbpedia.org/resource/Sistema_Nohoch_Nah_Chich]]></answer><answer><![CDATA[http://dbpedia.org/resource/Trail_Creek_Caves]]></answer><answer><![CDATA[http://dbpedia.org/resource/Pollnagollum]]></answer><answer><![CDATA[http://dbpedia.org/resource/Kanheri_Caves]]></answer><answer><![CDATA[http://dbpedia.org/resource/Bhaja_Caves]]></answer><answer><![CDATA[http://dbpedia.org/resource/Phong_Nha_Cave]]></answer><answer><![CDATA[http://dbpedia.org/resource/Lost_John's_Cave]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="boolean" id="7" onlydbo="true">
<string lang="en"><![CDATA[Was the wife of president Lincoln called Mary?]]></string>
<string lang="de"><![CDATA[Hieß die Frau von Präsident Lincoln Mary?]]></string>
<string lang="es"><![CDATA[¿La mujer del presidente Lincoln se llama Mary?]]></string>
<string lang="it"><![CDATA[La moglie del presidente Lincoln si chiamava Mary?]]></string>
<string lang="fr"><![CDATA[Est-ce que l'épouse du président Lincoln s'appelait Mary?]]></string>
<string lang="nl"><![CDATA[Heette de echtgenote van president Lincoln Mary?]]></string>
<string lang="ro"><![CDATA[Este soția președintelui Lincoln numită Mary?]]></string>
<keywords lang="en"><![CDATA[Lincoln, president, wife, called, Mary]]></keywords>
<keywords lang="de"><![CDATA[Lincoln, Präsident, Frau, heißen, Mary]]></keywords>
<keywords lang="es"><![CDATA[mujer, presidente, Lincoln, se lamma, Mary]]></keywords>
<keywords lang="it"><![CDATA[moglie, presidente, Lincoln, si chiama, Mary]]></keywords>
<keywords lang="fr"><![CDATA[épouse, Lincoln, Mary, appelle]]></keywords>
<keywords lang="nl"><![CDATA[echtgenote, Lincoln, Mary]]></keywords>
<keywords lang="ro"><![CDATA[Lincoln, președinte, soție, numită, Mary]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
ASK 
WHERE {
        res:Abraham_Lincoln dbo:spouse ?spouse .
        ?spouse rdfs:label ?name .
        FILTER(regex(?name,'Mary')) 
}
]]></query>
<answers><answer><![CDATA[true]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="71" onlydbo="false">
<string lang="en"><![CDATA[Give me all video games published by Mean Hamster Software.]]></string>
<string lang="de"><![CDATA[Gib mir alle Videospiele von Mean Hamster Software.]]></string>
<string lang="es"><![CDATA[Dame todos los videojuegos de Mean Hamster Software.]]></string>
<string lang="it"><![CDATA[Dammi tutti i videogiochi di Mean Hamster Software.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les jeux vidéos publiés par Mean Hamster Software.]]></string>
<string lang="nl"><![CDATA[Geef me alle videogames van Mean Hamster Software.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate jocurile video publicate de Mean Hamster Software]]></string>
<keywords lang="en"><![CDATA[video game, publish, Mean Hamster Software]]></keywords>
<keywords lang="de"><![CDATA[Videospiel, Mean Hamster Software]]></keywords>
<keywords lang="es"><![CDATA[videojuego, Mean Hamster Software]]></keywords>
<keywords lang="it"><![CDATA[videogioco, prodotto, Mean Hamster Software]]></keywords>
<keywords lang="fr"><![CDATA[jeux vidéos, publiés, Mean Hamster Software]]></keywords>
<keywords lang="nl"><![CDATA[videogame, Mean Hamster Software]]></keywords>
<keywords lang="ro"><![CDATA[joc video, publicat, Mean Hamster Software]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
      ?uri rdf:type dbo:VideoGame .
      ?uri dbo:publisher res:Mean_Hamster_Software . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Riven]]></answer><answer><![CDATA[http://dbpedia.org/resource/Crossbow_(video_game)]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="72" onlydbo="true">
<string lang="en"><![CDATA[Which languages are spoken in Estonia?]]></string>
<string lang="de"><![CDATA[Welche Sprachen werden in Estland gesprochen?]]></string>
<string lang="es"><![CDATA[¿Qué idiomas se hablan en Estonia?]]></string>
<string lang="it"><![CDATA[Quali lingue sono parlate in Estonia?]]></string>
<string lang="fr"><![CDATA[Quelles langues parle-t-on en Estonie?]]></string>
<string lang="nl"><![CDATA[Welke talen worden gesproken in Estland?]]></string>
<string lang="ro"><![CDATA[Ce limbi sunt vorbite în Estonia?]]></string>
<keywords lang="en"><![CDATA[language, spoken, Estonia]]></keywords>
<keywords lang="de"><![CDATA[Sprache, sprechen, Estland]]></keywords>
<keywords lang="es"><![CDATA[idiomas, Estonia]]></keywords>
<keywords lang="it"><![CDATA[lingua, Estonia]]></keywords>
<keywords lang="fr"><![CDATA[langues, Estonie]]></keywords>
<keywords lang="nl"><![CDATA[taal, gesproken, Estland]]></keywords>
<keywords lang="ro"><![CDATA[limbă, vorbită, Estonia]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:spokenIn res:Estonia . 
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Estonian_language]]></answer><answer><![CDATA[http://dbpedia.org/resource/Finnish_language]]></answer><answer><![CDATA[http://dbpedia.org/resource/V%C3%B5ro_language]]></answer><answer><![CDATA[http://dbpedia.org/resource/Estonian_Sign_Language]]></answer><answer><![CDATA[http://dbpedia.org/resource/Russian_Sign_Language]]></answer><answer><![CDATA[http://dbpedia.org/resource/Seto_dialect]]></answer><answer><![CDATA[http://dbpedia.org/resource/Laiuse_Romani_language]]></answer><answer><![CDATA[http://dbpedia.org/resource/Baltic_Romani]]></answer><answer><![CDATA[http://dbpedia.org/resource/Modern_Swedish]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="number" id="73" onlydbo="true">
<string lang="en"><![CDATA[How many Aldi stores are there?]]></string>
<string lang="de"><![CDATA[Wieviele Aldi-Filialen gibt es?]]></string>
<string lang="es"><![CDATA[¿Cuántas tiendas Aldi hay?]]></string>
<string lang="it"><![CDATA[Quanti negozi Aldi ci sono?]]></string>
<string lang="fr"><![CDATA[Combien de magasins Aldi sont là?]]></string>
<string lang="nl"><![CDATA[Hoeveel Aldi winkels zijn er?]]></string>
<string lang="ro"><![CDATA[Câte magazine Aldi există?]]></string>
<keywords lang="en"><![CDATA[own, Aldi]]></keywords>
<keywords lang="de"><![CDATA[gehören, Aldi]]></keywords>
<keywords lang="es"><![CDATA[pertenece, Aldi]]></keywords>
<keywords lang="it"><![CDATA[possedere, Aldi]]></keywords>
<keywords lang="fr"><![CDATA[possède, Aldi]]></keywords>
<keywords lang="nl"><![CDATA[eigenaar, Aldi]]></keywords>
<keywords lang="ro"><![CDATA[avea, Aldi]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?number
WHERE {
        res:Aldi dbo:numberOfLocations ?number .
}
]]></query>
<answers><answer><![CDATA[9235]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="74" onlydbo="false">
<string lang="en"><![CDATA[Which capitals in Europe were host cities of the summer olympic games?]]></string>
<string lang="de"><![CDATA[In welchen europäischen Hauptstädten fanden olympische Sommerspiele statt?]]></string>
<string lang="es"><![CDATA[¿En qué capitales europeas tuvieron lugar los juegos olímpicos de verano?]]></string>
<string lang="it"><![CDATA[Quali capitali europee hanno ospitato i giochi olimpici estivi?]]></string>
<string lang="fr"><![CDATA[Quelles capitales européenes ont été hôtes de jeux olympiques d'été?]]></string>
<string lang="nl"><![CDATA[In welke Europese hoofdsteden waren de Olympische Zomerspelen?]]></string>
<string lang="ro"><![CDATA[Ce capitale europene au fost gazde ale Jocurile Olimpice de vară?]]></string>
<keywords lang="en"><![CDATA[capital, Europe, host city, summer olympic games]]></keywords>
<keywords lang="de"><![CDATA[europäisch, Hauptstadt, stattfinden, olympische Sommerspiele]]></keywords>
<keywords lang="es"><![CDATA[capital europea, juegos olímpicos de verano]]></keywords>
<keywords lang="it"><![CDATA[capitale, Europa, ospitare, giochi olimpici estivi]]></keywords>
<keywords lang="fr"><![CDATA[capitales européenes, hôtes, jeux olympiques d'été]]></keywords>
<keywords lang="nl"><![CDATA[Europese hoofdstad, plaatvinden, Olympische Zomerspelen]]></keywords>
<keywords lang="ro"><![CDATA[capital, Europa, oraș gazdă, Jocurile Olimpice]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type yago:CapitalsInEurope .
        ?uri rdf:type yago:HostCitiesOfTheSummerOlympicGames .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Amsterdam]]></answer><answer><![CDATA[http://dbpedia.org/resource/Athens]]></answer><answer><![CDATA[http://dbpedia.org/resource/Berlin]]></answer><answer><![CDATA[http://dbpedia.org/resource/Helsinki]]></answer><answer><![CDATA[http://dbpedia.org/resource/London]]></answer><answer><![CDATA[http://dbpedia.org/resource/Moscow]]></answer><answer><![CDATA[http://dbpedia.org/resource/Paris]]></answer><answer><![CDATA[http://dbpedia.org/resource/Rome]]></answer><answer><![CDATA[http://dbpedia.org/resource/Stockholm]]></answer></answers></question>

<question aggregation="false" hybrid="false" answertype="resource" id="75" onlydbo="true">
<string lang="en"><![CDATA[Who was the 16th president of the United States?]]></string>
<string lang="de"><![CDATA[Wer war der 16. Präsident der Vereinigten Staaten?]]></string>
<string lang="es"><![CDATA[¿Quién fue el 16th presidente de los Estados Unidos?]]></string>
<string lang="it"><![CDATA[Chi è stato il sedicesimo presidente degli Stati Uniti?]]></string>
<string lang="fr"><![CDATA[Qui fut le premier président des États-Unis?]]></string>
<string lang="nl"><![CDATA[Wie was de 16de president van de Verenigde Staten?]]></string>
<string lang="ro"><![CDATA[Cine a fost primul președinte al Statelor Unite?]]></string>
<keywords lang="en"><![CDATA[United States, 16th president]]></keywords>
<keywords lang="de"><![CDATA[Vereinigte Staaten, 16. Präsident]]></keywords>
<keywords lang="es"><![CDATA[estados unidos, primer presidente]]></keywords>
<keywords lang="it"><![CDATA[Stati Uniti, sedicesimo presidente]]></keywords>
<keywords lang="fr"><![CDATA[Etats-Unis, premier président]]></keywords>
<keywords lang="nl"><![CDATA[Verenigde Staten, 16de president]]></keywords>
<keywords lang="ro"><![CDATA[Statele Unite, primul președinte]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
         ?uri dbo:office 'President of the United States' .
         ?uri dbo:orderInOffice '16th' .
}
]]></query>
<answers><answer><![CDATA[http://dbpedia.org/resource/Abraham_Lincoln]]></answer></answers></question>

<question aggregation="true" hybrid="false" answertype="number" id="76" onlydbo="true">
<string lang="en"><![CDATA[How many films did Hal Roach produce?]]></string>
<string lang="de"><![CDATA[Wieviele Filme hat Hal Roach produziert?]]></string>
<string lang="es"><![CDATA[¿Cuántas películas ha producido Hal Roach?]]></string>
<string lang="it"><![CDATA[Quanti film ha prodotto Hal Roach?]]></string>
<string lang="fr"><![CDATA[Combien de films ont été produit par Hal Roach?]]></string>
<string lang="nl"><![CDATA[Hoeveel films heeft Hal Roach geproduceerd?]]></string>
<string lang="ro"><![CDATA[Câte filme a produs Hal Roach?]]></string>
<keywords lang="en"><![CDATA[Hal Roach, produce, film]]></keywords>
<keywords lang="de"><![CDATA[Hal Roach, produzieren, Film]]></keywords>
<keywords lang="es"><![CDATA[películas, producido, Hal Roach]]></keywords>
<keywords lang="it"><![CDATA[film, prodotto, Hal Roach]]></keywords>
<keywords lang="fr"><![CDATA[combien, films, Hal Roach]]></keywords>
<keywords lang="nl"><![CDATA[Hal Roach, producent, film]]></keywords>
<keywords lang="ro"><![CDATA[Hal Roach, produs, film]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
SELECT COUNT(DISTINCT ?uri) 
WHERE {
        ?uri dbo:producer res:Hal_Roach .
}
]]></query>
<answers><answer><![CDATA[513]]></answer></answers></question>

