<?xml version="1.0" encoding="UTF-8" standalone="yes" ?>
<dataset id="dbpedia-train">

<question id="42">
<string><![CDATA[
Which software has been published by Electronic Arts?
]]></string>
<query><![CDATA[
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX onto: <http://dbpedia.org/ontology/>
PREFIX prop: <http://dbpedia.org/property/>
SELECT ?uri ?string
WHERE 
{
	?uri rdf:type onto:Software .
        ?uri prop:publisher "Electronic Arts"@en .
	OPTIONAL {?uri rdfs:label ?string .}
        FILTER (lang(?string) = "en") 
}
]]></query>
<answers>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Sid_Meier%27s_Alpha_Centauri
]]></uri>
<string><![CDATA[
Sid Meier's Alpha Centauri
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Quake_III_Arena
]]></uri>
<string><![CDATA[
Quake III Arena
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/The_Sims
]]></uri>
<string><![CDATA[
The Sims
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Half-Life_%28video_game%29
]]></uri>
<string><![CDATA[
Half-Life (video game)
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Populous
]]></uri>
<string><![CDATA[
Populous
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Ultima_Online
]]></uri>
<string><![CDATA[
Ultima Online
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Medal_of_Honor:_Allied_Assault
]]></uri>
<string><![CDATA[
Medal of Honor: Allied Assault
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Wasteland_%28video_game%29
]]></uri>
<string><![CDATA[
Wasteland (video game)
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Fountain_of_Dreams
]]></uri>
<string><![CDATA[
Fountain of Dreams
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/SimCity_4
]]></uri>
<string><![CDATA[
SimCity 4
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/The_Sims_Online
]]></uri>
<string><![CDATA[
The Sims Online
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Battlefield_1942
]]></uri>
<string><![CDATA[
Battlefield 1942
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Starflight
]]></uri>
<string><![CDATA[
Starflight
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Zany_Golf
]]></uri>
<string><![CDATA[
Zany Golf
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Skate_or_Die%21
]]></uri>
<string><![CDATA[
Skate or Die!
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/American_McGee%27s_Alice
]]></uri>
<string><![CDATA[
American McGee's Alice
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Ultima_Online:_Renaissance
]]></uri>
<string><![CDATA[
Ultima Online: Renaissance
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Medal_of_Honor:_Frontline
]]></uri>
<string><![CDATA[
Medal of Honor: Frontline
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/System_Shock_2
]]></uri>
<string><![CDATA[
System Shock 2
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Earth_&_Beyond
]]></uri>
<string><![CDATA[
Earth & Beyond
]]></string>
</answer>
</answers>
</question>
<question id="37">
<string><![CDATA[
List all episodes of the first season of the HBO television series "The Sopranos"!
]]></string>
<query><![CDATA[
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX onto: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT ?uri ?string
WHERE
{
	?uri onto:series res:The_Sopranos  .
        ?uri onto:seasonNumber 1 .
	OPTIONAL {?uri rdfs:label ?string .}
        FILTER (lang(?string) = "en") 
}
]]></query>
<answers>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/46_Long
]]></uri>
<string><![CDATA[
46 Long
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti
]]></uri>
<string><![CDATA[
The Legend of Tennessee Moltisanti
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Meadowlands_%28The_Sopranos%29
]]></uri>
<string><![CDATA[
Meadowlands (The Sopranos)
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/College_%28The_Sopranos%29
]]></uri>
<string><![CDATA[
College (The Sopranos)
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Pax_Soprana
]]></uri>
<string><![CDATA[
Pax Soprana
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Down_Neck
]]></uri>
<string><![CDATA[
Down Neck
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Boca_%28The_Sopranos%29
]]></uri>
<string><![CDATA[
Boca (The Sopranos)
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/A_Hit_Is_a_Hit
]]></uri>
<string><![CDATA[
A Hit Is a Hit
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano
]]></uri>
<string><![CDATA[
I Dream of Jeannie Cusamano
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Nobody_Knows_Anything
]]></uri>
<string><![CDATA[
Nobody Knows Anything
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Isabella_%28The_Sopranos%29
]]></uri>
<string><![CDATA[
Isabella (The Sopranos)
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/The_Sopranos_%28episode%29
]]></uri>
<string><![CDATA[
The Sopranos (episode)
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Denial,_Anger,_Acceptance
]]></uri>
<string><![CDATA[
Denial, Anger, Acceptance
]]></string>
</answer>
</answers>
</question>
<question id="32">
<string><![CDATA[
Is Christian Bale starring in "Batman Begins"?
]]></string>
<query><![CDATA[
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX onto: <http://dbpedia.org/ontology/>
ASK
WHERE 
{
	?film rdf:type onto:Film .
        ?film onto:starring ?actors .
        ?actors rdfs:label "Christian Bale"@en .
        ?film foaf:name "Batman Begins"@en
}
]]></query>
<answers>
<answer>
<boolean>
true
</boolean>
</answer>
</answers>
</question>
<question id="50">
<string><![CDATA[
Give me the websites of companies with more than 500000 employees.
]]></string>
<query><![CDATA[
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX prop: <http://dbpedia.org/property/>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX onto: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE 
{
	?subject  rdf:type               onto:Company .
	?subject  prop:numEmployees  ?employees .
	FILTER  ( xsd:integer(?employees) >= 500000 ) .
	?subject  foaf:homepage          ?uri .
}
]]></query>
<answers>
<answer>
<uri><![CDATA[
http://www.dhl.com/
]]></uri>
</answer>
<answer>
<uri><![CDATA[
http://www.g4s.com/
]]></uri>
</answer>
<answer>
<uri><![CDATA[
http://www.usps.com/
]]></uri>
</answer>
<answer>
<uri><![CDATA[
http://qt.nokia.com/
]]></uri>
</answer>
<answer>
<uri><![CDATA[
http://www.tmx.com/exchange
]]></uri>
</answer>
<answer>
<uri><![CDATA[
http://www.asx.com.au/
]]></uri>
</answer>
<answer>
<uri><![CDATA[
http://www.asx.com.au
]]></uri>
</answer>
<answer>
<uri><![CDATA[
http://www.verisign.com/
]]></uri>
</answer>
<answer>
<uri><![CDATA[
http://www.dhl.com/
]]></uri>
<uri><![CDATA[
http://www.g4s.com/
]]></uri>
</answer>
<answer>
<uri><![CDATA[
http://www.usps.com/
]]></uri>
<uri><![CDATA[
http://qt.nokia.com/
]]></uri>
</answer>
<answer>
<uri><![CDATA[
http://www.tmx.com/exchange
]]></uri>
<uri><![CDATA[
http://www.asx.com.au/
]]></uri>
</answer>
<answer>
<uri><![CDATA[
http://www.asx.com.au
]]></uri>
<uri><![CDATA[
http://www.verisign.com/
]]></uri>
</answer>
</answers>
</question>
<question id="35">
<string><![CDATA[
Give me all actors starring in Batman Begins.
]]></string>
<query><![CDATA[
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX onto: <http://dbpedia.org/ontology/>
SELECT ?uri ?string
WHERE 
{
	?film rdf:type onto:Film .
        ?film onto:starring ?uri .
        ?film foaf:name "Batman Begins"@en .
	OPTIONAL {?uri rdfs:label ?string .}
        FILTER (lang(?string) = "en") 
}
]]></query>
<answers>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Morgan_Freeman
]]></uri>
<string><![CDATA[
Morgan Freeman
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Michael_Caine
]]></uri>
<string><![CDATA[
Michael Caine
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Liam_Neeson
]]></uri>
<string><![CDATA[
Liam Neeson
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Gary_Oldman
]]></uri>
<string><![CDATA[
Gary Oldman
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Christian_Bale
]]></uri>
<string><![CDATA[
Christian Bale
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Cillian_Murphy
]]></uri>
<string><![CDATA[
Cillian Murphy
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Katie_Holmes
]]></uri>
<string><![CDATA[
Katie Holmes
]]></string>
</answer>
</answers>
</question>
<question id="14">
<string><![CDATA[
Who owns Aldi?
]]></string>
<query><![CDATA[
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX onto: <http://dbpedia.org/ontology/>
SELECT ?uri ?string
WHERE 
{
	?orga rdf:type onto:Organisation .
	?orga onto:keyPerson ?uri .
	?orga rdfs:label "Aldi"@en .
	OPTIONAL {?uri rdfs:label ?string .}
        FILTER (lang(?string) = "en") 
}
]]></query>
<answers>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Karl_Albrecht
]]></uri>
<string><![CDATA[
Karl Albrecht
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Theo_Albrecht
]]></uri>
<string><![CDATA[
Theo Albrecht
]]></string>
</answer>
</answers>
</question>
<question id="36">
<string><![CDATA[
Give me all films with Tom Cruise!
]]></string>
<query><![CDATA[
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX onto: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX prop: <http://dbpedia.org/property/>
SELECT ?uri ?string
WHERE 
{
	?uri rdf:type onto:Film.
	?uri prop:starring res:Tom_Cruise.
	OPTIONAL {?uri rdfs:label ?string .}
        FILTER (lang(?string) = "en") 
}
]]></query>
<answers>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Eyes_Wide_Shut
]]></uri>
<string><![CDATA[
Eyes Wide Shut
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Rain_Man
]]></uri>
<string><![CDATA[
Rain Man
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Minority_Report_%28film%29
]]></uri>
<string><![CDATA[
Minority Report (film)
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Jerry_Maguire
]]></uri>
<string><![CDATA[
Jerry Maguire
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/The_Color_of_Money
]]></uri>
<string><![CDATA[
The Color of Money
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Magnolia_%28film%29
]]></uri>
<string><![CDATA[
Magnolia (film)
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/The_Firm_%281993_film%29
]]></uri>
<string><![CDATA[
The Firm (1993 film)
]]></string>
</answer>
</answers>
</question>
<question id="16">
<string><![CDATA[
Give me all soccer clubs in the Premier League.
]]></string>
<query><![CDATA[
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX onto: <http://dbpedia.org/ontology/>
PREFIX resource: <http://dbpedia.org/resource/>
SELECT ?uri ?string
WHERE
{ 
   ?uri onto:league resource:Premier_League . 
   OPTIONAL {?uri rdfs:label ?string .}
   FILTER (lang(?string) = "en")
}
]]></query>
<answers>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Arsenal_F.C.
]]></uri>
<string><![CDATA[
Arsenal F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Chelsea_F.C.
]]></uri>
<string><![CDATA[
Chelsea F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Fulham_F.C.
]]></uri>
<string><![CDATA[
Fulham F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Liverpool_F.C.
]]></uri>
<string><![CDATA[
Liverpool F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Manchester_United_F.C.
]]></uri>
<string><![CDATA[
Manchester United F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/West_Bromwich_Albion_F.C.
]]></uri>
<string><![CDATA[
West Bromwich Albion F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Aston_Villa_F.C.
]]></uri>
<string><![CDATA[
Aston Villa F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/West_Ham_United_F.C.
]]></uri>
<string><![CDATA[
West Ham United F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Newcastle_United_F.C.
]]></uri>
<string><![CDATA[
Newcastle United F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Tottenham_Hotspur_F.C.
]]></uri>
<string><![CDATA[
Tottenham Hotspur F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Everton_F.C.
]]></uri>
<string><![CDATA[
Everton F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Manchester_City_F.C.
]]></uri>
<string><![CDATA[
Manchester City F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Sunderland_A.F.C.
]]></uri>
<string><![CDATA[
Sunderland A.F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Birmingham_City_F.C.
]]></uri>
<string><![CDATA[
Birmingham City F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Stoke_City_F.C.
]]></uri>
<string><![CDATA[
Stoke City F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Wolverhampton_Wanderers_F.C.
]]></uri>
<string><![CDATA[
Wolverhampton Wanderers F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Blackpool_F.C.
]]></uri>
<string><![CDATA[
Blackpool F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Bolton_Wanderers_F.C.
]]></uri>
<string><![CDATA[
Bolton Wanderers F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Blackburn_Rovers_F.C.
]]></uri>
<string><![CDATA[
Blackburn Rovers F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Harchester_United_F.C.
]]></uri>
<string><![CDATA[
Harchester United F.C.
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/Botswana_Defence_Force_XI
]]></uri>
<string><![CDATA[
Botswana Defence Force XI
]]></string>
</answer>
<answer>
<uri><![CDATA[
http://dbpedia.org/resource/London_Dynamo
]]></uri>
<string><![CDATA[
London Dynamo
]]></string>
</answer>
</answers>
</question>
<question id="41">
<string><![CDATA[
When was Lucas Arts founded?
]]></string>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX prop: <http://dbpedia.org/property/>
SELECT ?date
WHERE 
{
        res:LucasArts prop:foundation ?date .
}
]]></query>
<answers>
<answer>
<string><![CDATA[
May 1982
]]></string>
</answer>
</answers>
</question>
