{
"dataset": {
"id": "hobbit-1-train-largescale"
},
"questions": [
{
"id": "1",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Did A G Noorani attend a university?",
"keywords": "G Noorani, attend, university"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:A_G_Noorani dbo:almaMater ?x . ?x rdf:type dbo:University . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "2",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Did A Satyanarayana Shastri influence Aristotle?",
"keywords": "A Satyanarayana Shastri, influence, Aristotle"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Aristotle dbo:influencedBy res:A_Satyanarayana_Shastri . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "3",
"answertype": "boolean",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Does 1 Day With have more episodes than Game of Thrones?",
"keywords": "1 Day With, more, episodes, Game of Thrones"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:1_Day_With dbo:numberOfEpisodes ?x . res:Game_of_Thrones dbo:numberOfEpisodes ?y . FILTER (?x > ?y) }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "4",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Does the Aa River flow into a lake?",
"keywords": "Aa River, flow, lake"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { ?x dbo:inflow res:Aa_River . ?x rdf:type dbo:Lake . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "5",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "From which region is the Abouriou?",
"keywords": "region, Abouriou"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { res:Abouriou dbo:wineRegion ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/California_wine"
}
}
]
}
}
]
}
,
{
"id": "6",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all 2-step garage record labels.",
"keywords": "2-step garage record labels"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri rdf:type dbo:RecordLabel . ?uri dbo:genre res:2-step_garage . OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Hyperdub"
}
}
]
}
}
]
}
,
{
"id": "7",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all books written by Aaron Allston.",
"keywords": "books, written, Aaron Allston"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book . ?uri dbp:author res:Aaron_Allston . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Betrayal_(Star_Wars_novel)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Backlash_(Star_Wars_novel)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/The_Grand_Duchy_of_Karameikos"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/The_Dwarves_of_Rockhome"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Conviction_(Star_Wars_novel)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/The_Complete_Priest's_Handbook"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Karameikos:_Kingdom_of_Adventure"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Enemy_Lines:_Rebel_Dream"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Enemy_Lines:_Rebel_Stand"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Iron_Fist_(novel)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Solo_Command"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Starfighters_of_Adumar"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Wraith_Squadron"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Outcast_(Star_Wars_novel)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Exile_(Star_Wars_novel)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Fury_(Star_Wars_novel)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Dawn_of_the_Emperors:_Thyatis_and_Alphatia"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/The_Complete_Fighter's_Handbook"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Mercy_Kill"
}
}
]
}
}
]
}
,
{
"id": "8",
"answertype": "resource",
"aggregation": "union",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all cars that are produced in Algeria.",
"keywords": "cars, produced, Algeria"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Automobile . { ?uri dbo:assembly res:Algeria . } UNION { ?uri dbp:assembly res:Algeria . } UNION { { ?uri dbo:manufacturer ?x . } UNION { ?uri dbp:manufacturer ?x . } { ?x dbo:locationCountry res:Algeria . } UNION { ?x dbo:location res:Algeria . } } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Mercedes-Benz_G-Class"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Renault_8_and_10"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Dacia_Logan__II__1"
}
},
{
"uri": {
"type": "uri",
"value": ""
}
},
{
"uri": {
"type": "uri",
"value": ""
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Volkswagen_Amarok"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Mercedes-Benz_Atego"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Volkswagen_Polo_Mk5"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Renault_Estafette"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Renault_Symbol__II__1"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Dacia_Logan"
}
}
]
}
}
]
}
,
{
"id": "9",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all companies in Abidjan.",
"keywords": "companies, Abidjan"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri rdf:type dbo:Company . { ?uri dbo:location res:Abidjan . } UNION { ?uri dbo:headquarter res:Abidjan . } UNION { ?uri dbo:locationCity res:Abidjan . } OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/BRVM"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Air_Afrique"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Interivoire"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Air_Côte_d'Ivoire"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Air_Ivoire"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Abidjan_Transport_Company"
}
}
]
}
}
]
}
,
{
"id": "10",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all inflows of the Abbey Village Reservoir.",
"keywords": "inflows, Abbey Village Reservoir"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Abbey_Village_Reservoir> dbo:inflow ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/River_Roddlesworth"
}
}
]
}
}
]
}
,
{
"id": "11",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all members of 1 Giant Leap.",
"keywords": "members, 1 Giant Leap"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:1_Giant_Leap dbo:bandMember ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Jamie_Catto"
}
}
]
}
}
]
}
,
{
"id": "12",
"answertype": "resource",
"aggregation": "union",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all professional skateboarders from Brazil.",
"keywords": "professional, skateboarders, Brazil"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri dbo:occupation res:Skateboarding . { ?uri dbo:birthPlace res:Brazil . } UNION { ?uri dbo:birthPlace ?place . ?place dbo:country res:Brazil . } OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Bob_Burnquist"
}
}
]
}
}
]
}
,
{
"id": "13",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all soccer clubs in Abkhazia.",
"keywords": "soccer clubs, Abkhazia"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri rdf:type dbo:SoccerClub . { ?uri dbo:ground res:Abkhazia . } UNION { ?uri dbp:ground ?ground . FILTER (regex(?ground, 'Abkhazia')) } OPTIONAL {?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/FC_Dinamo_Sukhumi"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/FC_Tskhumi_Sukhumi"
}
}
]
}
}
]
}
,
{
"id": "14",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all video games published by 17-BIT.",
"keywords": "video games, published, 17-BIT"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri rdf:type dbo:VideoGame . { ?uri dbp:publisher '17-BIT'@en . } UNION { ?uri dbo:publisher res:17-BIT . } OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Skulls_of_the_Shogun"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Galak-Z:_The_Dimensional"
}
}
]
}
}
]
}
,
{
"id": "15",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me the children of Alan Moore.",
"keywords": "children, Alan Moore"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?child WHERE { res:Alan_Moore dbo:child ?child . }"
},
"answers": [
{
"head": {
"vars": [
"child"
]
},
"results": {
"bindings": [
{
"child": {
"type": "uri",
"value": "http://dbpedia.org/resource/Leah_Moore"
}
}
]
}
}
]
}
,
{
"id": "16",
"answertype": "string",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me the homepage of 032c.",
"keywords": "homepage, 032c"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX foaf: <http://xmlns.com/foaf/0.1/> SELECT DISTINCT ?string WHERE { res:032c foaf:homepage ?string . }"
},
"answers": [
{
"head": {
"vars": [
"string"
]
},
"results": {
"bindings": [
{
"string": {
"type": "literal",
"value": "http://032c.com"
}
}
]
}
}
]
}
,
{
"id": "17",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How big is the 23rd July Lake?",
"keywords": "big, 23rd July Lake"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> SELECT ?area WHERE { <http://dbpedia.org/resource/23rd_July_Lake> dbo:areaTotal ?area . }"
},
"answers": [
{
"head": {
"vars": [
"area"
]
},
"results": {
"bindings": [
{
"area": {
"type": "literal",
"value": "1e+06"
}
}
]
}
}
]
}
,
{
"id": "18",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How deep is 23rd July Lake?",
"keywords": "deep, 23rd July Lake"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/23rd_July_Lake> dbo:maximumDepth ?n . }"
},
"answers": [
{
"head": {
"vars": [
"n"
]
},
"results": {
"bindings": [
{
"n": {
"type": "literal",
"value": "5.0"
}
}
]
}
}
]
}
,
{
"id": "19",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How high is the 1839 Metre Summit?",
"keywords": "high, 1839 Metre Summit"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:1839_Metre_Summit dbo:elevation ?num. }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "1842.0"
}
}
]
}
}
]
}
,
{
"id": "21",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How high is the Admiralty Head Light?",
"keywords": "high, Admiralty Head Light"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?num WHERE { res:Admiralty_Head_Light dbo:height ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "9.144"
}
}
]
}
}
]
}
,
{
"id": "22",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many employees does 123Net have?",
"keywords": "many, employees, 123Net"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?number WHERE { res:123Net dbo:numberOfEmployees ?number . }"
},
"answers": [
{
"head": {
"vars": [
"number"
]
},
"results": {
"bindings": [
{
"number": {
"type": "literal",
"value": "50"
}
}
]
}
}
]
}
,
{
"id": "23",
"answertype": "number",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many ethnic groups live in Abbasid Caliphate?",
"keywords": "ethnic groups, live, Abbasid Caliphate"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?count) WHERE { res:Abbasid_Caliphate dbo:ethnicGroup ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"count"
]
},
"results": {
"bindings": [
{
"count": {
"type": "literal",
"value": "0"
}
}
]
}
}
]
}
,
{
"id": "24",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many inhabitants does Aachen-Mitte have?",
"keywords": "inhabitants, Aachen-Mitte"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:Aachen-Mitte dbo:populationTotal ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "168513"
}
}
]
}
}
]
}
,
{
"id": "25",
"answertype": "number",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many museums does Aalborg have?",
"keywords": "museums, Aalborg"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT (COUNT(DISTINCT ?uri) AS ?count) WHERE { ?uri rdf:type dbo:Museum . ?uri dbo:location res:Aalborg . }"
},
"answers": [
{
"head": {
"vars": [
"count"
]
},
"results": {
"bindings": [
{
"count": {
"type": "literal",
"value": "1"
}
}
]
}
}
]
}
,
{
"id": "26",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many pages does 100 Best Australian Albums have?",
"keywords": "pages, 100 Best Australian Albums"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?n WHERE { res:100_Best_Australian_Albums dbo:numberOfPages ?n . }"
},
"answers": [
{
"head": {
"vars": [
"n"
]
},
"results": {
"bindings": [
{
"n": {
"type": "literal",
"value": "256"
}
}
]
}
}
]
}
,
{
"id": "27",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many people live in the capital of Abbasid Caliphate?",
"keywords": "people, live, capital, Abbasid Caliphate"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:Abbasid_Caliphate dbo:capital ?x . ?x dbo:populationTotal ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "220488"
}
},
{
"num": {
"type": "literal",
"value": "10230350"
}
}
]
}
}
]
}
,
{
"id": "28",
"answertype": "number",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many politicians graduated from A N Magadh Medical College and Hospital?",
"keywords": "politicians, graduated, N Magadh Medical College and Hospital"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT (COUNT(DISTINCT ?uri) AS ?count) WHERE { ?uri dbo:profession res:Politician . ?uri dbo:almaMater res:A_N_Magadh_Medical_College_and_Hospital . }"
},
"answers": [
{
"head": {
"vars": [
"count"
]
},
"results": {
"bindings": [
{
"count": {
"type": "literal",
"value": "0"
}
}
]
}
}
]
}
,
{
"id": "29",
"answertype": "number",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many scientists graduated from A N Magadh Medical College and Hospital?",
"keywords": "scientists, graduated, N Magadh Medical College and Hospital"
}
],
"query":{
"sparql": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?count) WHERE { ?uri rdf:type dbo:Scientist . ?uri dbo:almaMater res:A_N_Magadh_Medical_College_and_Hospital . }"
},
"answers": [
{
"head": {
"vars": [
"count"
]
},
"results": {
"bindings": [
{
"count": {
"type": "literal",
"value": "0"
}
}
]
}
}
]
}
,
{
"id": "30",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many students does the A N Magadh Medical College and Hospital have?",
"keywords": "students, A N Magadh Medical College and Hospital"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:A_N_Magadh_Medical_College_and_Hospital dbo:numberOfStudents ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "50"
}
}
]
}
}
]
}
,
{
"id": "31",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How much did 10 MPH cost?",
"keywords": "10 MPH, cost"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?n WHERE { res:10_MPH dbo:budget ?n . }"
},
"answers": [
{
"head": {
"vars": [
"n"
]
},
"results": {
"bindings": [
{
"n": {
"type": "literal",
"value": "54000.0"
}
}
]
}
}
]
}
,
{
"id": "32",
"answertype": "number",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How often did Aarif Rahman marry?",
"keywords": "Aarif Rahman, marry"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?count) WHERE { res:Aarif_Rahman dbo:spouse ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"count"
]
},
"results": {
"bindings": [
{
"count": {
"type": "literal",
"value": "0"
}
}
]
}
}
]
}
,
{
"id": "33",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How tall is Aaric Murray?",
"keywords": "tall, Aaric Murray"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:Aaric_Murray dbo:height ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "2.0828"
}
}
]
}
}
]
}
,
{
"id": "34",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How tall is Abbey Clancy?",
"keywords": "tall, Abbey Clancy"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?height WHERE { res:Abbey_Clancy dbo:height ?height . }"
},
"answers": [
{
"head": {
"vars": [
"height"
]
},
"results": {
"bindings": [
{
"height": {
"type": "literal",
"value": "1.7526"
}
}
]
}
}
]
}
,
{
"id": "35",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "In which country is Aabenraa located?",
"keywords": "country, Aabenraa, located"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { res:Aabenraa dbo:country ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Denmark"
}
}
]
}
}
]
}
,
{
"id": "36",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "In which country is the 101 Mile Lake?",
"keywords": "country, 101 Mile Lake"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:101_Mile_Lake dbo:country ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Canada"
}
}
]
}
}
]
}
,
{
"id": "37",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "In which country is the Hummock Lake?",
"keywords": "country, Hummock Lake"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Hummock_Lake dbo:country ?uri . OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/United_States"
}
}
]
}
}
]
}
,
{
"id": "38",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "In which programming language is 20-sim written?",
"keywords": "programming language, 20-sim, written"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:20-sim dbo:programmingLanguage ?uri . OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/C_(programming_language)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Smalltalk"
}
}
]
}
}
]
}
,
{
"id": "39",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is 10 Cane a beverage?",
"keywords": "10 Cane, beverage"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:10_Cane rdf:type dbo:Beverage . }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "40",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is A A Mamun a model?",
"keywords": "A A Mamun, model"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:A_A_Mamun rdf:type dbo:Model . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "41",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is A A Mamun a scientist?",
"keywords": "A A Mamun, scientist"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:A_A_Mamun rdf:type dbo:Scientist . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "42",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is A G Noorani a democrat?",
"keywords": "A G Noorani, democrat"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:A_G_Noorani dbo:party <http://dbpedia.org/resource/Democratic_Party_(United_States)> . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "43",
"answertype": "boolean",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is A Sudhakar Raju still alive?",
"keywords": "A Sudhakar Raju, alive"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { OPTIONAL { res:A_Sudhakar_Raju dbo:deathDate ?date . } FILTER (!BOUND(?date)) }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "44",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is Aaron Doral married?",
"keywords": "Aaron Doral, married"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Aaron_Doral dbo:spouse ?uri . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "45",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is there a video game called 007 Legends?",
"keywords": "video, game, called, 007 Legends"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK WHERE { ?uri rdf:type dbo:VideoGame . ?uri rdfs:label '007 Legends'@en . }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "46",
"answertype": "resource",
"aggregation": "union",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Show me everyone who was born on Anti-Bullying Day.",
"keywords": "born, Anti-Bullying Day"
}
],
"query":{
"sparql": "PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Person . { ?uri dbo:birthDate ?date . } UNION { ?uri dbp:birthDate ?date . } res:Anti-Bullying_Day dbp:date ?date . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Roland_Pöntinen"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Nick_Turner"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Edward_Steere"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/LaRoyce_Hawkins"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Louise_Fagan"
}
}
]
}
}
]
}
,
{
"id": "47",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Was A G Noorani a chemist?",
"keywords": "A G Noorani, chemist"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> ASK WHERE { res:A_G_Noorani dbo:profession res:Chemist . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
]
}
