{
"dataset": {
"id": "hobbit-1-train-largescale"
},
"questions": [
{
"id": "94",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the owner of 2 Sisters Food Group?",
"keywords": "owner, 2 Sisters Food Group"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:2_Sisters_Food_Group dbo:owner ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Ranjit_Singh_Boparan"
}
}
]
}
}
]
}
,
{
"id": "95",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the tallest player of 07 Vestur?",
"keywords": "tallest, player, 07 Vestur"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:team res:07_Vestur . ?uri dbo:height ?h . } ORDER BY DESC(?h) OFFSET 0 LIMIT 1"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Sonni_Nattestad"
}
}
]
}
}
]
}
,
{
"id": "96",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the youngest Badminton player?",
"keywords": "youngest, Badminton player"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:BadmintonPlayer . ?uri dbo:birthDate ?date . } ORDER BY DESC(?date) OFFSET 0 LIMIT 1"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Gregoria_Mariska_Tunjung"
}
}
]
}
}
]
}
,
{
"id": "97",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who painted 7000 Oaks?",
"keywords": "painted, 7000 Oaks"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:7000_Oaks dbo:author ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Joseph_Beuys"
}
}
]
}
}
]
}
,
{
"id": "98",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who produces 7 Up?",
"keywords": "produces, 7 Up"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri dbo:product res:7_Up . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Dr_Pepper_Snapple_Group"
}
}
]
}
}
]
}
,
{
"id": "99",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who were the parents of Abantidas?",
"keywords": "parents, Abantidas"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Abantidas dbo:parent ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Paseas"
}
}
]
}
}
]
}
,
{
"id": "100",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who wrote the book 100 Best Australian Albums?",
"keywords": "wrote, book, 100 Best Australian Albums"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:100_Best_Australian_Albums dbo:author ?uri . OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/John_O'Donnell_(music_journalist)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Craig_Mathieson"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Toby_Creswell"
}
}
]
}
}
]
}
]
}
