{
"dataset": {
"id": "hobbit-1-train-largescale"
},
"questions": [
{
"id": "48",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Was A Sudhakar Raju born in Sioux City?",
"keywords": "A Sudhakar Raju, born, Sioux City"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:A_Sudhakar_Raju dbo:birthPlace res:Sioux_City . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "49",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Was Monica Chan born in Aachen-Mitte?",
"keywords": "Monica Chan, born, Aachen-Mitte"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE {  res:Monica_Chan dbo:birthPlace res:Aachen-Mitte . } "
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "50",
"answertype": "boolean",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Was the band 1 Giant Leap founded before DJ Tomekk was born?",
"keywords": "band, 1 Giant Leap, founded, DJ Tomekk, born"
}
],
"query":{
"sparql": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX bio: <http://purl.org/vocab/bio/0.1/> PREFIX foaf: <http://xmlns.com/foaf/0.1/> PREFIX mo: <http://purl.org/ontology/mo/> ASK WHERE { ?mb_band foaf:name '1_Giant_Leap' . ?mb_band bio:event ?event . ?event rdf:type bio:Birth . ?event bio:date ?birthdate1 . res:DJ_Tomekk dbo:birthDate ?birthdate2 . FILTER (?birthdate1 <= ?birthdate2) }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "51",
"answertype": "boolean",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Was the band 2 Live Crew founded before 12 Gauge was born?",
"keywords": "band, 2 Live Crew, founded, 12 Gauge, born"
}
],
"query":{
"sparql": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX bio: <http://purl.org/vocab/bio/0.1/> PREFIX foaf: <http://xmlns.com/foaf/0.1/> PREFIX mo: <http://purl.org/ontology/mo/> ASK WHERE { ?mb_band foaf:name '2_Live_Crew' . ?mb_band bio:event ?event . ?event rdf:type bio:Birth . ?event bio:date ?birthdate1 . res:12_Gauge dbo:birthDate ?birthdate2 . FILTER (?birthdate1 <= ?birthdate2) }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "52",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What are the official languages of Abkhazia?",
"keywords": "official, languages, Abkhazia"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Abkhazia dbo:officialLanguage ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Russian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Abkhaz_language"
}
}
]
}
}
]
}
,
{
"id": "53",
"answertype": "string",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the area code of AB postcode area?",
"keywords": "area code, AB postcode area"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?string WHERE { res:AB_postcode_area dbo:areaCode ?string . }"
},
"answers": [
{
"head": {
"vars": [
"string"
]
},
"results": {
"bindings": [
{
"string": {
"type": "literal",
"value": "AB"
}
}
]
}
}
]
}
,
{
"id": "54",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the capital of Abbasid Caliphate?",
"keywords": "capital, Abbasid Caliphate"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Abbasid_Caliphate dbo:capital ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Abbasid_Samarra"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al-Raqqah"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Baghdad"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Cairo"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Kufa"
}
}
]
}
}
]
}
,
{
"id": "55",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the currency of Abbasid Caliphate?",
"keywords": "currency, Abbasid Caliphate"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Abbasid_Caliphate dbo:currency ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Gold_dinar"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Fals"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Dirham"
}
}
]
}
}
]
}
,
{
"id": "56",
"answertype": "string",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the eye color of Abbey Clancy?",
"keywords": "eye color, Abbey Clancy"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?color WHERE { res:Abbey_Clancy dbo:eyeColor ?color . }"
},
"answers": [
{
"head": {
"vars": [
"color"
]
},
"results": {
"bindings": [
{
"color": {
"type": "literal",
"value": "Green"
}
}
]
}
}
]
}
,
{
"id": "57",
"answertype": "string",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the hair color of Abbey Clancy?",
"keywords": "hair color, Abbey Clancy"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?color WHERE { res:Abbey_Clancy dbo:hairColor ?color . }"
},
"answers": [
{
"head": {
"vars": [
"color"
]
},
"results": {
"bindings": [
{
"color": {
"type": "literal",
"value": "Blonde"
}
}
]
}
}
]
}
,
{
"id": "58",
"answertype": "string",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the official color of the Aalim Muhammed Salegh College of Engineering?",
"keywords": "official color, Aalim Muhammed Salegh College, Engineering"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?string WHERE { res:Aalim_Muhammed_Salegh_College_of_Engineering dbo:officialSchoolColour ?string . }"
},
"answers": [
{
"head": {
"vars": [
"string"
]
},
"results": {
"bindings": [
{
"string": {
"type": "literal",
"value": "green"
}
}
]
}
}
]
}
,
{
"id": "59",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the ruling party in Alicante?",
"keywords": "ruling party, Alicante"
}
],
"query":{
"sparql": "PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Alicante dbp:leaderParty ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Spanish_Socialist_Workers'_Party"
}
}
]
}
}
]
}
,
{
"id": "60",
"answertype": "date",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When did A R Mallick die?",
"keywords": "A R Mallick, die"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:A_R_Mallick dbo:deathDate ?date . }"
},
"answers": [
{
"head": {
"vars": [
"date"
]
},
"results": {
"bindings": [
{
"date": {
"type": "literal",
"value": "1997-02-04"
}
}
]
}
}
]
}
,
{
"id": "61",
"answertype": "date",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When did Air Wave's creator die?",
"keywords": "Air Wave, creator die"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:Air_Wave dbo:creator ?x . ?x dbo:deathDate ?date . }"
},
"answers": [
{
"head": {
"vars": [
"date"
]
},
"results": {
"bindings": [
{
"date": {
"type": "literal",
"value": "1984-08-18"
}
}
]
}
}
]
}
,
{
"id": "62",
"answertype": "date",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When is Anti-Bullying Day?",
"keywords": "Anti-Bullying Day"
}
],
"query":{
"sparql": "PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:Anti-Bullying_Day dbp:date ?date . }"
},
"answers": [
{
"head": {
"vars": [
"date"
]
},
"results": {
"bindings": [
{
"date": {
"type": "literal",
"value": "--05-04"
}
}
]
}
}
]
}
,
{
"id": "63",
"answertype": "date",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When was 123Net founded?",
"keywords": "123Net, founded"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:123Net dbo:foundingDate ?date . }"
},
"answers": [
{
"head": {
"vars": [
"date"
]
},
"results": {
"bindings": [
{
"date": {
"type": "literal",
"value": "1995-03-05"
}
}
]
}
}
]
}
,
{
"id": "64",
"answertype": "date",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When was A Latangadasu born?",
"keywords": "A Latangadasu, born"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:A_Latangadasu dbo:birthDate ?date . }"
},
"answers": [
{
"head": {
"vars": [
"date"
]
},
"results": {
"bindings": [
{
"date": {
"type": "literal",
"value": "1984-01-27"
}
}
]
}
}
]
}
,
{
"id": "65",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When was the 1 Hanover Square built?",
"keywords": "1 Hanover Square, built"
}
],
"query":{
"sparql": "PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:1_Hanover_Square dbp:built ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "1851"
}
}
]
}
}
]
}
,
{
"id": "66",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When was the 11 East Forsyth built?",
"keywords": "11 East Forsyth, built"
}
],
"query":{
"sparql": "PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:11_East_Forsyth dbp:built ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "1926"
}
}
]
}
}
]
}
,
{
"id": "67",
"answertype": "date",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When was the 14 July Revolution?",
"keywords": "14 July Revolution"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:14_July_Revolution dbo:date ?date . }"
},
"answers": [
{
"head": {
"vars": [
"date"
]
},
"results": {
"bindings": [
{
"date": {
"type": "literal",
"value": "1958-07-14"
}
}
]
}
}
]
}
,
{
"id": "68",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Where did Abantidas die?",
"keywords": "Abantidas, die"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Abantidas dbo:deathPlace ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Sicyon"
}
}
]
}
}
]
}
,
{
"id": "69",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Where is the Adamasta Rock located?",
"keywords": "Adamasta Rock, located"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Adamasta_Rock dbo:location ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Hong_Kong"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Islands_District"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Cheung_Chau"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Lantau_Island"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Adamasta_Channel"
}
}
]
}
}
]
}
,
{
"id": "70",
"answertype": "resource",
"aggregation": "union",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which airports are located in Aboriginal Shire of Kowanyama?",
"keywords": "airports, located, Aboriginal Shire of Kowanyama"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Airport . { ?uri dbo:location res:Aboriginal_Shire_of_Kowanyama . } UNION { ?uri dbp:location res:Aboriginal_Shire_of_Kowanyama . } UNION { ?uri dbo:city res:Aboriginal_Shire_of_Kowanyama . } UNION { ?uri dbo:city ?city . ?city dbo:isPartOf res:Aboriginal_Shire_of_Kowanyama . } UNION { ?uri dbo:operator res:Aboriginal_Shire_of_Kowanyama . } UNION { ?uri dbp:cityServed res:Aboriginal_Shire_of_Kowanyama . } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Kowanyama_Airport"
}
}
]
}
}
]
}
,
{
"id": "71",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which artist made the album A Bad Wind Blows in My Heart?",
"keywords": "artist, made, album, A Bad Wind Blows in My Heart"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/A_Bad_Wind_Blows_in_My_Heart> dbo:artist ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Bill_Ryder-Jones"
}
}
]
}
}
]
}
,
{
"id": "72",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which books were published by Abbeville Publishing Group?",
"keywords": "books, published, Abbeville Publishing Group"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri rdf:type dbo:Book . ?uri dbo:publisher res:Abbeville_Publishing_Group . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Unbuilt_America"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Disney_Animation:_The_Illusion_of_Life"
}
}
]
}
}
]
}
,
{
"id": "73",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which bridges cross the Adige?",
"keywords": "bridges, cross, Adige"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Bridge . ?uri dbo:crosses res:Adige . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Ponte_Pietra_(Verona)"
}
}
]
}
}
]
}
,
{
"id": "74",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which instruments does 3LAU play?",
"keywords": "instruments, 3LAU, play"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:3LAU dbo:instrument ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Guitar"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Piano"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/DJ_mixer"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Synthesizer"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Singing"
}
}
]
}
}
]
}
,
{
"id": "75",
"answertype": "resource",
"aggregation": "union",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which languages are spoken in Abkhazia?",
"keywords": "languages, spoken, Abkhazia"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { { res:Abkhazia dbo:language ?uri . } UNION { ?uri dbo:spokenIn res:Abkhazia . } OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Russian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Georgian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Svan_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Armenian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Abkhaz_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Mingrelian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Bzyb_dialect"
}
}
]
}
}
]
}
,
{
"id": "76",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which museum exhibits 26 October 1993?",
"keywords": "museum, exhibits, 26 October 1993"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:26_October_1993 dbo:museum ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Tate_Modern"
}
}
]
}
}
]
}
,
{
"id": "77",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which music albums contain the song 1 Thing?",
"keywords": "music albums, contain, song, 1 Thing"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { ?single dbo:album ?uri . ?single rdfs:label '1 Thing'@en . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Touch_(Amerie_album)"
}
}
]
}
}
]
}
,
{
"id": "78",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which organizations were founded in 1098?",
"keywords": "organizations, founded, 1098"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri rdf:type dbo:Organisation . { ?uri dbp:foundation ?date . } UNION { ?uri dbo:formationYear ?date . } FILTER regex(?date,'^1098') . OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Order_of_Saint_Lazarus"
}
}
]
}
}
]
}
,
{
"id": "79",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which presidents were born in 1519?",
"keywords": "presidents, born, 1519"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:President . ?uri dbo:birthDate ?date . FILTER regex(?date, '^1519') . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Gómez_Pérez_Dasmariñas"
}
}
]
}
}
]
}
,
{
"id": "80",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which professional surfers were born in Philippines?",
"keywords": "professional surfers, born, Philippines"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri dbo:occupation res:Surfing . ?uri dbo:birthPlace res:Philippines . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Marcus_Adoro"
}
}
]
}
}
]
}
,
{
"id": "81",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who created 1000 Awesome Things?",
"keywords": "created, 1000 Awesome Things"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:1000_Awesome_Things dbo:author ?uri . OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Neil_Pasricha"
}
}
]
}
}
]
}
,
{
"id": "82",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who created Aaron Hotchner?",
"keywords": "created, Aaron Hotchner"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Aaron_Hotchner dbo:creator ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Jeff_Davis_(writer)"
}
}
]
}
}
]
}
,
{
"id": "83",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who created the comic 100 Bullets?",
"keywords": "created, comic, 100 Bullets"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri ?string WHERE { res:100_Bullets dbo:writer ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Brian_Azzarello"
}
}
]
}
}
]
}
,
{
"id": "85",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who developed 1legcall?",
"keywords": "developed, 1legcall"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:1legcall dbo:developer ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/TalkFree,_Inc"
}
}
]
}
}
]
}
,
{
"id": "86",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who developed the video game 007 Legends?",
"keywords": "developed, video game, 007 Legends"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:007_Legends dbo:developer ?uri . OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Eurocom"
}
}
]
}
}
]
}
,
{
"id": "87",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who founded 13 Flames Empire?",
"keywords": "founded, 13 Flames Empire"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:13_Flames_Empire dbo:foundedBy ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Robin_Thompson_(artist)"
}
}
]
}
}
]
}
,
{
"id": "88",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the editor of 100Most?",
"keywords": "editor, 100Most"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { res:100Most dbo:editor ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Seven_Chan"
}
}
]
}
}
]
}
,
{
"id": "89",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the founder of Abaris Books?",
"keywords": "founder, Abaris Books"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Abaris_Books dbo:founder ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Walter_L._Strauss"
}
}
]
}
}
]
}
,
{
"id": "90",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the heaviest player of the 08 Stockholm Human Rights?",
"keywords": "heaviest, player, 08 Stockholm Human Rights"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Person . ?uri dbo:weight ?num . { ?uri dbp:team res:08_Stockholm_Human_Rights . } UNION { ?uri dbp:draftTeam res:08_Stockholm_Human_Rights . } UNION { ?uri dbo:draftTeam res:08_Stockholm_Human_Rights . } } ORDER BY DESC(?num) OFFSET 0 LIMIT 1"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Martin_Müürsepp"
}
}
]
}
}
]
}
,
{
"id": "91",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "true",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the manager of 07 Vestur?",
"keywords": "manager, 07 Vestur"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/07_Vestur> dbo:manager ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Jógvan_Hendrik_Samuelsen"
}
}
]
}
}
]
}
,
{
"id": "92",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the mayor of Abidjan?",
"keywords": "mayor, Abidjan"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri ?string WHERE { res:Abidjan dbo:leaderName ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Beugré_Robert_Mambe"
}
}
]
}
}
]
}
,
{
"id": "93",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the mayor of the capital of Belgium?",
"keywords": "mayor, capital, Belgium"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Belgium dbo:capital ?x . ?x dbo:mayor ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Yvan_Mayeur"
}
}
]
}
}
]
}
]
}
