<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<dataset id="qald-7-train-multilingual">
<question aggregation="false" answertype="resource" hybrid="false" id="195" onlydbo="true">
<string lang="en">Show me all books in Asimov's Foundation series.</string>
<string lang="fa">مجموعه کتاب های آسیموف چند کتاب دارد؟</string>
<string lang="de">Zeig mir alle Bücher in Asimovs Foundation-Serie.</string>
<string lang="es">Muéstrame todos los libros en la serie Fundación de Asimov</string>
<string lang="it">Mostrami tutti i libri del Ciclo della Fondazione di Asimov</string>
<string lang="fr">Montres-moi tous les livres du Cycle de Fondation d'Asimov.</string>
<string lang="nl">Toon alle boeken die bij de Foundation-serie horen.</string>
<string lang="ro">Arată-mi toate cărțile din seria Fundația de Asimov</string>
<keywords lang="en">books, Asimov, Foundation series</keywords>
<keywords lang="fa">مجموعه کتاب های، آسیموف، کتاب</keywords>
<keywords lang="de">Asimov, Foundation-Serie, Bücher</keywords>
<keywords lang="es">libros, serie Fundación Asimov</keywords>
<keywords lang="it">libri, Ciclo della Fondazione, Asimov</keywords>
<keywords lang="fr">livres, Cycle de Fondation, Asimov</keywords>
<keywords lang="nl">boeken, Foundation-serie</keywords>
<keywords lang="ro">cărți, seria Fundația, Asimov</keywords>
<query>SELECT DISTINCT ?uri WHERE { ?uri &lt;http://dbpedia.org/ontology/series&gt; &lt;http://dbpedia.org/resource/Foundation_series&gt; . } </query>
<answers>
<answer>http://dbpedia.org/resource/Foundation's_Edge</answer>
<answer>http://dbpedia.org/resource/Second_Foundation</answer>
<answer>http://dbpedia.org/resource/Foundation_(Isaac_Asimov_novel)</answer>
<answer>http://dbpedia.org/resource/Foundation_and_Chaos</answer>
<answer>http://dbpedia.org/resource/Foundation's_Triumph</answer>
<answer>http://dbpedia.org/resource/The_Originist</answer>
<answer>http://dbpedia.org/resource/Prelude_to_Foundation</answer>
<answer>http://dbpedia.org/resource/Foundation's_Fear</answer>
<answer>http://dbpedia.org/resource/Foundation_and_Earth</answer>
<answer>http://dbpedia.org/resource/Forward_the_Foundation</answer>
<answer>http://dbpedia.org/resource/Foundation_and_Empire</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" hybrid="false" id="196" onlydbo="false">
<string lang="en">Give me all cities in New Jersey with more than 100000 inhabitants.</string>
<string lang="de">Gib mir alle Städte in New Jersey, die mehr als 100000 Einwohner haben.</string>
<string lang="es">Dame todas las cuidades en New Jersey que tengan más de 100000 habitantes.</string>
<string lang="it">Dammi tutte le città del New Jersey con più di 100000 abitanti.</string>
<string lang="fr">Donnes-moi toutes les villes du New Jersey avec plus de 100000 habitants.</string>
<string lang="nl">Geef alle steden in New Jersey met meer dan 100000 inwoners.</string>
<keywords lang="en">New Jersey, city, inhabitants, more than 100000</keywords>
<keywords lang="de">New Jersey, Stadt, Einwohner, mehr als 100000</keywords>
<keywords lang="es">New Jersey, ciudad, habitantes, más de 100000</keywords>
<keywords lang="it">New Jersey, città, abitanti, più di 100000</keywords>
<keywords lang="fr">New Jersey, villes, habitants, plus de 100000</keywords>
<keywords lang="nl">New Jersey, stad, inwoners, meer dan 100000</keywords>
<query>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX dbp: &lt;http://dbpedia.org/property/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type dbo:City .
        ?uri dbo:isPartOf res:New_Jersey .
        ?uri dbp:populationTotal ?inhabitants .
        FILTER (?inhabitants &gt; 100000) .
}</query>
<answers>
<answer>http://dbpedia.org/resource/Newark,_New_Jersey</answer>
<answer>http://dbpedia.org/resource/Jersey_City,_New_Jersey</answer>
<answer>http://dbpedia.org/resource/Elizabeth,_New_Jersey</answer>
<answer>http://dbpedia.org/resource/Paterson,_New_Jersey</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="204" onlydbo="true">
<string lang="en">Give me all members of Prodigy.</string>
<string lang="fa">تمام اعضای پرادیجی را لیست کن.</string>
<string lang="de">Gib mir alle Bandmitglieder von Prodigy.</string>
<string lang="es">Dame todos los miembros de la banda Prodigy.</string>
<string lang="it">Dammi tutti i membri dei Prodigy.</string>
<string lang="fr">Donne-moi tous les membres de Prodigy.</string>
<string lang="nl">Noem alle leden van Prodigy.</string>
<string lang="ro">Dă-mi toții membrii Prodigy.</string>
<keywords lang="en">member, Prodigy</keywords>
<keywords lang="fa">اعضا، پرادیجی</keywords>
<keywords lang="de">Bandmitglied, Prodigy</keywords>
<keywords lang="es">miembros de la banda Prodigy</keywords>
<keywords lang="it">membri, Prodigy</keywords>
<keywords lang="fr">members, Prodigy</keywords>
<keywords lang="nl">leden, Prodigy</keywords>
<keywords lang="ro">membru, Prodigy</keywords>
<query>SELECT DISTINCT ?uri WHERE {  &lt;http://dbpedia.org/resource/The_Prodigy&gt; &lt;http://dbpedia.org/ontology/bandMember&gt; ?uri . } </query>
<answers>
<answer>http://dbpedia.org/resource/Maxim_(musician)</answer>
<answer>http://dbpedia.org/resource/Liam_Howlett</answer>
<answer>http://dbpedia.org/resource/Keith_Flint</answer>
</answers>
</question>
