{
  "dataset" : {
    "id" : "qald-7-train-multilingual"
  },
  "questions" : [ {
    "question" : {
      "id" : "1",
      "answertype" : "resource",
      "language" : [ {
        "language" : "en",
        "question" : "List all the musicals with music by Elton John.",
        "keywords" : "musicals,music by,Elton John",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \nSELECT DISTINCT ?uri\nWHERE { \n        ?uri rdf:type dbo:Musical .\n        ?uri dbo:musicBy res:Elton_John .\n}"
      }, {
        "language" : "de",
        "question" : "Liste alle Musicals mit Musik von Elton John auf.",
        "keywords" : "Musicals,Musik von,Elton John",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \nSELECT DISTINCT ?uri\nWHERE { \n        ?uri rdf:type dbo:Musical .\n        ?uri dbo:musicBy res:Elton_John .\n}"
      }, {
        "language" : "es",
        "question" : "Dame todos los musicales con música de Elton John.",
        "keywords" : "musicales,música,Elton John",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \nSELECT DISTINCT ?uri\nWHERE { \n        ?uri rdf:type dbo:Musical .\n        ?uri dbo:musicBy res:Elton_John .\n}"
      }, {
        "language" : "it",
        "question" : "Elenca tutti i musicals con musiche di Elton John.",
        "keywords" : "musicals,musiche,Elton John",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \nSELECT DISTINCT ?uri\nWHERE { \n        ?uri rdf:type dbo:Musical .\n        ?uri dbo:musicBy res:Elton_John .\n}"
      }, {
        "language" : "fr",
        "question" : "Donne-moi tous les musicals avec de la musique de de Elton John.",
        "keywords" : "musicals,musique,Elton John",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \nSELECT DISTINCT ?uri\nWHERE { \n        ?uri rdf:type dbo:Musical .\n        ?uri dbo:musicBy res:Elton_John .\n}"
      }, {
        "language" : "nl",
        "question" : "Toen een lijst van alle musicals met muziek van Elton John.",
        "keywords" : "musicals,muziek van,Elton John",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \nSELECT DISTINCT ?uri\nWHERE { \n        ?uri rdf:type dbo:Musical .\n        ?uri dbo:musicBy res:Elton_John .\n}"
      }, {
        "language" : "ro",
        "question" : "Listează toate muzicalurile cu muzică de Elton John.",
        "keywords" : "muzicaluri,muzică de Elton John",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \nSELECT DISTINCT ?uri\nWHERE { \n        ?uri rdf:type dbo:Musical .\n        ?uri dbo:musicBy res:Elton_John .\n}"
      } ],
      "answers" : {
        "head" : {
          "vars" : [ "uri" ]
        },
        "results" : {
          "bindings" : [ {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/The_Lion_King_(musical)"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Lestat_(musical)"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Billy_Elliot_the_Musical"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Aida_(musical)"
            }
          } ]
        }
      },
      "metadata" : {
        "aggregation" : false,
        "onlydbo" : true,
        "hybrid" : false
      }
    }
  }, {
    "question" : {
      "id" : "97",
      "answertype" : "resource",
      "language" : [ {
        "language" : "en",
        "question" : "List the children of Margaret Thatcher.",
        "keywords" : "Margaret Thatcher,child",
        "SPARQL" : "PREFIX res: <http://dbpedia.org/resource/>\nPREFIX dbo: <http://dbpedia.org/ontology/>\nSELECT DISTINCT ?uri \nWHERE {\n\tres:Margaret_Thatcher dbo:child ?uri .\n}"
      }, {
        "language" : "de",
        "question" : "Liste die Kinder von Margaret Thatcher auf.",
        "keywords" : "Margaret Thatcher,Kind",
        "SPARQL" : "PREFIX res: <http://dbpedia.org/resource/>\nPREFIX dbo: <http://dbpedia.org/ontology/>\nSELECT DISTINCT ?uri \nWHERE {\n\tres:Margaret_Thatcher dbo:child ?uri .\n}"
      }, {
        "language" : "es",
        "question" : "Dame una lista de los hijos de Margaret Thatcher.",
        "keywords" : "Margaret Thatcher,hijos",
        "SPARQL" : "PREFIX res: <http://dbpedia.org/resource/>\nPREFIX dbo: <http://dbpedia.org/ontology/>\nSELECT DISTINCT ?uri \nWHERE {\n\tres:Margaret_Thatcher dbo:child ?uri .\n}"
      }, {
        "language" : "it",
        "question" : "Elenca i figli di Margaret Thatcher.",
        "keywords" : "Margaret Thatcher,figlio",
        "SPARQL" : "PREFIX res: <http://dbpedia.org/resource/>\nPREFIX dbo: <http://dbpedia.org/ontology/>\nSELECT DISTINCT ?uri \nWHERE {\n\tres:Margaret_Thatcher dbo:child ?uri .\n}"
      }, {
        "language" : "fr",
        "question" : "Donnes-moi tous les enfants de Margaret Thatcher.",
        "keywords" : "enfants,Margaret Thatcher",
        "SPARQL" : "PREFIX res: <http://dbpedia.org/resource/>\nPREFIX dbo: <http://dbpedia.org/ontology/>\nSELECT DISTINCT ?uri \nWHERE {\n\tres:Margaret_Thatcher dbo:child ?uri .\n}"
      }, {
        "language" : "nl",
        "question" : "Noem alle kinderen van Margaret Thatcher.",
        "keywords" : "kinderen,Margaret Thatcher",
        "SPARQL" : "PREFIX res: <http://dbpedia.org/resource/>\nPREFIX dbo: <http://dbpedia.org/ontology/>\nSELECT DISTINCT ?uri \nWHERE {\n\tres:Margaret_Thatcher dbo:child ?uri .\n}"
      } ],
      "answers" : {
        "head" : {
          "vars" : [ "uri" ]
        },
        "results" : {
          "bindings" : [ {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Carol_Thatcher"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Mark_Thatcher"
            }
          } ]
        }
      },
      "metadata" : {
        "aggregation" : false,
        "onlydbo" : true,
        "hybrid" : false
      }
    }
  }, {
    "question" : {
      "id" : "102",
      "answertype" : "resource",
      "language" : [ {
        "language" : "en",
        "question" : "List all games by GMT.",
        "keywords" : "game,GMT",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri \nWHERE {\t\n        ?uri dbo:publisher res:GMT_Games .\n}"
      }, {
        "language" : "de",
        "question" : "Liste alle Spiele von GMT auf.",
        "keywords" : "Spiel,GMT",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri \nWHERE {\t\n        ?uri dbo:publisher res:GMT_Games .\n}"
      }, {
        "language" : "es",
        "question" : "Dame todos los juegos de GMT.",
        "keywords" : "juegos,GMT",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri \nWHERE {\t\n        ?uri dbo:publisher res:GMT_Games .\n}"
      }, {
        "language" : "it",
        "question" : "Elenca tutti i giochi di GMT.",
        "keywords" : "gioco,GMT",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri \nWHERE {\t\n        ?uri dbo:publisher res:GMT_Games .\n}"
      }, {
        "language" : "fr",
        "question" : "Donne-moi tous les jeux de GMT.",
        "keywords" : "jeux,GMT",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri \nWHERE {\t\n        ?uri dbo:publisher res:GMT_Games .\n}"
      }, {
        "language" : "nl",
        "question" : "Noem alle spelen van GMT.",
        "keywords" : "spel,GMT",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri \nWHERE {\t\n        ?uri dbo:publisher res:GMT_Games .\n}"
      } ],
      "answers" : {
        "head" : {
          "vars" : [ "uri" ]
        },
        "results" : {
          "bindings" : [ {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Washington's_War"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Fields_of_Fire_(game)"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Commands_&_Colors:_Ancients"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Twilight_Struggle"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Sword_of_Rome"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Paths_of_Glory_(board_game)"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Chandragupta_(board_game)"
            }
          } ]
        }
      },
      "metadata" : {
        "aggregation" : false,
        "onlydbo" : true,
        "hybrid" : false
      }
    }
  }, {
    "question" : {
      "id" : "146",
      "answertype" : "resource",
      "language" : [ {
        "language" : "en",
        "question" : "Give me all actors starring in Last Action Hero.",
        "keywords" : "actor,starring,Last Action Hero",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri\nWHERE {\n        res:Last_Action_Hero dbo:starring ?uri . \n}"
      }, {
        "language" : "de",
        "question" : "Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.",
        "keywords" : "Schauspieler,mitspielen,Last Action Hero",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri\nWHERE {\n        res:Last_Action_Hero dbo:starring ?uri . \n}"
      }, {
        "language" : "es",
        "question" : "Dame todos los actores que hayan actuado en Last Action Hero.",
        "keywords" : "actores,Last Action Hero",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri\nWHERE {\n        res:Last_Action_Hero dbo:starring ?uri . \n}"
      }, {
        "language" : "it",
        "question" : "Dammi tutti gli attori che hanno recitato in Last Action Hero.",
        "keywords" : "attori,Last Action Hero",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri\nWHERE {\n        res:Last_Action_Hero dbo:starring ?uri . \n}"
      }, {
        "language" : "fr",
        "question" : "Noem alle acteurs uit de film Last Action Hero.",
        "keywords" : "acteurs,Last Action Hero",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri\nWHERE {\n        res:Last_Action_Hero dbo:starring ?uri . \n}"
      }, {
        "language" : "nl",
        "question" : "Noem alle acteurs uit de film Last Action Hero.",
        "keywords" : "acteur,Last Action Hero",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri\nWHERE {\n        res:Last_Action_Hero dbo:starring ?uri . \n}"
      }, {
        "language" : "ro",
        "question" : "Dă-mi toți actorii cu roluri principale în Last Action Hero.",
        "keywords" : "actor,rol principal,Last Action Hero",
        "SPARQL" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri\nWHERE {\n        res:Last_Action_Hero dbo:starring ?uri . \n}"
      } ],
      "answers" : {
        "head" : {
          "vars" : [ "uri" ]
        },
        "results" : {
          "bindings" : [ {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Tom_Noonan"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/F._Murray_Abraham"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Arnold_Schwarzenegger"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Bridgette_Wilson"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Charles_Dance"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Art_Carney"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Austin_O'Brien"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Robert_Prosky"
            }
          }, {
            "uri" : {
              "type" : "uri",
              "value" : "http://dbpedia.org/resource/Anthony_Quinn"
            }
          } ]
        }
      },
      "metadata" : {
        "aggregation" : false,
        "onlydbo" : true,
        "hybrid" : false
      }
    }
  } ]
}
