{
"dataset": {
"id": "hobbit-2-train-largescale"
},
"questions": [
{
"id": "43",
"answertype": "boolean",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is David Macaulay still alive?",
"keywords": "David Macaulay, alive"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { OPTIONAL { res:David_Macaulay dbo:deathDate ?date . } FILTER (!BOUND(?date)) }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "44",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is Wilma Flintstone married?",
"keywords": "Wilma Flintstone, married"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Wilma_Flintstone dbo:spouse ?uri . }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "45",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is there a video game called Flappy Bird?",
"keywords": "video, game, called, Flappy Bird"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK WHERE { ?uri rdf:type dbo:VideoGame . ?uri rdfs:label 'Flappy Bird'@en . }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "46",
"answertype": "resource",
"aggregation": "union",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Show me everyone who was born on Boxing Day.",
"keywords": "born, Boxing_Day"
}
],
"query":{
"sparql": "PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Person . { ?uri dbo:birthDate ?date . } UNION { ?uri dbp:birthDate ?date . } res:Boxing_Day dbp:date ?date . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Michael_Ponikvar"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Shivam_Patil"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Hiro-x"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Jan_Halvarsson"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Lizz_Njagah"
}
}
]
}
}
]
}
,
{
"id": "47",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Was Peter Isola a chemist?",
"keywords": "Peter Isola, chemist"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> ASK WHERE { res:Peter_Isola dbo:profession res:Chemist . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "48",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Was Denis Dutton born in Sioux City?",
"keywords": "Denis Dutton, born, Sioux City"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Denis_Dutton dbo:birthPlace res:Sioux_City . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "49",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Was Vannes Wu born in Aachen-Mitte?",
"keywords": "Vanness Wu, born, Aachen-Mitte"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Vanness_Wu dbo:birthPlace res:Aachen-Mitte . } "
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "50",
"answertype": "boolean",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Was the band Led Zeppelin founded before DJ Tomekk was born?",
"keywords": "band, Led Zeppelin, founded, DJ Tomekk, born"
}
],
"query":{
"sparql": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX bio: <http://purl.org/vocab/bio/0.1/> PREFIX foaf: <http://xmlns.com/foaf/0.1/> PREFIX mo: <http://purl.org/ontology/mo/> ASK WHERE { { ?band foaf:name ?name . FILTER regex(?name,'Led Zeppelin') } ?band dbo:activeYearsStartYear ?date1 . res:DJ_Tomekk dbo:birthDate ?date2 . FILTER (?date1 <= ?date2) }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "51",
"answertype": "boolean",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Was the band ZZ Top founded before Macklemore was born?",
"keywords": "band, ZZ Top, founded, Macklemore, born"
}
],
"query":{
"sparql": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX bio: <http://purl.org/vocab/bio/0.1/> PREFIX foaf: <http://xmlns.com/foaf/0.1/> PREFIX mo: <http://purl.org/ontology/mo/> ASK WHERE { { ?band foaf:name ?name . FILTER regex(?name,'ZZ Top') } ?band dbo:activeYearsStartYear ?date1 . res:DJ_Tomekk dbo:birthDate ?date2 . FILTER (?date1 <= ?date2) }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "52",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What are the official languages of Tunisia?",
"keywords": "official, languages, Tunisia"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Tunisia dbo:officialLanguage ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Arabic"
}
}
]
}
}
]
}
,
{
"id": "53",
"answertype": "string",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the area code of Aegina?",
"keywords": "area code, Aegina"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?string WHERE { res:Aegina dbo:areaCode ?string . }"
},
"answers": [
{
"head": {
"vars": [
"string"
]
},
"results": {
"bindings": [
{
"string": {
"type": "literal",
"value": "2297"
}
}
]
}
}
]
}
,
{
"id": "55",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the currency of Rhodesia?",
"keywords": "currency, Rhodesia"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Rhodesia dbo:currency ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Rhodesian_dollar"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Rhodesian_pound"
}
}
]
}
}
]
}
,
{
"id": "56",
"answertype": "string",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the eye color of Liza Kennedy?",
"keywords": "eye color, Liza Kennedy"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?color WHERE { res:Liza_Kennedy dbo:eyeColor ?color . }"
},
"answers": [
{
"head": {
"vars": [
"color"
]
},
"results": {
"bindings": [
{
"color": {
"type": "literal",
"value": "Dark brown"
}
}
]
}
}
]
}
,
{
"id": "57",
"answertype": "string",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the hair color of Marlon Teixeira?",
"keywords": "hair color, Marlon Teixeira"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?color WHERE { res:Marlon_Teixeira dbo:hairColor ?color . }"
},
"answers": [
{
"head": {
"vars": [
"color"
]
},
"results": {
"bindings": [
{
"color": {
"type": "literal",
"value": "Brown"
}
}
]
}
}
]
}
,
{
"id": "58",
"answertype": "string",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the official color of the Carleton University?",
"keywords": "official color, Carleton University"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?string WHERE { res:Carleton_University dbo:officialSchoolColour ?string . }"
},
"answers": [
{
"head": {
"vars": [
"string"
]
},
"results": {
"bindings": [
{
"string": {
"type": "literal",
"value": "Black and red"
}
}
]
}
}
]
}
,
{
"id": "59",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "What is the ruling party in Lo Espejo?",
"keywords": "ruling party, Lo Espejo"
}
],
"query":{
"sparql": "PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Lo_Espejo dbp:leaderParty ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Party_for_Democracy_(Chile)"
}
}
]
}
}
]
}
,
{
"id": "60",
"answertype": "date",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When did Jules Bergman die?",
"keywords": "Jules Bergman, die"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:Jules_Bergman dbo:deathDate ?date . }"
},
"answers": [
{
"head": {
"vars": [
"date"
]
},
"results": {
"bindings": [
{
"date": {
"type": "literal",
"value": "1987-02-11"
}
}
]
}
}
]
}
,
{
"id": "61",
"answertype": "date",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When did Red Sonja's creator die?",
"keywords": "Red Sonja, creator die"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:Red_Sonja dbo:creator ?x . ?x dbo:deathDate ?date . }"
},
"answers": [
{
"head": {
"vars": [
"date"
]
},
"results": {
"bindings": [
{
"date": {
"type": "literal",
"value": "1936-06-11"
}
}
]
}
}
]
}
,
{
"id": "62",
"answertype": "date",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When is Gibraltar Diamond Jubilee Flotilla?",
"keywords": "Gibraltar Diamon Jubilee Flotilla"
}
],
"query":{
"sparql": "PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:Gibraltar_Diamond_Jubilee_Flotilla dbp:date ?date . }"
},
"answers": [
{
"head": {
"vars": [
"date"
]
},
"results": {
"bindings": [
{
"date": {
"type": "literal",
"value": "2012-06-04"
}
}
]
}
}
]
}
,
{
"id": "63",
"answertype": "date",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When was Sevcon founded?",
"keywords": "Sevcon, founded"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:Sevcon dbo:foundingDate ?date . }"
},
"answers": [
{
"head": {
"vars": [
"date"
]
},
"results": {
"bindings": [
{
"date": {
"type": "literal",
"value": "1961-04-04"
}
}
]
}
}
]
}
,
{
"id": "64",
"answertype": "date",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When was Albert Schweitzer born?",
"keywords": "Albert Schweitzer, born"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:Albert_Schweitzer dbo:birthDate ?date . }"
},
"answers": [
{
"head": {
"vars": [
"date"
]
},
"results": {
"bindings": [
{
"date": {
"type": "literal",
"value": "1875-01-14"
}
}
]
}
}
]
}
,
{
"id": "65",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When was the Cobble Hill Tunnel built?",
"keywords": "Cobble Hill Tunnel, built"
}
],
"query":{
"sparql": "PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:Cobble_Hill_Tunnel dbp:built ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "1844"
}
}
]
}
}
]
}
,
{
"id": "66",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When was the Riverdale Monument built?",
"keywords": "Riverdale Monument, built"
}
],
"query":{
"sparql": "PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:Riverdale_Monument dbp:built ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "1930-09-17"
}
}
]
}
}
]
}
,
{
"id": "67",
"answertype": "date",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "When was the Operation Purple Haze?",
"keywords": "Operation Purple Haze"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:Operation_Purple_Haze dbo:date ?date . }"
},
"answers": [
{
"head": {
"vars": [
"date"
]
},
"results": {
"bindings": [
{
"date": {
"type": "literal",
"value": "2007-07-15"
}
}
]
}
}
]
}
,
{
"id": "68",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Where did Queen Emma of Hawaii  die?",
"keywords": "Queen Emma of Hawaii , die"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Queen_Emma_of_Hawaii  dbo:deathPlace ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Oahu"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Honolulu"
}
}
]
}
}
]
}
,
{
"id": "69",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Where is the Sandhammaren located?",
"keywords": "Sandhammaren, located"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Sandhammaren dbo:location ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Sweden"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Ystad"
}
}
]
}
}
]
}
,
{
"id": "70",
"answertype": "resource",
"aggregation": "union",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which airports are located in Chios?",
"keywords": "airports, located, Chios"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Airport . { ?uri dbo:location res:Chios . } UNION { ?uri dbp:location res:Chios . } UNION { ?uri dbo:city res:Chios . } UNION { ?uri dbo:city ?city . ?city dbo:isPartOf res:Chios . } UNION { ?uri dbo:operator res:Chios . } UNION { ?uri dbp:cityServed res:Chios . } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Chios_Island_National_Airport"
}
}
]
}
}
]
}
,
{
"id": "71",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which artist made the album Old School Prankstas?",
"keywords": "artist, made, album, Old School Prankstas"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Old_School_Prankstas> dbo:artist ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/3_the_Hard_Way"
}
}
]
}
}
]
}
,
{
"id": "73",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which bridges cross the Prut?",
"keywords": "bridges, cross, Prut"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Bridge . ?uri dbo:crosses res:Prut . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Eiffel_Bridge,_Ungheni"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Lipcani-Rădăuți_Bridge"
}
}
]
}
}
]
}
,
{
"id": "74",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which instruments does Courtney Love play?",
"keywords": "instruments, Courtney Love, play"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Courtney_Love dbo:instrument ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/List_of_Rickenbacker_products"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Squier_Venus"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Fender_Jazzmaster"
}
}
]
}
}
]
}
,
{
"id": "75",
"answertype": "resource",
"aggregation": "union",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which languages are spoken in Romania?",
"keywords": "languages, spoken, Romania"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { { res:Romania dbo:language ?uri . } UNION { ?uri dbo:spokenIn res:Romania . } OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Romanian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Bulgarian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Hungarian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Macedonian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Banat_Bulgarian_dialect"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Kalderash_Romani_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Romanian_Sign_Language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Moselle_Franconian_dialects"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Turkish_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Dacian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Hungarian_Sign_Language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Croatian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Torlakian_dialect"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Karamanli_Turkish"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Megleno-Romanian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Aromanian_language"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Shtokavian"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Vlax_Romani_language"
}
}
]
}
}
]
}
,
{
"id": "76",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which museum exhibits The Skater?",
"keywords": "museum, exhibits, The Skater"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Skater dbo:museum ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/National_Gallery_of_Art"
}
}
]
}
}
]
}
,
{
"id": "77",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which music albums contain the song Into Your Arms?",
"keywords": "music albums, contain, song, Into Your Arms"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { ?single dbo:album ?uri . ?single rdfs:label 'Into Your Arms'@en . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Come_on_Feel_the_Lemonheads"
}
}
]
}
}
]
}
,
{
"id": "79",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Which presidents were born in 1891?",
"keywords": "presidents, born, 1891"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:President . ?uri dbo:birthDate ?date . FILTER regex(?date, '^1891') . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Karl_Dönitz"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Antonio_Segni"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Béla_Imrédy"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Mohammad-Reza_Hekmat"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Sun_Fo"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Alberto_Teisaire"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Harry_Nixon"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Mariano_Ospina_Pérez"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Saadallah_al-Jabiri"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Lutfi_al-Haffar"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Hans_Gabrielsen"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Máire_Gill"
}
}
]
}
}
]
}
,
{
"id": "81",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who created Retrocrush?",
"keywords": "created, Retrocrush"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Retrocrush dbo:author ?uri . OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Robert_Berry_(webmaster)"
}
}
]
}
}
]
}
,
{
"id": "82",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who created Miss Marple?",
"keywords": "created, Miss Marple"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Miss_Marple dbo:creator ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Agatha_Christie"
}
}
]
}
}
]
}
,
{
"id": "83",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who created the comic Old Man Logan?",
"keywords": "created, comic, Old Man Logan"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri ?string WHERE { res:Old_Man_Logan dbo:writer ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Mark_Millar"
}
}
]
}
}
]
}
,
{
"id": "84",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who designed the Langebro?",
"keywords": "designed, Langebro"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Langebro dbp:designer ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Kaj_Gottlob"
}
}
]
}
}
]
}
,
{
"id": "85",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who developed Quake engine?",
"keywords": "developed, Quake engine"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Quake_engine dbo:developer ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Id_Software"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/John_Carmack"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Michael_Abrash"
}
}
]
}
}
]
}
,
{
"id": "86",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who developed the video game Duke Nukem 3D?",
"keywords": "developed, video game, Duke Nukem 3D"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Duke_Nukem_3D dbo:developer ?uri . OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/3D_Realms"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/General_Arcade"
}
}
]
}
}
]
}
,
{
"id": "87",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who founded Sony?",
"keywords": "founded, Sony"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Sony dbo:foundedBy ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Akio_Morita"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Masaru_Ibuka"
}
}
]
}
}
]
}
,
{
"id": "88",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the editor of Semana?",
"keywords": "editor, Semana"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { res:Semana dbo:editor ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Alejandro_Santos_Rubino"
}
}
]
}
}
]
}
,
{
"id": "89",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the founder of DC Comics?",
"keywords": "founder, DC Comics"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:DC_Comics dbo:founder ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Malcolm_Wheeler-Nicholson"
}
}
]
}
}
]
}
,
{
"id": "90",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the heaviest player of the ASK Riga?",
"keywords": "heaviest, player, ASK Riga"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Person . ?uri dbo:weight ?num . { ?uri dbp:team res:ASK_Riga . } UNION { ?uri dbp:draftTeam res:ASK_Riga . } UNION { ?uri dbo:draftTeam res:ASK_Riga . } } ORDER BY DESC(?num) OFFSET 0 LIMIT 1"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Kaspars_Kambala"
}
}
]
}
}
]
}
,
{
"id": "91",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "true",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the manager of Gazelle FC?",
"keywords": "manager, Gazelle FC"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gazelle_FC> dbo:manager ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Mamadou_Bodjim"
}
}
]
}
}
]
}
]
}