<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<dataset id="qald-7-train-multilingual">
<question aggregation="false" answertype="resource" hybrid="false" id="1" onlydbo="true">
<string lang="en">List all the musicals with music by Elton John.</string>
<string lang="de">Liste alle Musicals mit Musik von Elton John auf.</string>
<string lang="es">Dame todos los musicales con música de Elton John.</string>
<string lang="it">Elenca tutti i musicals con musiche di Elton John.</string>
<string lang="fr">Donne-moi tous les musicals avec de la musique de de Elton John.</string>
<string lang="nl">Toen een lijst van alle musicals met muziek van Elton John.</string>
<string lang="ro">Listează toate muzicalurile cu muzică de Elton John.</string>
<keywords lang="en">musicals, music by, Elton John</keywords>
<keywords lang="de">Musicals, Musik von, Elton John</keywords>
<keywords lang="es">musicales, música, Elton John</keywords>
<keywords lang="it">musicals, musiche, Elton John</keywords>
<keywords lang="fr">musicals, musique, Elton John</keywords>
<keywords lang="nl">musicals, muziek van, Elton John</keywords>
<keywords lang="ro">muzicaluri, muzică de Elton John</keywords>
<query>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Musical .
        ?uri dbo:musicBy res:Elton_John .
}</query>
<answers>
<answer>http://dbpedia.org/resource/The_Lion_King_(musical)</answer>
<answer>http://dbpedia.org/resource/Lestat_(musical)</answer>
<answer>http://dbpedia.org/resource/Billy_Elliot_the_Musical</answer>
<answer>http://dbpedia.org/resource/Aida_(musical)</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="51" onlydbo="true">
<string lang="en">Give me all actors starring in movies directed by William Shatner.</string>
<string lang="fa">تمام بازیگرانی که در فیلم های کارگردانی شده توسط ویلیام شاتنر بازی کرده اند را لیست کن.</string>
<string lang="de">Gib mir alle Schauspieler von Filmen, in denen William Shatner Regie geführt hat.</string>
<string lang="es">Dame todos los actores de películas dirigidas por William Shatner.</string>
<string lang="it">Dammi tutti gli attori che recitano in film diretti da William Shatner.</string>
<string lang="fr">Donnes-moi tous les acteurs qui ont joué dans des films réalisés par Williams Shatner.</string>
<string lang="nl">Geef alle acteurs van films waar William Shatner de regie van voerde.</string>
<string lang="ro">Dă-mi toți actorii care joacă roluri principale în filme regizate de William Shatner.</string>
<keywords lang="en">actor, starring, movie, direct, William Shatner</keywords>
<keywords lang="fa">بازیگرانی، فیلم های، کارگردانی شده، ویلیام شاتنر، بازی کرده اند</keywords>
<keywords lang="de">Schauspieler, Film, Regie, William Shatner</keywords>
<keywords lang="es">actor, película, director, William Shatner</keywords>
<keywords lang="it">attore, recitare, film, diretto, William Shatner</keywords>
<keywords lang="fr">acteur, film, réalisé, William Shatner</keywords>
<keywords lang="nl">acteur, film, regisseur, William Shatner</keywords>
<keywords lang="ro">actor, rol principal, film, regiza, William Shatner</keywords>
<query>SELECT DISTINCT ?uri WHERE {  ?x &lt;http://dbpedia.org/ontology/director&gt; &lt;http://dbpedia.org/resource/William_Shatner&gt; .  ?x &lt;http://dbpedia.org/ontology/starring&gt; ?uri . } </query>
<answers>
<answer>http://dbpedia.org/resource/Tom_Towles</answer>
<answer>http://dbpedia.org/resource/William_Shatner</answer>
<answer>http://dbpedia.org/resource/Brenda_Bakke</answer>
<answer>http://dbpedia.org/resource/John_Prosky</answer>
<answer>http://dbpedia.org/resource/Dan_Martin_(actor)</answer>
<answer>http://dbpedia.org/resource/Duane_Whitaker</answer>
<answer>http://dbpedia.org/resource/J.T._Colosa</answer>
<answer>http://dbpedia.org/resource/Chuck_Williams_(actor)</answer>
<answer>http://dbpedia.org/resource/Dick_Van_Patten</answer>
<answer>http://dbpedia.org/resource/Dan_Gauthier</answer>
<answer>http://dbpedia.org/resource/Amy_Acker</answer>
<answer>http://dbpedia.org/resource/Rickey_Medlocke</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="53" onlydbo="false">
<string lang="en">Give me all professional skateboarders from Sweden.</string>
<string lang="de">Gib mir alle Profiskateboarder aus Schweden.</string>
<string lang="es">Dame todos las skateboarders profesionales de Suecia.</string>
<string lang="it">Dammi tutti gli skateboarders professionisti di Svezia.</string>
<string lang="fr">Donne-moi tous les skateboarders professionnels de Suède.</string>
<string lang="nl">Noem alle professionele skateboarders uit Zweden.</string>
<keywords lang="en">professional, skateboarder, Sweden</keywords>
<keywords lang="de">Profiskateboarder, Schweden</keywords>
<keywords lang="es">skateboarder profesional, Suecia</keywords>
<keywords lang="it">skateboarders professionisti, Svezia</keywords>
<keywords lang="fr">skateboarders professionnels, Suède</keywords>
<keywords lang="nl">skateboarder, professioneel, Zweden</keywords>
<query>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX dbp: &lt;http://dbpedia.org/property/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?uri 
WHERE {
	?uri dbo:occupation res:Skateboarding . 
        { ?uri dbo:birthPlace res:Sweden . }
        UNION
        { ?uri dbo:birthPlace ?place . 
          ?place dbo:country res:Sweden . }
}</query>
<answers>
<answer>http://dbpedia.org/resource/Ali_Boulala</answer>
<answer>http://dbpedia.org/resource/Tony_Magnusson</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="62" onlydbo="true">
<string lang="en">List all episodes of the first season of the HBO television series The Sopranos!</string>
<string lang="de">Liste alle Episoden der ersten Staffel der HBO-Fernsehserie Die Sopranos auf.</string>
<string lang="es">Dame todos los episodios de la prímera época de la serie de HBO Los Sporanos.</string>
<string lang="it">Elenca tutti gli episodi della prima stagione della serie televisiva di HBO i Sopranos!</string>
<string lang="fr">Donnes-moi tous les épisodes de la première saison de la série télévisée de HBO les Sopranos.</string>
<string lang="nl">Noem alle afleveringen van het eerste seizoen van de HBO-serie The Sopranos.</string>
<keywords lang="en">HBO, television series, Sopranos, first season, episode</keywords>
<keywords lang="de">HBO-Fernsehserie, Sopranos, erste Staffel, Episode</keywords>
<keywords lang="es">serie televisiva de HBO, Los Sopranos, primera época, episodios</keywords>
<keywords lang="it">serie televisiva di HBO, i Sopranos, prima stagione, episodio</keywords>
<keywords lang="fr">épisodes de la première saison, HBO, les Sopranos</keywords>
<keywords lang="nl">HBO-serie, The Sopranos, eerste seizoen, aflevering</keywords>
<query>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?uri 
WHERE {
	?uri dbo:series res:The_Sopranos  .
        ?uri dbo:seasonNumber 1 .
}</query>
<answers>
<answer>http://dbpedia.org/resource/Isabella_(The_Sopranos)</answer>
<answer>http://dbpedia.org/resource/Meadowlands_(The_Sopranos)</answer>
<answer>http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti</answer>
<answer>http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano</answer>
<answer>http://dbpedia.org/resource/Boca_(The_Sopranos)</answer>
<answer>http://dbpedia.org/resource/Nobody_Knows_Anything</answer>
<answer>http://dbpedia.org/resource/Pax_Soprana</answer>
<answer>http://dbpedia.org/resource/A_Hit_Is_a_Hit</answer>
<answer>http://dbpedia.org/resource/Denial,_Anger,_Acceptance</answer>
<answer>http://dbpedia.org/resource/College_(The_Sopranos)</answer>
<answer>http://dbpedia.org/resource/46_Long</answer>
<answer>http://dbpedia.org/resource/The_Sopranos_(episode)</answer>
<answer>http://dbpedia.org/resource/Down_Neck</answer>
</answers>
</question>
<question aggregation="false" answertype="list" hybrid="false" id="67" onlydbo="true">
<string lang="en">Give me all launch pads operated by NASA.</string>
<string lang="de">Gib mir alle von der NASA betriebenen Startrampen.</string>
<string lang="es">Dame todas las plataformas de lanzamiento operadas por la NASA.</string>
<string lang="it">Dammi tutte le rampe di lancio gestite dalla NASA.</string>
<string lang="fr">Donnes-moi toutes les rampes de lancements des Etats-unis.</string>
<string lang="nl">Noem alle lanceerplatformen van de NASA.</string>
<string lang="ro">Dă-mi toate rampele de lansare operate de către NASA.</string>
<keywords lang="en">launch pad, operate, NASA</keywords>
<keywords lang="de">Startrampe, betreiben, NASA</keywords>
<keywords lang="es">plataforma de lanzamiento, operada por la NASA</keywords>
<keywords lang="it">rampa di lancio, gestire, NASA</keywords>
<keywords lang="fr">rampes de lancements, Etats-unis</keywords>
<keywords lang="nl">lanceerplatform, NASA</keywords>
<keywords lang="ro">rampă de lansare, operat, NASA</keywords>
<query>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; 
PREFIX res: &lt;http://dbpedia.org/resource/&gt; 
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:LaunchPad .  
        ?uri dbo:operator res:NASA . 
}</query>
<answers>
<answer>http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0</answer>
<answer>http://dbpedia.org/resource/Keweenaw_Rocket_Range</answer>
<answer>http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36</answer>
<answer>http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3</answer>
<answer>http://dbpedia.org/resource/Broglio_Space_Centre</answer>
<answer>http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39</answer>
<answer>http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="78" onlydbo="true">
<string lang="en">Give me all video games published by Mean Hamster Software.</string>
<string lang="de">Gib mir alle Videospiele von Mean Hamster Software.</string>
<string lang="es">Dame todos los videojuegos de Mean Hamster Software.</string>
<string lang="it">Dammi tutti i videogiochi di Mean Hamster Software.</string>
<string lang="fr">Donnes-moi tous les jeux vidéos publiés par Mean Hamster Software.</string>
<string lang="nl">Geef me alle videogames van Mean Hamster Software.</string>
<string lang="ro">Dă-mi toate jocurile video publicate de Mean Hamster Software</string>
<keywords lang="en">video game, publish, Mean Hamster Software</keywords>
<keywords lang="de">Videospiel, Mean Hamster Software</keywords>
<keywords lang="es">videojuego, Mean Hamster Software</keywords>
<keywords lang="it">videogioco, prodotto, Mean Hamster Software</keywords>
<keywords lang="fr">jeux vidéos, publiés, Mean Hamster Software</keywords>
<keywords lang="nl">videogame, Mean Hamster Software</keywords>
<keywords lang="ro">joc video, publicat, Mean Hamster Software</keywords>
<query>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT DISTINCT ?uri 
WHERE {
      ?uri rdf:type dbo:VideoGame .
      ?uri dbo:publisher res:Mean_Hamster_Software . 
}</query>
<answers>
<answer>http://dbpedia.org/resource/Crossbow_(video_game)</answer>
<answer>http://dbpedia.org/resource/Riven</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="83" onlydbo="true">
<string lang="en">Give me all movies directed by Francis Ford Coppola.</string>
<string lang="fa">تمام فیلم های کارگردانی شده توسط فرانسیس فورد کوپولا را لیست کن.</string>
<string lang="de">Gib mir alle Filme, bei denen Francis Ford Coppola Regie geführt hat.</string>
<string lang="es">Dame todas las películas que haya dirigido Francis Ford Coppola.</string>
<string lang="it">Dammi tutti i film diretti da Francis Ford Coppola.</string>
<string lang="fr">Donnes-moi tous les films dont Francis réalisés par Francis Ford Coppola.</string>
<string lang="nl">Geef alle films die werden geregisseerd door Francis Ford Coppola.</string>
<string lang="ro">Dă-mi toate filmele regizate de Francis Ford Coppola.</string>
<keywords lang="en">movie, direct, Francis Ford Coppola</keywords>
<keywords lang="fa">فیلم، کارگردانی، فرانسیس فورد کوپولا</keywords>
<keywords lang="de">Film, Regie, Francis Ford Coppola</keywords>
<keywords lang="es">película, director, Francis Ford Coppola</keywords>
<keywords lang="it">film, dirigere, Francis Ford Coppola</keywords>
<keywords lang="fr">film, directeur, Francis Ford Coppola</keywords>
<keywords lang="nl">films, regisseur, Francis Ford Coppola</keywords>
<keywords lang="ro">film, regizat, Francis Ford Coppola</keywords>
<query>SELECT DISTINCT ?uri WHERE {  ?uri &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;http://dbpedia.org/ontology/Film&gt; .  ?uri &lt;http://dbpedia.org/ontology/director&gt; &lt;http://dbpedia.org/resource/Francis_Ford_Coppola&gt; . } </query>
<answers>
<answer>http://dbpedia.org/resource/The_Rain_People</answer>
<answer>http://dbpedia.org/resource/The_Godfather_Part_III</answer>
<answer>http://dbpedia.org/resource/One_from_the_Heart</answer>
<answer>http://dbpedia.org/resource/The_Outsiders_(film)</answer>
<answer>http://dbpedia.org/resource/The_Terror_(1963_film)</answer>
<answer>http://dbpedia.org/resource/The_Godfather_Part_II</answer>
<answer>http://dbpedia.org/resource/Twixt_(film)</answer>
<answer>http://dbpedia.org/resource/The_Cotton_Club_(film)</answer>
<answer>http://dbpedia.org/resource/Tonight_for_Sure</answer>
<answer>http://dbpedia.org/resource/Peggy_Sue_Got_Married</answer>
<answer>http://dbpedia.org/resource/Apocalypse_Now</answer>
<answer>http://dbpedia.org/resource/The_Conversation</answer>
<answer>http://dbpedia.org/resource/Apocalypse_Now_Redux</answer>
<answer>http://dbpedia.org/resource/Bram_Stoker's_Dracula</answer>
<answer>http://dbpedia.org/resource/Rumble_Fish</answer>
<answer>http://dbpedia.org/resource/Hammett_(film)</answer>
<answer>http://dbpedia.org/resource/The_Godfather</answer>
<answer>http://dbpedia.org/resource/Youth_Without_Youth_(film)</answer>
<answer>http://dbpedia.org/resource/Finian's_Rainbow_(film)</answer>
<answer>http://dbpedia.org/resource/Dementia_13</answer>
<answer>http://dbpedia.org/resource/Tucker:_The_Man_and_His_Dream</answer>
<answer>http://dbpedia.org/resource/Gardens_of_Stone</answer>
<answer>http://dbpedia.org/resource/The_Rainmaker_(1997_film)</answer>
<answer>http://dbpedia.org/resource/You're_a_Big_Boy_Now</answer>
<answer>http://dbpedia.org/resource/Tetro</answer>
<answer>http://dbpedia.org/resource/New_York_Stories</answer>
<answer>http://dbpedia.org/resource/The_Godfather_Saga</answer>
<answer>http://dbpedia.org/resource/The_Godfather_(film_series)</answer>
<answer>http://dbpedia.org/resource/Battle_Beyond_the_Sun</answer>
<answer>http://dbpedia.org/resource/The_Bellboy_and_the_Playgirls</answer>
<answer>http://dbpedia.org/resource/Captain_EO__Captain_EO__1</answer>
<answer>http://dbpedia.org/resource/Jack_(1996_film)</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="88" onlydbo="true">
<string lang="en">Give me the grandchildren of Elvis Presley.</string>
<string lang="fa">نوه های الویس پرسلی را لیست کن.</string>
<string lang="de">Gib mir die Enkel von Elvis Presley.</string>
<string lang="es">Dame todos los nietos de Elvis Presley.</string>
<string lang="it">Dammi i nipoti di Elvis Presley.</string>
<string lang="fr">Donne-moi tous les petit-enfants de Elvis Presley.</string>
<string lang="nl">Toon alle kleinkinderen van Elvis Presley.</string>
<string lang="ro">Dă-mi nepoții lui Elvis Presley.</string>
<keywords lang="en">Elvis Presley, grandchildren</keywords>
<keywords lang="fa">نوه های، الویس پرسلی</keywords>
<keywords lang="de">Elvis Presley, Enkel</keywords>
<keywords lang="es">Elvis Presley, nietos</keywords>
<keywords lang="it">Elvis Presley, nipoti</keywords>
<keywords lang="fr">petit-enfants, Elvis Presley</keywords>
<keywords lang="nl">Elvis Presley, kleinkinderen</keywords>
<keywords lang="ro">Elvis Presley, nepoți</keywords>
<query>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia.org/resource/Elvis_Presley&gt; &lt;http://dbpedia.org/ontology/child&gt; ?child . ?child &lt;http://dbpedia.org/ontology/child&gt; ?uri . }</query>
<answers>
<answer>http://dbpedia.org/resource/Riley_Keough</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="95" onlydbo="true">
<string lang="en">Give me all Canadian Grunge record labels.</string>
<string lang="de">Gib mir alle kanadischen Grunge-Plattenfirmen.</string>
<string lang="es">Dame todos las empresas canadienses productoras de música Grunge.</string>
<string lang="it">Dammi tutti i produttori canadesi di musica Grunge.</string>
<string lang="fr">Donnes-moi tous les labels discographiques canadiens de grunge.</string>
<string lang="nl">Noem alle Canadese grunge-platenlabels.</string>
<keywords lang="en">record label, Canadian, Grunge</keywords>
<keywords lang="de">kanadisch, Plattenfirma, Grunge</keywords>
<keywords lang="es">empresa productora de música, canadiense, Grunge</keywords>
<keywords lang="it">produttore di musica, canadese, Grunge</keywords>
<keywords lang="fr">labels discographiques, canadiens, grunge</keywords>
<keywords lang="nl">Canadees, platenlabel, Grunge</keywords>
<query>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type dbo:RecordLabel .
        ?uri dbo:genre res:Grunge .
        ?uri dbo:country res:Canada .
}</query>
<answers>
<answer>http://dbpedia.org/resource/Murderecords</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="97" onlydbo="true">
<string lang="en">List the children of Margaret Thatcher.</string>
<string lang="de">Liste die Kinder von Margaret Thatcher auf.</string>
<string lang="es">Dame una lista de los hijos de Margaret Thatcher.</string>
<string lang="it">Elenca i figli di Margaret Thatcher.</string>
<string lang="fr">Donnes-moi tous les enfants de Margaret Thatcher.</string>
<string lang="nl">Noem alle kinderen van Margaret Thatcher.</string>
<keywords lang="en">Margaret Thatcher, child</keywords>
<keywords lang="de">Margaret Thatcher, Kind</keywords>
<keywords lang="es">Margaret Thatcher, hijos</keywords>
<keywords lang="it">Margaret Thatcher, figlio</keywords>
<keywords lang="fr">enfants, Margaret Thatcher</keywords>
<keywords lang="nl">kinderen, Margaret Thatcher</keywords>
<query>PREFIX res: &lt;http://dbpedia.org/resource/&gt;
PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
SELECT DISTINCT ?uri 
WHERE {
	res:Margaret_Thatcher dbo:child ?uri .
}</query>
<answers>
<answer>http://dbpedia.org/resource/Carol_Thatcher</answer>
<answer>http://dbpedia.org/resource/Mark_Thatcher</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="102" onlydbo="true">
<string lang="en">List all games by GMT.</string>
<string lang="de">Liste alle Spiele von GMT auf.</string>
<string lang="es">Dame todos los juegos de GMT.</string>
<string lang="it">Elenca tutti i giochi di GMT.</string>
<string lang="fr">Donne-moi tous les jeux de GMT.</string>
<string lang="nl">Noem alle spelen van GMT.</string>
<keywords lang="en">game, GMT</keywords>
<keywords lang="de">Spiel, GMT</keywords>
<keywords lang="es">juegos, GMT</keywords>
<keywords lang="it">gioco, GMT</keywords>
<keywords lang="fr">jeux, GMT</keywords>
<keywords lang="nl">spel, GMT</keywords>
<query>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?uri 
WHERE {	
        ?uri dbo:publisher res:GMT_Games .
}</query>
<answers>
<answer>http://dbpedia.org/resource/Washington's_War</answer>
<answer>http://dbpedia.org/resource/Fields_of_Fire_(game)</answer>
<answer>http://dbpedia.org/resource/Commands_&amp;_Colors:_Ancients</answer>
<answer>http://dbpedia.org/resource/Twilight_Struggle</answer>
<answer>http://dbpedia.org/resource/Sword_of_Rome</answer>
<answer>http://dbpedia.org/resource/Paths_of_Glory_(board_game)</answer>
<answer>http://dbpedia.org/resource/Chandragupta_(board_game)</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="132" onlydbo="true">
<string lang="en">Give me a list of all critically endangered birds.</string>
<string lang="fa">لیستی از پرندگان روبه انقراض را بده.</string>
<string lang="de">Gib mir eine Liste aller stark bedrohten Vogelarten.</string>
<string lang="es">Dame una lista de todas las aves en peligro de extinción.</string>
<string lang="it">Dammi la lista di tutti gli uccelli in via di estinzione.</string>
<string lang="fr">Donnes-moi la liste des oiseaux en voie de disparition.</string>
<string lang="nl">Geef een lijst met alle ernstig bedreigde vogelsoorten.</string>
<string lang="ro">Dă-mi o listă cu toate păsările în pericol ridicat de dispariție.</string>
<keywords lang="en">list, critically endangered birds</keywords>
<keywords lang="fa">پرندگان، روبه انقراض</keywords>
<keywords lang="de">Vogel, stark gefährdet</keywords>
<keywords lang="es">aves, peligro de extinción</keywords>
<keywords lang="it">lista, uccelli in via di estinzione</keywords>
<keywords lang="fr">oiseaux, voie de disparition</keywords>
<keywords lang="nl">vogels, ernstig bedreigd</keywords>
<keywords lang="ro">listă, păsări în pericol ridicat de dispariție</keywords>
<query>SELECT DISTINCT ?uri ?p WHERE { ?uri a &lt;http://dbpedia.org/ontology/Bird&gt; . { ?uri &lt;http://dbpedia.org/ontology/conservationStatus&gt; 'CR'^^&lt;http://www.w3.org/2001/XMLSchema#string&gt; . } UNION { ?uri &lt;http://purl.org/dc/terms/subject&gt; &lt;http://dbpedia.org/resource/Category:Critically_endangered_animals&gt; . } }</query>
<answers>
<answer>http://dbpedia.org/resource/Chatham_pigeon</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="143" onlydbo="true">
<string lang="en">Show me the book that Muhammad Ali wrote.</string>
<string lang="de">Zeig mir das Buch, das Muhammad Ali geschrieben hat.</string>
<string lang="es">Muéstrame el libro escrito por Muhammad Ali.</string>
<string lang="it">Mostrami il libro scritto da Muhammad Ali.</string>
<string lang="fr">Donne-moi le livre écrit par Muhammad Ali.</string>
<string lang="nl">Toen het boek dat Muhammad Ali heeft geschreven.</string>
<string lang="ro">Arată-mi cartea pe care a scris-o Muhammad Ali.</string>
<keywords lang="en">book, wrote, Muhammad Ali</keywords>
<keywords lang="de">Buch, geschrieben, Muhammad Ali</keywords>
<keywords lang="es">libro, autor, Muhammad Ali</keywords>
<keywords lang="it">libro, autore, Muhammad Ali</keywords>
<keywords lang="fr">livre, par Muhammad Ali</keywords>
<keywords lang="nl">boek, geschreven, Muhammad Ali</keywords>
<keywords lang="ro">carte, scris, Muhammad Ali</keywords>
<query>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; 
PREFIX res: &lt;http://dbpedia.org/resource/&gt; 
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; 
SELECT DISTINCT ?uri 
WHERE { 
         ?uri rdf:type dbo:Book . 
         ?uri dbo:author res:Muhammad_Ali . 
}</query>
<answers>
<answer>http://dbpedia.org/resource/The_Soul_of_a_Butterfly</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="146" onlydbo="true">
<string lang="en">Give me all actors starring in Last Action Hero.</string>
<string lang="de">Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.</string>
<string lang="es">Dame todos los actores que hayan actuado en Last Action Hero.</string>
<string lang="it">Dammi tutti gli attori che hanno recitato in Last Action Hero.</string>
<string lang="fr">Noem alle acteurs uit de film Last Action Hero.</string>
<string lang="nl">Noem alle acteurs uit de film Last Action Hero.</string>
<string lang="ro">Dă-mi toți actorii cu roluri principale în Last Action Hero.</string>
<keywords lang="en">actor, starring, Last Action Hero</keywords>
<keywords lang="de">Schauspieler, mitspielen, Last Action Hero</keywords>
<keywords lang="es">actores, Last Action Hero</keywords>
<keywords lang="it">attori, Last Action Hero</keywords>
<keywords lang="fr">acteurs, Last Action Hero</keywords>
<keywords lang="nl">acteur, Last Action Hero</keywords>
<keywords lang="ro">actor, rol principal, Last Action Hero</keywords>
<query>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?uri
WHERE {
        res:Last_Action_Hero dbo:starring ?uri . 
}</query>
<answers>
<answer>http://dbpedia.org/resource/Tom_Noonan</answer>
<answer>http://dbpedia.org/resource/F._Murray_Abraham</answer>
<answer>http://dbpedia.org/resource/Arnold_Schwarzenegger</answer>
<answer>http://dbpedia.org/resource/Bridgette_Wilson</answer>
<answer>http://dbpedia.org/resource/Charles_Dance</answer>
<answer>http://dbpedia.org/resource/Art_Carney</answer>
<answer>http://dbpedia.org/resource/Austin_O'Brien</answer>
<answer>http://dbpedia.org/resource/Robert_Prosky</answer>
<answer>http://dbpedia.org/resource/Anthony_Quinn</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="177" onlydbo="true">
<string lang="en">Give me all Swedish oceanographers.</string>
<string lang="de">Gib mir alle Schwedischen Ozeanographen.</string>
<string lang="es">Dame todos los oceanógrafos suecos.</string>
<string lang="it">Dammi tutti gli oceanografi svedesi.</string>
<string lang="fr">Donne-moi tous les océanographes suédois.</string>
<string lang="nl">Toon alle Zweedse oceanograafen.</string>
<string lang="ro">Dă-mi toți oceanografii suedezi.</string>
<keywords lang="en">Swedish, oceanographer</keywords>
<keywords lang="de">Schwedisch, Ozeanographen</keywords>
<keywords lang="es">oceanógrafos suecos</keywords>
<keywords lang="it">svedesi, oceanografi</keywords>
<keywords lang="fr">Océanographes, suédois</keywords>
<keywords lang="nl">Zweedse, oceanograafen</keywords>
<keywords lang="ro">oceanograf, suedez</keywords>
<query>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:field res:Oceanography . 
        ?uri dbo:birthPlace res:Sweden .        
}</query>
<answers>
<answer>http://dbpedia.org/resource/Vagn_Walfrid_Ekman</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="178" onlydbo="true">
<string lang="en">Show me Hemingway's autobiography.</string>
<string lang="fa">خود زندگی نامه همینگوی را بده.</string>
<string lang="de">Zeig mir Hemmingways Autobiographie.</string>
<string lang="es">Muéstrame la autobiografía Hemingway.</string>
<string lang="it">Mostrami l'autobiografia di Hemingway.</string>
<string lang="fr">Montre l'autobiographie de Hemingway.</string>
<string lang="nl">Toen de autobiografie van Hemmingway.</string>
<string lang="ro">Arată-mi autobiografia lui Hemingway</string>
<keywords lang="en">autobiography, Hemingway</keywords>
<keywords lang="fa">خود زندگی نامه، همینگوی</keywords>
<keywords lang="de">Hemmingway, Autobiographie</keywords>
<keywords lang="es">autobiografía Hemingway</keywords>
<keywords lang="it">autobiorafia, Hemingway</keywords>
<keywords lang="fr">autobiographie, Hemingway</keywords>
<keywords lang="nl">Hemmingway, autobiografie</keywords>
<keywords lang="ro">autobiografie, Hemingway</keywords>
<query>SELECT DISTINCT ?uri WHERE { ?uri &lt;http://dbpedia.org/ontology/author&gt; &lt;http://dbpedia.org/resource/Ernest_Hemingway&gt; . ?uri &lt;http://dbpedia.org/ontology/literaryGenre&gt; &lt;http://dbpedia.org/resource/Autobiography&gt; . }</query>
<answers>
<answer>http://dbpedia.org/resource/A_Moveable_Feast</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" hybrid="false" id="188" onlydbo="true">
<string lang="en">Give me all books by William Goldman with more than 300 pages.</string>
<string lang="de">Gib mir alle Bücher von William Goldman mit mehr als 300 Seiten.</string>
<string lang="es">Dame todos los libros de Wiliam Goldman con más de 300 páginas.</string>
<string lang="it">Dammi tutti i libri di Wiliam Goldman con più di 300 pagine.</string>
<string lang="fr">Donnes-moi tous les livres de William Goldman avec plus de 300 pages.</string>
<string lang="nl">Geef alle boeken van William Goldman met meer dan 300 pagina's.</string>
<string lang="ro">Dă-mi toate carțile de William Glodman cu mai mult de 300 de pagini.</string>
<keywords lang="en">book, William Goldman, pages, more than 300</keywords>
<keywords lang="de">Buch, William Goldman, Seiten, mehr als 300</keywords>
<keywords lang="es">libro, William Goldman, más de 300 páginas</keywords>
<keywords lang="it">libro, Wiliam Goldman, pagine, più di 300</keywords>
<keywords lang="fr">livres, William Goldman, plus de 300 pages</keywords>
<keywords lang="nl">boeken, William Goldman, meer dan 300 pagina's</keywords>
<keywords lang="ro">carte, William Goldman, pagini, mai mult de 300</keywords>
<query>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Book .
        ?uri dbo:author res:William_Goldman .
        ?uri dbo:numberOfPages ?x .
        FILTER (?x &gt; 300)
}</query>
<answers>
<answer>http://dbpedia.org/resource/Marathon_Man_(novel)</answer>
<answer>http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F</answer>
<answer>http://dbpedia.org/resource/Hype_and_Glory</answer>
<answer>http://dbpedia.org/resource/Tinsel_(novel)</answer>
<answer>http://dbpedia.org/resource/Boys_and_Girls_Together</answer>
<answer>http://dbpedia.org/resource/Control_(novel)</answer>
<answer>http://dbpedia.org/resource/The_Color_of_Light</answer>
<answer>http://dbpedia.org/resource/The_Princess_Bride</answer>
<answer>http://dbpedia.org/resource/Wait_Till_Next_Year</answer>
<answer>http://dbpedia.org/resource/Brothers_(Goldman_novel)</answer>
</answers>
</question>
