<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<dataset id="qald7-train-hybrid">
<question aggregation="false" answertype="resource" hybrid="true" id="6" onlydbo="true">
<string lang="en">Dakar is the capital of which country member of the African Union?</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?uri 
WHERE {
	?uri text:"member of" text:"the African Union" .	
	?uri dbo:capital res:Dakar .
}</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Senegal</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="13" onlydbo="true">
<string lang="en">Which anti-apartheid activist graduated from the University of South Africa?</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type text:"anti-apartheid activist" .
        ?uri dbo:almaMater res:University_of_South_Africa .
}</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Nelson_Mandela</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="14" onlydbo="true">
<string lang="en">Who is the front man of the band that wrote Coffee &amp; TV?</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
SELECT DISTINCT ?uri 
WHERE {
        &lt;http://dbpedia.org/page/Coffee_&amp;_TV&gt; dbo:musicalArtist ?x .
        ?x dbo:bandMember ?uri .
        ?uri text:"is" text:"frontman" .
}</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Damon_Albarn</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="19" onlydbo="true">
<string lang="en">Which Secretary of State policies lead to the United States' acquisition of Pacific colonies?</string>
<pseudoquery>SELECT DISTINCT ?uri WHERE { ?uri &lt;http://dbpedia.org/ontology/office&gt; "United States Secretary of State" . ?uri text:"policies lead" text:"United States' acquisition of Pacific colonies" . }</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/James_G._Blaine</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="21" onlydbo="true">
<string lang="en">Who played the drums in the band that wrote Complete Control?</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?uri 
WHERE {
        res:Complete_Control dbo:musicalArtist ?x .
        ?x dbo:bandMember ?uri .
        ?uri text:"plays" text:"drums" .
}</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Topper_Headon</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="32" onlydbo="true">
<string lang="en">In which city was the assassin of Martin Luther King born?</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT DISTINCT ?uri
WHERE {
        res:Martin_Luther_King,_Jr. text:"assassin" ?x . 
        ?x dbo:birthPlace ?uri .
        ?uri rdf:type dbo:Settlement .
}</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Alton,_Illinois</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="37" onlydbo="true">
<string lang="en">List all the battles commanded by the lover of Cleopatra.</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?uri 
WHERE { 
    ?x text:"lover" text:"Cleopatra".   
    ?uri dbo:commander ?x .
}</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Avaricum</answer>
<answer>http://dbpedia.org/resource/Battle_of_Alesia</answer>
<answer>http://dbpedia.org/resource/Siege_of_Uxellodunum</answer>
<answer>http://dbpedia.org/resource/Battle_of_the_Axona</answer>
<answer>http://dbpedia.org/resource/Battle_of_Zela</answer>
<answer>http://dbpedia.org/resource/Siege_of_Massilia</answer>
<answer>http://dbpedia.org/resource/Battle_of_Gergovia</answer>
<answer>http://dbpedia.org/resource/Gallic_Wars</answer>
<answer>http://dbpedia.org/resource/Siege_of_Alexandria_(47_BC)</answer>
<answer>http://dbpedia.org/resource/Battle_of_Thapsus</answer>
<answer>http://dbpedia.org/resource/Battle_of_Vosges_(58_BC)</answer>
<answer>http://dbpedia.org/resource/Battle_of_Dyrrhachium_(48_BC)</answer>
<answer>http://dbpedia.org/resource/Battle_of_Pharsalus</answer>
<answer>http://dbpedia.org/resource/Caesar's_invasions_of_Britain</answer>
<answer>http://dbpedia.org/resource/Battle_of_the_Nile_(47_BC)</answer>
<answer>http://dbpedia.org/resource/Caesar's_Civil_War</answer>
<answer>http://dbpedia.org/resource/Battle_of_Munda</answer>
<answer>http://dbpedia.org/resource/Battle_of_Bibracte</answer>
<answer>http://dbpedia.org/resource/Battle_of_the_Sabis</answer>
<answer>http://dbpedia.org/resource/Battle_of_Ilerda</answer>
<answer>http://dbpedia.org/resource/Battle_of_the_Arar</answer>
<answer>http://dbpedia.org/resource/Battle_of_Ruspina</answer>
</answers>
</question>
<question aggregation="false" answertype="string" hybrid="true" id="39" onlydbo="true">
<string lang="en">Daniel Craig</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?string 
WHERE {
        res:James_Bond dbo:lastAppearance ?x .
        ?x text:"feature as James Bond" ?string .
}</pseudoquery>
<answers>
<answer>Daniel Craig</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="41" onlydbo="true">
<string lang="en">The home of the Mona Lisa is a landmark of which city?</string>
<pseudoquery>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia.org/resource/Mona_Lisa&gt; &lt;http://dbpedia.org/ontology/museum&gt; ?x . ?x text:"landmark of" ?uri . }</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Paris</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="45" onlydbo="false">
<string lang="en">How many children does the actor who plays Dan White in Milk have?</string>
<pseudoquery>SELECT ?n WHERE { &lt;http://dbpedia.org/resource/Milk_(film)&gt; &lt;http://dbpedia.org/ontology/starring&gt; ?uri . ?uri text:"play" text:"Dan White" . ?uri &lt;http://dbpedia.org/property/children&gt; ?n . }</pseudoquery>
<answers>
<answer>2</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="46" onlydbo="true">
<string lang="en">Who are the architects of the tallest building in Japan?</string>
<pseudoquery>SELECT DISTINCT ?uri WHERE { text:"tallest building in Japan" &lt;http:/dbpedia.org/ontology/architect&gt; ?uri . }</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/César_Pelli</answer>
<answer>http://dbpedia.org/resource/Nikken_Sekkei</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="48" onlydbo="true">
<string lang="en">Which recipients of the Victoria Cross fought in the Battle of Arnhem?</string>
<pseudoquery> PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PREFIX res: &lt;http://dbpedia.org/resource/&gt; SELECT DISTINCT ?uri WHERE {     ?uri dbo:award res:Victoria_Cross .    { ?uri text:"fought in" text:"Battle of Arnhem" . } UNION {?uri text:"went into action" text:"Battle of Arnhem"} } </pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/John_Baskeyfield</answer>
<answer>http://dbpedia.org/resource/John_Hollington_Grayburn</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="54" onlydbo="true">
<string lang="en">Which of the volcanoes that erupted in 1550 was named after an explorer?</string>
<pseudoquery>SELECT DISTINCT ?uri WHERE { ?uri &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;http:/dbpedia.org/ontology/Volcano&gt; . ?uri &lt;http:/dbpedia.org/ontology/eruptionYear&gt; ?y . ?uri text:"named after" text:"explorer" . FILTER (year(?y) = 1550)  }</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Krasheninnikov_(volcano)</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="55" onlydbo="true">
<string lang="en">In which British territories was the "Father of Singapore" born?</string>
<pseudoquery>SELECT DISTINCT ?uri WHERE { text:"Father of modern Singapore" &lt;http://dbpedia.org/ontology/birthPlace&gt; ?uri . ?uri rdf:type text:"British territories" . }</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Straits_Settlements</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="58" onlydbo="true">
<string lang="en">Where did the first human in space die?</string>
<pseudoquery> PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PREFIX dbp: &lt;http://dbpedia.org/property/&gt; PREFIX res: &lt;http://dbpedia.org/resource/&gt; SELECT DISTINCT ?uri WHERE {         ?x dbp:type text:"first human in space" .         ?x dbo:deathPlace ?uri . } </pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Kirzhach</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="59" onlydbo="true">
<string lang="en">Which daughter of Francis Ford Coppola received an Academy Award for Lost in Translation?</string>
<pseudoquery>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia.org/resource/Francis_Ford_Coppola&gt; &lt;http://dbpedia.org/ontology/child&gt; ?x . ?x text:"receive the Academy Award  for" text:"Lost in Translation" . }</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Sofia_Coppola</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="62" onlydbo="true">
<string lang="en">Give me the currencies of all G8 countries.</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT DISTINCT ?uri
WHERE {
        ?x text:"member of" text:"G8" . 
        ?x dbo:currency ?uri . 
}</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Euro_sign</answer>
<answer>http://dbpedia.org/resource/United_States_dollar</answer>
<answer>http://dbpedia.org/resource/Japanese_yen</answer>
<answer>http://dbpedia.org/resource/Russian_ruble</answer>
<answer>http://dbpedia.org/resource/Canadian_dollar</answer>
<answer>http://dbpedia.org/resource/Pound_sterling</answer>
<answer>http://dbpedia.org/resource/Euro</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="65" onlydbo="true">
<string lang="en">In which city does the leader of the Xposé girls live?</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?uri 
WHERE {
        ?x text:"is" text:"leader of the Xposé girls" .
        ?x dbo:residence ?uri .</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Dublin</answer>
</answers>
</question>
<question aggregation="false" answertype="date" hybrid="true" id="66" onlydbo="true">
<string lang="en">When was the composer of the opera Madama Butterfly born?</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?date 
WHERE {
	res:Madama_Butterfly text:"composer" ?x .
	?x dbo:birthDate ?date .
}</pseudoquery>
<answers>
<answer>1858-12-22</answer>
</answers>
</question>
<question aggregation="true" answertype="number" hybrid="true" id="67" onlydbo="true">
<string lang="en">How many Golden Globe awards did the husband of Katie Holmes win?</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX dbp: &lt;http://dbpedia.org/property/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT COUNT(DISTINCT ?awards)
WHERE {
	res:Katie_Holmes dbp:spouse ?uri .
 	?uri text:"win" ?award .
        ?award rdf:type text:"Golden Globe" .
}</pseudoquery>
<answers>
<answer>3</answer>
</answers>
</question>
<question aggregation="false" answertype="string" hybrid="true" id="71" onlydbo="true">
<string lang="en">Lost in Translation</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?string
WHERE {
        res:Francis_Ford_Coppola dbo:child ?x .
        ?x text:"receive Oscar for" ?string .
}</pseudoquery>
<answers>
<answer>Lost in Translation</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="73" onlydbo="true">
<string lang="en">Which anti-apartheid revolutionary was born in Mvezo?</string>
<pseudoquery> PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PREFIX res: &lt;http://dbpedia.org/resource/&gt; PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; SELECT DISTINCT ?uri WHERE {         ?uri text:"was a" text:"anti-apartheid revolutionary" .         ?uri dbo:birthPlace res:Mvezo . } </pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Nelson_Mandela</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="74" onlydbo="false">
<string lang="en">In which town was the man convicted of killing Martin Luther King born?</string>
<pseudoquery> PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PREFIX dbp: &lt;http://dbpedia.org/property/&gt; PREFIX res: &lt;http://dbpedia.org/resource/&gt; SELECT DISTINCT ?uri WHERE {         res:Martin_Luther_King,_Jr. text:"the man convicted of killing King" ?x .         ?x dbo:birthPlace ?uri .         ?uri dbp:districtType "Township"@en . } </pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Alton,_Illinois</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="75" onlydbo="false">
<string lang="en">Under which king did the British prime minister that had a reputation as a playboy serve?</string>
<pseudoquery> PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; PREFIX yago: &lt;http://dbpedia.org/class/yago/&gt; SELECT DISTINCT ?uri WHERE {         ?x rdf:type yago:PrimeMinistersOfTheUnitedKingdom .         ?x text:"reputation as a" text:"playboy" .         ?x dbo:monarch ?uri . } </pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/George_VI</answer>
</answers>
</question>
<question aggregation="false" answertype="date" hybrid="true" id="77" onlydbo="true">
<string lang="en">When was the the greatest composer of Italian opera after Verdi born?</string>
<pseudoquery>SELECT DISTINCT ?date WHERE { &lt;http:/dbpedia.org/resource/Madama_Butterfly&gt; text:"called" text:"the greatest composer of Italian opera after Verdi" . ?x &lt;http:/dbpedia.org/ontology/birthDate&gt; ?date . }</pseudoquery>
<answers>
<answer>1858-12-22</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="78" onlydbo="true">
<string lang="en">Who composed the music for the film that depicts the early life of Jane Austen?</string>
<pseudoquery> PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; SELECT DISTINCT ?uri WHERE {         ?x rdf:type dbo:Film .         ?x text:"depicts the early life of" text:"Jane Austen" .         ?x dbo:musicComposer ?uri . } </pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Adrian_Johnston</answer>
</answers>
</question>
<question aggregation="false" answertype="string" hybrid="true" id="81" onlydbo="true">
<string lang="en">Under which pseudonym did Charles Dickens write some of his books?</string>
<pseudoquery>SELECT DISTINCT ?string WHERE { ?x &lt;http://dbpedia.org/ontology/author&gt; &lt;http://dbpedia.org/resource/Charles_Dickens&gt; . ?x text:"writing under the pseudonym of" ?string . }</pseudoquery>
<answers>
<answer>Boz</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="84" onlydbo="true">
<string lang="en">List all the battles fought by the lover of Cleopatra.</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?uri 
WHERE {	
	?x text:"lover" text:"Cleopatra".	
	?x dbo:battle ?uri .		
}</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Battle_of_Pharsalus</answer>
<answer>http://dbpedia.org/resource/Final_War_of_the_Roman_Republic</answer>
<answer>http://dbpedia.org/resource/Battle_of_Philippi</answer>
<answer>http://dbpedia.org/resource/Caesar's_Civil_War</answer>
<answer>http://dbpedia.org/resource/Liberators'_civil_war</answer>
<answer>http://dbpedia.org/resource/Battle_of_Actium</answer>
<answer>http://dbpedia.org/resource/Antony's_Parthian_War</answer>
<answer>http://dbpedia.org/resource/Roman–Parthian_Wars</answer>
<answer>http://dbpedia.org/resource/Gallic_Wars</answer>
<answer>http://dbpedia.org/resource/Battle_of_Mutina</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="86" onlydbo="true">
<string lang="en">Which buildings owned by the crown overlook the North Sea?</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT ?uri 
WHERE {
        ?uri rdf:type dbo:Building.
        ?uri dbo:owner res:The_Crown . 
        ?uri text:"overlook" text:"North Sea" .
}</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Scarborough_Castle</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="88" onlydbo="true">
<string lang="en">Where was the "Father of Singapore" born?</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
SELECT DISTINCT ?uri 
WHERE {
        text:"Father of Singapore" dbo:birthPlace ?uri .
}</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Jamaica</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="90" onlydbo="true">
<string lang="en">What is the birth place of Hollywood's highest-paid actress?</string>
<pseudoquery>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?uri 
WHERE {
        ?x text:"is" text:"Hollywood's highest-paid actress" .
        ?x dbo:birthPlace ?uri .
}</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Los_Angeles</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="92" onlydbo="true">
<string lang="en">Who is the wife of the creator of the César Award?</string>
<pseudoquery>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia.org/resource/César_Award&gt; text:"created by" &lt;http://dbpedia.org/resource/Georges_Cravenne&gt; . &lt;http://dbpedia.org/resource/Georges_Cravenne&gt; &lt;http://dbpedia.org/ontology/spouse&gt; ?uri . }</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Françoise_Arnoul</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="97" onlydbo="true">
<string lang="en">In which city does the sports commentator know as Memory Man live?</string>
<pseudoquery>SELECT DISTINCT ?uri WHERE { ?x text:"is" text:"sports commentator" . ?x text:"known as" text:"Memory Man" . ?x &lt;http:/dbpedia.org/ontology/residence&gt; ?uri .</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Dublin</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="100" onlydbo="true">
<string lang="en">Who was vice president under the president who approved the use of atomic weapons against Japan during World War II?</string>
<pseudoquery> PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; SELECT DISTINCT ?uri WHERE { ?x text:"approved the use of" text:"atomic weapons against Japan" . ?x dbo:vicePresident ?uri . } </pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Alben_W._Barkley</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="true" id="101" onlydbo="false">
<string lang="en">What eating disorder is characterized by eating substances such as clay and sand?</string>
<pseudoquery>PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; 
PREFIX yago: &lt;http://dbpedia.org/class/yago/&gt;
SELECT ?uri WHERE
{
  ?uri rdf:type yago:EatingDisorders .
  ?uri text:"characterized by" "appetite for clay and sand" .
}</pseudoquery>
<answers>
<answer>http://dbpedia.org/resource/Pica_(disorder)</answer>
</answers>
</question>
