{
"dataset": {
"id": "hobbit-2-train-largescale"
},
"questions": [
{
"id": "92",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the mayor of Virar?",
"keywords": "mayor, Virar"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri ?string WHERE { res:Virar dbo:leaderName ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Kshitij_Thakur"
}
}
]
}
}
]
}
,
{
"id": "93",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the mayor of the capital of New Caledonia?",
"keywords": "mayor, capital, New Caledonia"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:New_Caledonia dbo:capital ?x . ?x dbo:mayor ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Sonia_Lagarde"
}
}
]
}
}
]
}
,
{
"id": "94",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the owner of Mazda?",
"keywords": "owner, Mazda"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Mazda dbo:owner ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Japan_Trustee_Services_Bank"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Ford_Motor_Company"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Sumitomo_Mitsui_Banking_Corporation"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/The_Master_Trust_Bank_of_Japan"
}
}
]
}
}
]
}
,
{
"id": "95",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the tallest player of Udinese Calcio?",
"keywords": "tallest, player, Udinese Calcio"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:team res:Udinese_Calcio . ?uri dbo:height ?h . } ORDER BY DESC(?h) OFFSET 0 LIMIT 1"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Željko_Brkić"
}
}
]
}
}
]
}
,
{
"id": "96",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who is the youngest Snooker player?",
"keywords": "youngest, Snooker player"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:SnookerPlayer . ?uri dbo:birthDate ?date . } ORDER BY DESC(?date) OFFSET 0 LIMIT 1"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Yan_Bingtao"
}
}
]
}
}
]
}
,
{
"id": "97",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who painted Unfinished portrait of General Bonaparte?",
"keywords": "painted, Unfinished portrait of General Bonaparte"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Unfinished_portrait_of_General_Bonaparte dbo:author ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Jacques-Louis_David"
}
}
]
}
}
]
}
,
{
"id": "98",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who produces Red Bull?",
"keywords": "produces, Red Bull"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri dbo:product res:Red_Bull . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Red_Bull_GmbH"
}
}
]
}
}
]
}
,
{
"id": "99",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who were the parents of Maria of Antioch?",
"keywords": "parents, Maria of Antioch"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Maria_of_Antioch dbo:parent ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Constance_of_Antioch"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Raymond_of_Poitiers"
}
}
]
}
}
]
}
,
{
"id": "100",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Who wrote the book Leave It to Psmith?",
"keywords": "wrote, book, Leave It to Psmith"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Leave_It_to_Psmith dbo:author ?uri . OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/P._G._Wodehouse"
}
}
]
}
}
]
}
]
}