{
  "dataset" : {
    "id" : "qald-7-train-hybrid"
  },
  "questions" : [ {
    "id" : "37",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : true,
    "question" : [ {
      "language" : "en",
      "string" : "List all the battles commanded by the lover of Cleopatra."
    } ],
    "query" : {
      "pseudo" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri \nWHERE { \n    ?x text:\"lover\" text:\"Cleopatra\".   \n    ?uri dbo:commander ?x .\n}"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Avaricum"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Alesia"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Siege_of_Uxellodunum"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_the_Axona"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Zela"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Siege_of_Massilia"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Gergovia"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Gallic_Wars"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Siege_of_Alexandria_(47_BC)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Thapsus"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Vosges_(58_BC)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Dyrrhachium_(48_BC)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Pharsalus"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Caesar's_invasions_of_Britain"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_the_Nile_(47_BC)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Caesar's_Civil_War"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Munda"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Bibracte"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_the_Sabis"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Ilerda"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_the_Arar"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Ruspina"
          }
        } ]
      }
    } ]
  }, {
    "id" : "39",
    "answertype" : "string",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : true,
    "question" : [ {
      "language" : "en",
      "string" : "Daniel Craig"
    } ],
    "query" : {
      "pseudo" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?string \nWHERE {\n        res:James_Bond dbo:lastAppearance ?x .\n        ?x text:\"feature as James Bond\" ?string .\n}"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "string" ]
      },
      "results" : {
        "bindings" : [ {
          "string" : {
            "type" : "literal",
            "value" : "Daniel Craig"
          }
        } ]
      }
    } ]
  }, {
    "id" : "55",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : true,
    "question" : [ {
      "language" : "en",
      "string" : "In which British territories was the \"Father of Singapore\" born?"
    } ],
    "query" : {
      "pseudo" : "SELECT DISTINCT ?uri WHERE { text:\"Father of modern Singapore\" <http://dbpedia.org/ontology/birthPlace> ?uri . ?uri rdf:type text:\"British territories\" . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Straits_Settlements"
          }
        } ]
      }
    } ]
  }, {
    "id" : "62",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : true,
    "question" : [ {
      "language" : "en",
      "string" : "Give me the currencies of all G8 countries."
    } ],
    "query" : {
      "pseudo" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nSELECT DISTINCT ?uri\nWHERE {\n        ?x text:\"member of\" text:\"G8\" . \n        ?x dbo:currency ?uri . \n}"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Euro_sign"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/United_States_dollar"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Japanese_yen"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Russian_ruble"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Canadian_dollar"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Pound_sterling"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Euro"
          }
        } ]
      }
    } ]
  }, {
    "id" : "71",
    "answertype" : "string",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : true,
    "question" : [ {
      "language" : "en",
      "string" : "Lost in Translation"
    } ],
    "query" : {
      "pseudo" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?string\nWHERE {\n        res:Francis_Ford_Coppola dbo:child ?x .\n        ?x text:\"receive Oscar for\" ?string .\n}"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "string" ]
      },
      "results" : {
        "bindings" : [ {
          "string" : {
            "type" : "literal",
            "value" : "Lost in Translation"
          }
        } ]
      }
    } ]
  }, {
    "id" : "84",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : true,
    "question" : [ {
      "language" : "en",
      "string" : "List all the battles fought by the lover of Cleopatra."
    } ],
    "query" : {
      "pseudo" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri \nWHERE {\t\n\t?x text:\"lover\" text:\"Cleopatra\".\t\n\t?x dbo:battle ?uri .\t\t\n}"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Pharsalus"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Final_War_of_the_Roman_Republic"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Philippi"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Caesar's_Civil_War"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Liberators'_civil_war"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Actium"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Antony's_Parthian_War"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Roman–Parthian_Wars"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Gallic_Wars"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_of_Mutina"
          }
        } ]
      }
    } ]
  }, {
    "id" : "88",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : true,
    "question" : [ {
      "language" : "en",
      "string" : "Where was the \"Father of Singapore\" born?"
    } ],
    "query" : {
      "pseudo" : "PREFIX dbo: <http://dbpedia.org/ontology/>\nSELECT DISTINCT ?uri \nWHERE {\n        text:\"Father of Singapore\" dbo:birthPlace ?uri .\n}"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jamaica"
          }
        } ]
      }
    } ]
  } ]
}