<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<dataset id="hobbit-2-train-largescale">
<question aggregation="false" answertype="resource" hybrid="false" id="6" onlydbo="false">
<string lang="en">Give me all Avant-garde jazz record labels.</string>
<keywords lang="en">Avant-garde jazz record labels</keywords>
<query>PREFIX  dbo:  &lt;http://dbpedia.org/ontology/&gt;
PREFIX  res:  &lt;http://dbpedia.org/resource/&gt;
PREFIX  rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX  rdf:  &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT DISTINCT  ?uri ?string
WHERE
  { ?uri  rdf:type   dbo:RecordLabel ;
          dbo:genre  res:Avant-garde_jazz
    OPTIONAL
      { ?uri  rdfs:label  ?string
        FILTER ( lang(?string) = "en" )
      }
  }
</query>
<answers>
<answer>http://dbpedia.org/resource/Cavity_Search_Records</answer>
<answer>http://dbpedia.org/resource/Black_Saint/Soul_Note</answer>
<answer>http://dbpedia.org/resource/Northern_Spy_Records</answer>
<answer>http://dbpedia.org/resource/AUM_Fidelity</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="7" onlydbo="false">
<string lang="en">Give me all books written by David Foster Wallace.</string>
<keywords lang="en">books, written, David Foster Wallace</keywords>
<query>PREFIX  dbo:  &lt;http://dbpedia.org/ontology/&gt;
PREFIX  res:  &lt;http://dbpedia.org/resource/&gt;
PREFIX  dbp:  &lt;http://dbpedia.org/property/&gt;
PREFIX  rdf:  &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT DISTINCT  ?uri
WHERE
  { ?uri  rdf:type    dbo:Book ;
          dbp:author  res:David_Foster_Wallace
  }
</query>
<answers>
<answer>http://dbpedia.org/resource/Brief_Interviews_with_Hideous_Men</answer>
<answer>http://dbpedia.org/resource/Everything_and_More_(book)</answer>
<answer>http://dbpedia.org/resource/The_Broom_of_the_System</answer>
<answer>http://dbpedia.org/resource/The_Pale_King</answer>
<answer>http://dbpedia.org/resource/This_Is_Water</answer>
<answer>http://dbpedia.org/resource/Both_Flesh_and_Not</answer>
<answer>http://dbpedia.org/resource/Infinite_Jest</answer>
<answer>http://dbpedia.org/resource/A_Supposedly_Fun_Thing_I&apos;ll_Never_Do_Again</answer>
<answer>http://dbpedia.org/resource/Signifying_Rappers</answer>
<answer>http://dbpedia.org/resource/Consider_the_Lobster</answer>
<answer>http://dbpedia.org/resource/Girl_with_Curious_Hair</answer>
<answer>http://dbpedia.org/resource/Oblivion:_Stories</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="10" onlydbo="false">
<string lang="en">Give me all inflows of the Lake Houston.</string>
<keywords lang="en">inflows, Lake Houston</keywords>
<query>PREFIX  dbo:  &lt;http://dbpedia.org/ontology/&gt;
SELECT DISTINCT  ?uri
WHERE
  { &lt;http://dbpedia.org/resource/Lake_Houston&gt;
              dbo:inflow  ?uri
  }
</query>
<answers>
<answer>http://dbpedia.org/resource/San_Jacinto_River_(Texas)</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="11" onlydbo="false">
<string lang="en">Give me all members of The Who.</string>
<keywords lang="en">members, The Who</keywords>
<query>PREFIX  dbo:  &lt;http://dbpedia.org/ontology/&gt;
PREFIX  res:  &lt;http://dbpedia.org/resource/&gt;
PREFIX  rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
SELECT DISTINCT  ?uri ?string
WHERE
  { res:The_Who  dbo:bandMember  ?uri
    OPTIONAL
      { ?uri  rdfs:label  ?string
        FILTER ( lang(?string) = "en" )
      }
  }
</query>
<answers>
<answer>http://dbpedia.org/resource/Pete_Townshend</answer>
<answer>http://dbpedia.org/resource/Roger_Daltrey</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="15" onlydbo="false">
<string lang="en">Give me the children of David Foster.</string>
<keywords lang="en">children, David Foster</keywords>
<query>PREFIX  dbo:  &lt;http://dbpedia.org/ontology/&gt;
PREFIX  res:  &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT  ?child
WHERE
  { res:David_Foster
              dbo:child  ?child
  }
</query>
<answers>
<answer>http://dbpedia.org/resource/Gigi_Hadid</answer>
<answer>http://dbpedia.org/resource/Brandon_&amp;_Leah</answer>
<answer>http://dbpedia.org/resource/Amy_S._Foster</answer>
<answer>http://dbpedia.org/resource/Sara_Michael_Foster</answer>
<answer>http://dbpedia.org/resource/Bella_Hadid</answer>
<answer>http://dbpedia.org/resource/Brody_Jenner</answer>
<answer>http://dbpedia.org/resource/Erin_Foster</answer>
</answers>
</question>
<question aggregation="false" answertype="string" hybrid="false" id="16" onlydbo="false">
<string lang="en">Give me the homepage of Metropolitan Home.</string>
<keywords lang="en">homepage, Metropolitan Home</keywords>
<query>PREFIX  res:  &lt;http://dbpedia.org/resource/&gt;
PREFIX  foaf: &lt;http://xmlns.com/foaf/0.1/&gt;
SELECT DISTINCT  ?string
WHERE
  { res:Metropolitan_Home
              foaf:homepage  ?string
  }
</query>
<answers>
<answer>http://www.pointclickhome.com/metropolitan_home</answer>
</answers>
</question>
<question aggregation="union" answertype="resource" hybrid="false" id="46" onlydbo="false">
<string lang="en">Show me everyone who was born on Boxing Day.</string>
<keywords lang="en">born, Boxing_Day</keywords>
<query>PREFIX  dbo:  &lt;http://dbpedia.org/ontology/&gt;
PREFIX  res:  &lt;http://dbpedia.org/resource/&gt;
PREFIX  dbp:  &lt;http://dbpedia.org/property/&gt;
PREFIX  rdf:  &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT DISTINCT  ?uri
WHERE
  { ?uri  rdf:type  dbo:Person
      { ?uri  dbo:birthDate  ?date }
    UNION
      { ?uri  dbp:birthDate  ?date }
    res:Boxing_Day
              dbp:date  ?date
  }
</query>
<answers>
<answer>http://dbpedia.org/resource/Michael_Ponikvar</answer>
<answer>http://dbpedia.org/resource/Shivam_Patil</answer>
<answer>http://dbpedia.org/resource/Hiro-x</answer>
<answer>http://dbpedia.org/resource/Jan_Halvarsson</answer>
<answer>http://dbpedia.org/resource/Lizz_Njagah</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" hybrid="false" id="87" onlydbo="false">
<string lang="en">Who founded Sony?</string>
<keywords lang="en">founded, Sony</keywords>
<query>PREFIX  dbo:  &lt;http://dbpedia.org/ontology/&gt;
PREFIX  res:  &lt;http://dbpedia.org/resource/&gt;
PREFIX  rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
SELECT DISTINCT  ?uri ?string
WHERE
  { res:Sony  dbo:foundedBy  ?uri
    OPTIONAL
      { ?uri  rdfs:label  ?string
        FILTER ( lang(?string) = "en" )
      }
  }
</query>
<answers>
<answer>http://dbpedia.org/resource/Akio_Morita</answer>
<answer>http://dbpedia.org/resource/Masaru_Ibuka</answer>
</answers>
</question>
