{
"dataset": {
"id": "hobbit-2-train-largescale"
},
"questions": [
{
"id": "1",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Did Robin Cook attend a university?",
"keywords": "Robin Cook, attend, university"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Robin_Cook dbo:almaMater ?x . ?x rdf:type dbo:University . }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "2",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Did Tony Fry influence Aristotle?",
"keywords": "Tony Fry, influence, Aristotle"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Aristotle dbo:influencedBy res:Tony_Fry . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "3",
"answertype": "boolean",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Does Por tu amor have more episodes than Game of Thrones?",
"keywords": "Por tu amor, more, episodes, Game of Thrones"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Por_tu_amor dbo:numberOfEpisodes ?x . res:Game_of_Thrones dbo:numberOfEpisodes ?y . FILTER (?x > ?y) }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "4",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Does the Alba River flow into a lake?",
"keywords": "Alba River, flow, lake"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { ?x dbo:inflow res:Alba_River . ?x rdf:type dbo:Lake . }"
},
"answers": [
{
"head": {
},
"boolean": false
}
]
}
,
{
"id": "5",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "From which region is the Refosco dal Peduncolo Rosso?",
"keywords": "region, Refosco dal Peduncolo Rosso"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { res:Refosco_dal_Peduncolo_Rosso dbo:wineRegion ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Slovenia"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Veneto"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Friuli-Venezia_Giulia"
}
}
]
}
}
]
}
,
{
"id": "6",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all Avant-garde jazz record labels.",
"keywords": "Avant-garde jazz record labels"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri rdf:type dbo:RecordLabel . ?uri dbo:genre res:Avant-garde_jazz . OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Cavity_Search_Records"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Black_Saint/Soul_Note"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Northern_Spy_Records"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/AUM_Fidelity"
}
}
]
}
}
]
}
,
{
"id": "7",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all books written by David Foster Wallace.",
"keywords": "books, written, David Foster Wallace"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book . ?uri dbp:author res:David_Foster_Wallace . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Brief_Interviews_with_Hideous_Men"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Everything_and_More_(book)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/The_Broom_of_the_System"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/The_Pale_King"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/This_Is_Water"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Both_Flesh_and_Not"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Infinite_Jest"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/A_Supposedly_Fun_Thing_I'll_Never_Do_Again"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Signifying_Rappers"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Consider_the_Lobster"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Girl_with_Curious_Hair"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Oblivion:_Stories"
}
}
]
}
}
]
}
,
{
"id": "8",
"answertype": "resource",
"aggregation": "union",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all cars that are produced in Netherlands.",
"keywords": "cars, produced, Netherlands"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Automobile . { ?uri dbo:assembly res:Netherlands . } UNION { ?uri dbp:assembly res:Netherlands . } UNION { { ?uri dbo:manufacturer ?x . } UNION { ?uri dbp:manufacturer ?x . } { ?x dbo:locationCountry res:Netherlands . } UNION { ?x dbo:location res:Netherlands . } } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/DAF_Daffodil"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Mitsubishi_Space_Star"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Smart_Forfour"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/DAF_44"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Austin_A40_Farina"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Ford_Cortina__Mark_II__1"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Ford_Cortina__Mark_I__1"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Ford_Cortina__TC_Mark_III__1"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Mitsubishi_Outlander__Second_generation__1"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Volvo_300_Series"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/DAF_XF"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Mini_Hatch"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/DAF_F218_series"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/DAF_F241_series"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Mitsubishi_Outlander"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Spyker_D8"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Spyker_B6"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Spyker_C12_Zagato"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Spyker_C8"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Saab_9-5"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Saab_9-3"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Spyker_E12"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Spyker_C12_La_Turbie"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Renault–Nissan_Common_Module_Family"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/DAF_33"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/DAF_MB200"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/DAF_SB220"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/VDL_SB200"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/VDL_SB120"
}
}
]
}
}
]
}
,
{
"id": "9",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all companies in Jena.",
"keywords": "companies, Jena"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri rdf:type dbo:Company . { ?uri dbo:location res:Jena . } UNION { ?uri dbo:headquarter res:Jena . } UNION { ?uri dbo:locationCity res:Jena . } OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Jenapharm"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Präzisionsteilefertigung_Steffen_Pfüller"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Jenoptik"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Analytik_Jena"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Intershop_Communications"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Carl_Zeiss_Meditec"
}
}
]
}
}
]
}
,
{
"id": "10",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all inflows of the Lake Houston.",
"keywords": "inflows, Lake Houston"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lake_Houston> dbo:inflow ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/San_Jacinto_River_(Texas)"
}
}
]
}
}
]
}
,
{
"id": "11",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all members of The Who.",
"keywords": "members, The Who"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:The_Who dbo:bandMember ?uri . OPTIONAL { ?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Pete_Townshend"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Roger_Daltrey"
}
}
]
}
}
]
}
,
{
"id": "13",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all soccer clubs in Qatar.",
"keywords": "soccer clubs, Qatar"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri rdf:type dbo:SoccerClub . { ?uri dbo:ground res:Qatar . } UNION { ?uri dbp:ground ?ground . FILTER (regex(?ground, 'Qatar')) } OPTIONAL {?uri rdfs:label ?string. FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al-Shahania_Sports_Club"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Muaither_SC"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al_Rayan_SC_Futsal_Team"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al_Sadd_Futsal_Team"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al-Khor_Sports_Club"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Umm_Salal_SC"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al-Rayan_SC"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al_Ahli_SC_(Doha)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al-Gharafa_Sports_Club"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al_Kharaitiyat_SC"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/El_Jaish_SC"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Lekhwiya_SC"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al_Sadd_SC"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al-Wakrah_Sport_Club"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al-Arabi_FC_(Qatar)_Reserves"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Al-Arabi_SC_(Qatar)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Qatar_SC"
}
}
]
}
}
]
}
,
{
"id": "14",
"answertype": "resource",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me all video games published by Black Isle Studios.",
"keywords": "video games, published, Black Isle Studios"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { ?uri rdf:type dbo:VideoGame . { ?uri dbp:publisher 'Black Isle Studios'@en . } UNION { ?uri dbo:publisher res:Black_Isle_Studios . } OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Lionheart:_Legacy_of_the_Crusader"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Baldur's_Gate_II:_Throne_of_Bhaal"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Baldur's_Gate"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Baldur's_Gate:_Dark_Alliance"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Baldur's_Gate:_Tales_of_the_Sword_Coast"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Baldur's_Gate_II:_Shadows_of_Amn"
}
}
]
}
}
]
}
,
{
"id": "15",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me the children of David Foster.",
"keywords": "children, David Foster"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?child WHERE { res:David_Foster dbo:child ?child . }"
},
"answers": [
{
"head": {
"vars": [
"child"
]
},
"results": {
"bindings": [
{
"child": {
"type": "uri",
"value": "http://dbpedia.org/resource/Gigi_Hadid"
}
},
{
"child": {
"type": "uri",
"value": "http://dbpedia.org/resource/Brandon_&_Leah"
}
},
{
"child": {
"type": "uri",
"value": "http://dbpedia.org/resource/Amy_S._Foster"
}
},
{
"child": {
"type": "uri",
"value": "http://dbpedia.org/resource/Sara_Michael_Foster"
}
},
{
"child": {
"type": "uri",
"value": "http://dbpedia.org/resource/Bella_Hadid"
}
},
{
"child": {
"type": "uri",
"value": "http://dbpedia.org/resource/Brody_Jenner"
}
},
{
"child": {
"type": "uri",
"value": "http://dbpedia.org/resource/Erin_Foster"
}
}
]
}
}
]
}
,
{
"id": "16",
"answertype": "string",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Give me the homepage of Metropolitan Home.",
"keywords": "homepage, Metropolitan Home"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX foaf: <http://xmlns.com/foaf/0.1/> SELECT DISTINCT ?string WHERE { res:Metropolitan_Home foaf:homepage ?string . }"
},
"answers": [
{
"head": {
"vars": [
"string"
]
},
"results": {
"bindings": [
{
"string": {
"type": "literal",
"value": "http://www.pointclickhome.com/metropolitan_home"
}
}
]
}
}
]
}
,
{
"id": "17",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How big is the Mammoth Pool Reservoir?",
"keywords": "big, Mammoth Pool Reservoir"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> SELECT ?area WHERE { <http://dbpedia.org/resource/Mammoth_Pool_Reservoir> dbo:areaTotal ?area . }"
},
"answers": [
{
"head": {
"vars": [
"area"
]
},
"results": {
"bindings": [
{
"area": {
"type": "literal",
"value": "4.45154e+06"
}
}
]
}
}
]
}
,
{
"id": "18",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How deep is Steinsee?",
"keywords": "deep, Steinsee"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Steinsee> dbo:maximumDepth ?n . }"
},
"answers": [
{
"head": {
"vars": [
"n"
]
},
"results": {
"bindings": [
{
"n": {
"type": "literal",
"value": "19.0"
}
}
]
}
}
]
}
,
{
"id": "19",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How high is the Doe Hill Mountain?",
"keywords": "high, Doe Hill Mountain"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:Doe_Hill_Mountain dbo:elevation ?num. }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "1229.87"
}
}
]
}
}
]
}
,
{
"id": "20",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How high is the Volcano Mountain?",
"keywords": "high, Volcano Mountain"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:Volcano_Mountain dbo:elevation ?num. }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "1239.0"
}
}
]
}
}
]
}
,
{
"id": "21",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How high is the Landegode Lighthouse?",
"keywords": "high, Landegode Lighthouse"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?num WHERE { res:Landegode_Lighthouse dbo:height ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "29.0"
}
}
]
}
}
]
}
,
{
"id": "22",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many employees does Staedtler have?",
"keywords": "many, employees, Staedtler"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?number WHERE { res:Staedtler dbo:numberOfEmployees ?number . }"
},
"answers": [
{
"head": {
"vars": [
"number"
]
},
"results": {
"bindings": [
{
"number": {
"type": "literal",
"value": "3000"
}
}
]
}
}
]
}
,
{
"id": "23",
"answertype": "number",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many ethnic groups live in Spain?",
"keywords": "ethnic groups, live, Spain"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?count) WHERE { res:Spain dbo:ethnicGroup ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"count"
]
},
"results": {
"bindings": [
{
"count": {
"type": "literal",
"value": "1"
}
}
]
}
}
]
}
,
{
"id": "24",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many inhabitants does Nagamangala have?",
"keywords": "inhabitants, Nagamangala"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:Nagamangala dbo:populationTotal ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "17776"
}
}
]
}
}
]
}
,
{
"id": "25",
"answertype": "number",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many museums does Sofia have?",
"keywords": "museums, Sofia"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT (COUNT(DISTINCT ?uri) AS ?count) WHERE { ?uri rdf:type dbo:Museum . ?uri dbo:location res:Sofia . }"
},
"answers": [
{
"head": {
"vars": [
"count"
]
},
"results": {
"bindings": [
{
"count": {
"type": "literal",
"value": "4"
}
}
]
}
}
]
}
,
{
"id": "26",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many pages does The Man with the Red Tattoo have?",
"keywords": "pages, The Man with the Red Tattoo"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?n WHERE { res:The_Man_with_the_Red_Tattoo dbo:numberOfPages ?n . }"
},
"answers": [
{
"head": {
"vars": [
"n"
]
},
"results": {
"bindings": [
{
"n": {
"type": "literal",
"value": "320"
}
}
]
}
}
]
}
,
{
"id": "27",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many people live in the capital of Togo?",
"keywords": "people, live, capital, Togo "
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:Togo dbo:capital ?x . ?x dbo:populationTotal ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "837437"
}
}
]
}
}
]
}
,
{
"id": "28",
"answertype": "number",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many politicians graduated from Stanford University?",
"keywords": "politicians, graduated, Stanford University"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT (COUNT(DISTINCT ?uri) AS ?count) WHERE { ?uri dbo:profession res:Politician . ?uri dbo:almaMater res:Stanford_University . }"
},
"answers": [
{
"head": {
"vars": [
"count"
]
},
"results": {
"bindings": [
{
"count": {
"type": "literal",
"value": "11"
}
}
]
}
}
]
}
,
{
"id": "29",
"answertype": "number",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many scientists graduated from Washburn University?",
"keywords": "scientists, graduated, Washburn University"
}
],
"query":{
"sparql": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?count) WHERE { ?uri rdf:type dbo:Scientist . ?uri dbo:almaMater res:Washburn_University . }"
},
"answers": [
{
"head": {
"vars": [
"count"
]
},
"results": {
"bindings": [
{
"count": {
"type": "literal",
"value": "2"
}
}
]
}
}
]
}
,
{
"id": "30",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How many students does the Texas Tech University have?",
"keywords": "students, Texas Tech University"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:Texas_Tech_University dbo:numberOfStudents ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "35893"
}
}
]
}
}
]
}
,
{
"id": "31",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How much did Vanilla Sky cost?",
"keywords": "Vanilla Sky, cost"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?n WHERE { res:Vanilla_Sky dbo:budget ?n . }"
},
"answers": [
{
"head": {
"vars": [
"n"
]
},
"results": {
"bindings": [
{
"n": {
"type": "literal",
"value": "6.8E7"
}
}
]
}
}
]
}
,
{
"id": "32",
"answertype": "number",
"aggregation": "true",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How often did Teresa Mo marry?",
"keywords": "Teresa Mo, marry"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?count) WHERE { res:Teresa_Mo dbo:spouse ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"count"
]
},
"results": {
"bindings": [
{
"count": {
"type": "literal",
"value": "1"
}
}
]
}
}
]
}
,
{
"id": "33",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How tall is John Windsor?",
"keywords": "tall, John Windsor"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?num WHERE { res:John_Windsor dbo:height ?num . }"
},
"answers": [
{
"head": {
"vars": [
"num"
]
},
"results": {
"bindings": [
{
"num": {
"type": "literal",
"value": "2.032"
}
}
]
}
}
]
}
,
{
"id": "34",
"answertype": "number",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "How tall is Kate Upton?",
"keywords": "tall, Kate Upton"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?height WHERE { res:Kate_Upton dbo:height ?height . }"
},
"answers": [
{
"head": {
"vars": [
"height"
]
},
"results": {
"bindings": [
{
"height": {
"type": "literal",
"value": "1.778"
}
}
]
}
}
]
}
,
{
"id": "35",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "In which country is Solaize located?",
"keywords": "country, Solaize, located"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { res:Solaize dbo:country ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/France"
}
}
]
}
}
]
}
,
{
"id": "36",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "In which country is the Tasman Lake?",
"keywords": "country, Tasman Lake"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Tasman_Lake dbo:country ?uri . }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/New_Zealand"
}
}
]
}
}
]
}
,
{
"id": "37",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "In which country is the Tiefer See?",
"keywords": "country, Tiefer See"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:Tiefer_See dbo:country ?uri . OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Germany"
}
}
]
}
}
]
}
,
{
"id": "38",
"answertype": "resource",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "In which programming language is QuickTime written?",
"keywords": "programming language, QuickTime, written"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?string WHERE { res:QuickTime dbo:programmingLanguage ?uri . OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } }"
},
"answers": [
{
"head": {
"vars": [
"uri"
]
},
"results": {
"bindings": [
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/C_(programming_language)"
}
},
{
"uri": {
"type": "uri",
"value": "http://dbpedia.org/resource/Objective-C"
}
}
]
}
}
]
}
,
{
"id": "39",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is Campari a beverage?",
"keywords": "Campari, beverage"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Campari rdf:type dbo:Beverage . }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "40",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is Lisa Guerrero a model?",
"keywords": "Lisa Guerrero, model"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Lisa_Guerrero rdf:type dbo:Model . }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "41",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is Sol Tax a scientist?",
"keywords": "Sol Tax, scientist"
}
],
"query":{
"sparql": "PREFIX res: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Sol_Tax rdf:type dbo:Scientist . }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
,
{
"id": "42",
"answertype": "boolean",
"aggregation": "false",
"onlydbo": "false",
"hybrid": "false",
"question": [
{
"language": "en",
"string": "Is Joe Biden a democrat?",
"keywords": "Joe Biden, democrat"
}
],
"query":{
"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Joe_Biden dbo:party <http://dbpedia.org/resource/Democratic_Party_(United_States)> . }"
},
"answers": [
{
"head": {
},
"boolean": true
}
]
}
]
}