<?xml version="1.0" ?>
<dataset id="qald-4_biomedical_train">

<question id="12">
<string lang="en"><![CDATA[What is the target drug of Vidarabine?]]></string>
<query><![CDATA[
SELECT DISTINCT ?v0 
WHERE { 
        <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00194> <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugbank/target> ?v0. 
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/874</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/509</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/3683</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/4104</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/4105</uri>
</answer>
</answers>
</question>

<question id="23">
<string lang="en"><![CDATA[Which are targets of Hydroxocobalamin?]]></string>
<query><![CDATA[
SELECT DISTINCT ?x 
WHERE {
        <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00200> <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugbank/target> ?x.
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/265</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/354</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/376</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/398</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/507</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/840</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/854</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/1224</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/3916</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/809</uri>
</answer>
</answers>
</question>

<question id="10">
<string lang="en"><![CDATA[Which foods does allopurinol interact with?]]></string>
<query><![CDATA[
SELECT DISTINCT ?l0 
WHERE { 
        <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00437> <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugbank/foodInteraction> ?l0. 
}]]></query>
<answers>
<answer>
<string><![CDATA[Avoid alcohol.]]></string>
</answer>
<answer>
<string><![CDATA[Take with food.]]></string>
</answer>
<answer>
<string><![CDATA[Take with a full glass of water.]]></string>
</answer>
</answers>
</question>

<question id="21">
<string lang="en"><![CDATA[Which diseases are associated with the gene FOXP2?]]></string>
<query><![CDATA[
SELECT DISTINCT ?x
WHERE {
        ?x <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/associatedGene> <http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/FOXP2>.
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/1076</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/3924</uri>
</answer>
</answers>
</question>

<question id="5">
<string lang="en"><![CDATA[Which genes are associated with breast cancer?]]></string>
<query><![CDATA[
SELECT DISTINCT ?x
WHERE { 
        <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/1669> <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/associatedGene> ?x. 
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/BRCA1</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/PSCP</uri>
</answer>
</answers>
</question>

<question id="22">
<string lang="en"><![CDATA[Which are possible drugs for diseases associated with the gene ALD?]]></string>
<query><![CDATA[
SELECT DISTINCT ?x 
WHERE {
        ?s <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/associatedGene> <http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/ALD>. 
        ?s <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/possibleDrug> ?x.
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00115</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00200</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/379</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/708</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/2538</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/3056</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/4022</uri>
</answer>
</answers>
</question>

<question id="14">
<string lang="en"><![CDATA[Give me drug references of drugs targeting Prothrombin.]]></string>
<query><![CDATA[
SELECT DISTINCT ?v0
WHERE { 
        <http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/3579> <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugbank/drugReference> ?v0. 
        ?v1 <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugbank/target> <http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/3579>. 
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/references/17016423</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/references/17139284</uri>
</answer>
</answers>
</question>

<question id="8">
<string lang="en"><![CDATA[Which drugs interact with allopurinol?]]></string>
<query><![CDATA[
SELECT DISTINCT ?x 
WHERE { 
        ?x <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugbank/interactionDrug1> <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00437>. 
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drug_interactions/DB00437_DB01418</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drug_interactions/DB00437_DB01125</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drug_interactions/DB00437_DB00993</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drug_interactions/DB00437_DB00091</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drug_interactions/DB00437_DB00266</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drug_interactions/DB00437_DB01033</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drug_interactions/DB00437_DB00682</uri>
</answer>
</answers>
</question>

<question id="17">
<string lang="en"><![CDATA[Which are possible drugs against rickets?]]></string>
<query><![CDATA[
SELECT DISTINCT ?x 
WHERE {
        <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/1004> <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/possibleDrug> ?x.
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00136</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00146</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00153</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00169</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00910</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB01070</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB02300</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB03451</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB04258</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB04796</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/193</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/419</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/758</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/985</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/1769</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/2974</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/3515</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/3752</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/dailymed/resource/drugs/3940</uri>
</answer>
</answers>
</question>

<question id="25">
<string lang="en"><![CDATA[Which genes are associated with diseases whose possible drugs target Cubilin?]]></string>
<query><![CDATA[
SELECT DISTINCT ?z 
WHERE {
        ?s <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/associatedGene> ?z. 
        ?s <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/possibleDrug> ?x. 
        ?x <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugbank/target> <http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/1224>.
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/MMAB</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/MUT</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/MMAA</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/MTHFD1</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/MTR</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/MTRR</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/CUBN</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/AMN</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/TCN2</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/ABCD1</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/ALD</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/IFCR</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/MGA1</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/MCM</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/TC2</uri>
</answer>
</answers>
</question>

<question id="2">
<string lang="en"><![CDATA[What are the diseases caused by Valdecoxib?]]></string>
<query><![CDATA[
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?x
WHERE {
        ?v1 rdfs:label ?l.
        FILTER(REGEX(?l,'Valdecoxib','i')).
        ?v2 <http://www.w3.org/2002/07/owl#sameAs> ?v1.
        ?v2 <http://www4.wiwiss.fu-berlin.de/sider/resource/sider/sideEffect> ?x.
        ?x a ?c.
        ?c <http://www.w3.org/2002/07/owl#sameAs> <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/diseases>.
}]]></query>
<answers/>
</question>

<question id="13">
<string lang="en"><![CDATA[Which drugs target Multidrug resistance protein 1?]]></string>
<query><![CDATA[
SELECT DISTINCT ?v1 
WHERE { 
        ?v1 a <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugbank/drugs>. 
        ?v1 <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugbank/target> <http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/1588>. 
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00619</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00875</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB01136</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00802</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00622</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00908</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB01182</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00171</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB01232</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00975</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00675</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB01196</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB01169</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB01394</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB01103</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00243</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00570</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00091</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00694</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00778</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB01045</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB01072</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB01167</uri>
</answer>
</answers>
</question>

<question id="1">
<string lang="en"><![CDATA[Which diseases is Cetuximab used for?]]></string>
<query><![CDATA[
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?v
WHERE {
        ?x rdfs:label ?l.
        FILTER(REGEX(?l,'Cetuximab','i')).
        ?x ?p ?v.
        ?v a <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/diseases>.
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/698</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/833</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/181</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/701</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/32</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/602</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/845</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/1173</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/1325</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/1693</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/1694</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/1696</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/2789</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/3004</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/3020</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/3365</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/3391</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/4136</uri>
</answer>
</answers>
</question>

<question id="7">
<string lang="en"><![CDATA[Give me diseases treated by tetracycline]]></string>
<query><![CDATA[
SELECT DISTINCT ?x 
WHERE { 
        ?x a <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/diseases>. 
        ?x <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/possibleDrug> <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00759>. 
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/529</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/287</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/2808</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/613</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/442</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/953</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/2035</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/2449</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/2642</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/3645</uri>
</answer>
</answers>
</question>

<question id="11">
<string lang="en"><![CDATA[What are enzymes of drugs used for anemia?]]></string>
<query><![CDATA[
SELECT DISTINCT ?v1 
WHERE { 
        ?v0 <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugbank/enzyme> ?v1. 
        ?x <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/possibleDrug> ?v0.
        ?x rdfs:label ?l.
        FILTER(REGEX(?l,'Anemia','i')). 
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/enzymes/1</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/enzymes/2</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/enzymes/3</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/enzymes/4</uri>
</answer>
</answers>
</question>

<question id="15">
<string lang="en"><![CDATA[Which genes are associated with diseases treated with Cetuximab?]]></string>
<query><![CDATA[
SELECT DISTINCT ?v1 
WHERE { 
        ?v0 a <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/diseases>. 
        ?v0 <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/associatedGene> ?v1. 
        ?v0 <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/possibleDrug> <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugs/DB00002>. 
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/FCGR2A</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/GFI1</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/FCGR3A</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/ELA2</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/WAS</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/C9</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/C1QA</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/C6</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/C4A</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/C1S</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/C1QB</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/C1QG</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/C2</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/IF</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/C3</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/C4B</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/C7</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/C8B</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/MSH2</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/ATM</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/MAD1L1</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/RAD54B</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/RAP1GDS1</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/SH2D1A</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/FCGR2B</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/BCL10</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/RAD54L</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/BCL8</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/PARK2</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/EGFR</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/BRAF</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/ERBB2</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/FCGR1A</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/IRF1</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/OAS1</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/IGFR1</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/CD64</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/IGFR2</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/CD32</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/CD16</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/IGFR3</uri>
</answer>
</answers>
</question>

<question id="24">
<string lang="en"><![CDATA[Which are targets for possible drugs for diseases associated with the gene ALD?]]></string>
<query><![CDATA[
SELECT DISTINCT ?z
WHERE {
        ?s <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/associatedGene> <http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/ALD>. 
        ?s <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/possibleDrug> ?x. 
        ?x <http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugbank/target> ?z.
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/265</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/354</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/376</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/398</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/507</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/840</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/854</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/1224</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/2679</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/2695</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/3916</uri>
</answer>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/drugbank/resource/targets/809</uri>
</answer>
</answers>
</question>

<question id="19">
<string lang="en"><![CDATA[Which are the drugs whose side effects are associated with the gene TRPM6?]]></string>
<query><![CDATA[
SELECT DISTINCT ?x 
WHERE {
        ?x <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/associatedGene> <http://www4.wiwiss.fu-berlin.de/diseasome/resource/genes/TRPM6>. 
        ?x owl:sameAs ?k. 
        ?l <http://www4.wiwiss.fu-berlin.de/sider/resource/sider/sideEffect> ?k . 
}]]></query>
<answers>
<answer>
<uri>http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/584</uri>
</answer>
</answers>
</question>

</dataset>
