<?xml version="1.0" ?>
<dataset id="qald-4_multilingual_train">
<question aggregation="false" answertype="resource" id="144" onlydbo="true">
<string lang="en"><![CDATA[Which cities does the Weser flow through?]]></string>
<string lang="de"><![CDATA[Durch welche Städte fließt die Weser?]]></string>
<string lang="es"><![CDATA[¿Por qué ciudades pasa el río Weser?]]></string>
<string lang="it"><![CDATA[Attraverso quali città scorre il fiume Weser?]]></string>
<string lang="fr"><![CDATA[Quels sont les villes traversées par la Weser?]]></string>
<string lang="nl"><![CDATA[Door welke steden loopt de Weser?]]></string>
<string lang="ro"><![CDATA[Ce orașe străbate Weserul?]]></string>
<keywords lang="en"><![CDATA[Weser, flow through, city]]></keywords>
<keywords lang="de"><![CDATA[Weser, fließen, Stadt]]></keywords>
<keywords lang="es"><![CDATA[cuidad, pasa, Weser]]></keywords>
<keywords lang="it"><![CDATA[città, scorrere, fiume Weser]]></keywords>
<keywords lang="fr"><![CDATA[villes, traverser, Weser]]></keywords>
<keywords lang="nl"><![CDATA[stad, loopt door, Weser]]></keywords>
<keywords lang="ro"><![CDATA[Weser, străbate, oraș]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Weser dbo:city ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Kassel</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Hamelin</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Minden</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Fulda_(river)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bremen</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bremerhaven</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Hann._M%C3%BCnden</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="49" onlydbo="false">
<string lang="en"><![CDATA[Give me all companies in the advertising industry.]]></string>
<string lang="de"><![CDATA[Gib mir alle Unternehmen, die in der Werbebranche tätig sind.]]></string>
<string lang="es"><![CDATA[Dame todas las empresas publicitarias.]]></string>
<string lang="it"><![CDATA[Dammi tutte le aziende pubblicitarie.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les agences de publicité.]]></string>
<string lang="nl"><![CDATA[Noem alle bedrijven die in de reclamebranche actief zijn.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate companiile din industria publicitară.]]></string>
<keywords lang="en"><![CDATA[company, advertising industry]]></keywords>
<keywords lang="de"><![CDATA[Unternehmen, Werbebranche]]></keywords>
<keywords lang="es"><![CDATA[empresas publicitarias]]></keywords>
<keywords lang="it"><![CDATA[aziende pubblicitarie]]></keywords>
<keywords lang="fr"><![CDATA[agences de publicité]]></keywords>
<keywords lang="nl"><![CDATA[bedrijf, reclamebranche]]></keywords>
<keywords lang="ro"><![CDATA[companii, industria publicitară]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?uri)
WHERE { 
        ?uri rdf:type dbo:Company  .
        ?uri dbp:industry ?industry . 
        FILTER regex(?industry,'advertising','i') . 
}]]></query>
<answers>
<answer>
<number>346</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="128" onlydbo="true">
<string lang="en"><![CDATA[Give me all movies directed by Francis Ford Coppola.]]></string>
<string lang="de"><![CDATA[Gib mir alle Filme, bei denen Francis Ford Coppola Regie geführt hat.]]></string>
<string lang="es"><![CDATA[Dame todas las películas que haya dirigido Francis Ford Coppola.]]></string>
<string lang="it"><![CDATA[Dammi tutti i film diretti da Francis Ford Coppola.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les films dont Francis réalisés par Francis Ford Coppola.]]></string>
<string lang="nl"><![CDATA[Geef alle films die werden geregisseerd door Francis Ford Coppola.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate filmele regizate de Francis Ford Coppola.]]></string>
<keywords lang="en"><![CDATA[movie, direct, Francis Ford Coppola]]></keywords>
<keywords lang="de"><![CDATA[Film, Regie, Francis Ford Coppola]]></keywords>
<keywords lang="es"><![CDATA[película, director, Francis Ford Coppola]]></keywords>
<keywords lang="it"><![CDATA[film, dirigere, Francis Ford Coppola]]></keywords>
<keywords lang="fr"><![CDATA[film, directeur, Francis Ford Coppola]]></keywords>
<keywords lang="nl"><![CDATA[films, regisseur, Francis Ford Coppola]]></keywords>
<keywords lang="ro"><![CDATA[film, regizat, Francis Ford Coppola]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Film . 
        ?uri dbo:director res:Francis_Ford_Coppola . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/The_Conversation</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Godfather_Part_II</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Godfather_Part_III</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Rainmaker_(1997_film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Peggy_Sue_Got_Married</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Cotton_Club_(film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bram_Stoker's_Dracula</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rumble_Fish</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jack_(1996_film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/New_York_Stories</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tucker:_The_Man_and_His_Dream</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/You're_a_Big_Boy_Now</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Godfather_Saga</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Apocalypse_Now_Redux</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Godfather</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/One_from_the_Heart</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Outsiders_(film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Dementia_13</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Bellboy_and_the_Playgirls</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Battle_Beyond_the_Sun</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Rain_People</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Youth_Without_Youth_(film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gardens_of_Stone</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tetro</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Godfather_Trilogy</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Apocalypse_Now</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Twixt_(film)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="102" onlydbo="true">
<string lang="en"><![CDATA[Who was John F. Kennedy's vice president?]]></string>
<string lang="de"><![CDATA[Wer war der Vizepräsident unter John F. Kennedy?]]></string>
<string lang="es"><![CDATA[¿Quién fué el vicepresidente de John F. Kennedy?]]></string>
<string lang="it"><![CDATA[Chi fu il vicepresidente di John F. Kennedy?]]></string>
<string lang="fr"><![CDATA[Qui était le vice-président de John F. Kennedy?]]></string>
<string lang="nl"><![CDATA[Wie was de vicepresident onder John F. Kennedy?]]></string>
<string lang="ro"><![CDATA[Cine a fost vicepreședintele lui John F. Kennedy?]]></string>
<keywords lang="en"><![CDATA[John F. Kennedy, vice president]]></keywords>
<keywords lang="de"><![CDATA[John F. Kennedy, Vizepräsident]]></keywords>
<keywords lang="es"><![CDATA[John F. Kennedy, vicepresidente]]></keywords>
<keywords lang="it"><![CDATA[John F. Kennedy, vicepresidente]]></keywords>
<keywords lang="fr"><![CDATA[John F. Kennedy, vice-président]]></keywords>
<keywords lang="nl"><![CDATA[John F. Kennedy, vicepresident]]></keywords>
<keywords lang="ro"><![CDATA[John F. Kennedy, vicepreședinte]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { res:John_F._Kennedy dbo:vicePresident ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Lyndon_B._Johnson</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="90" onlydbo="true">
<string lang="en"><![CDATA[When was Capcom founded?]]></string>
<string lang="de"><![CDATA[Wann wurde Capcom gegründet?]]></string>
<string lang="es"><![CDATA[¿Cúando se fundó Capcom?]]></string>
<string lang="it"><![CDATA[Quando è stata fondata Capcom?]]></string>
<string lang="fr"><![CDATA[Quand a été fondé Capcom?]]></string>
<string lang="nl"><![CDATA[Wanneer werd Capcom opgericht?]]></string>
<string lang="ro"><![CDATA[Când a fost fondat Capcom?]]></string>
<keywords lang="en"><![CDATA[Capcom, founded]]></keywords>
<keywords lang="de"><![CDATA[Capcom, gründen]]></keywords>
<keywords lang="es"><![CDATA[Capcom, fundada]]></keywords>
<keywords lang="it"><![CDATA[Capcom, fondata]]></keywords>
<keywords lang="fr"><![CDATA[fondé, Capcom]]></keywords>
<keywords lang="nl"><![CDATA[Capcom, opgericht]]></keywords>
<keywords lang="ro"><![CDATA[Capcom, fondat]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE {
        res:Capcom dbo:foundingDate ?date .
}]]></query>
<answers>
<answer>
<date>1983-06-11</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="47" onlydbo="true">
<string lang="en"><![CDATA[What is the highest place of the Urals?]]></string>
<string lang="de"><![CDATA[Was ist die höhchste Stelle des Ural?]]></string>
<string lang="es"><![CDATA[¿Cuál es el punto más alto del montes Urales?]]></string>
<string lang="it"><![CDATA[Qual è il punto più alto del Uràli?]]></string>
<string lang="fr"><![CDATA[Quel est l'endroit le plus haut d'Oural?]]></string>
<string lang="nl"><![CDATA[Wat is het hoogste punt van de Oeral?]]></string>
<string lang="ro"><![CDATA[Care este cel mai înalt punct de pe munții Urali?]]></string>
<keywords lang="en"><![CDATA[Urals, highest place]]></keywords>
<keywords lang="de"><![CDATA[Ural, höchste Stelle]]></keywords>
<keywords lang="es"><![CDATA[los montes Urales, punto más alto]]></keywords>
<keywords lang="it"><![CDATA[Uràli, punto più alto]]></keywords>
<keywords lang="fr"><![CDATA[l'Oural, endroit le plus haut]]></keywords>
<keywords lang="nl"><![CDATA[Oeral, hoogste punt]]></keywords>
<keywords lang="ro"><![CDATA[munții Urali, cel mai înalt punct]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {       
        res:Ural_Mountains dbo:highestPlace ?uri .  
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Mount_Narodnaya</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="89" onlydbo="true">
<string lang="en"><![CDATA[Give me all soccer clubs in the Premier League.]]></string>
<string lang="de"><![CDATA[Gib mir alle Vereine in der Premier League.]]></string>
<string lang="es"><![CDATA[Dame todos los clubs de la Premier League.]]></string>
<string lang="it"><![CDATA[Dammi tutti i club calcistici nella Premier League.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les équipes de la Premier League.]]></string>
<string lang="nl"><![CDATA[Noem alle clubs uit de Premier League.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate cluburile de fotbal din Premier League]]></string>
<keywords lang="en"><![CDATA[Premier League, soccer club]]></keywords>
<keywords lang="de"><![CDATA[Premier League, Verein]]></keywords>
<keywords lang="es"><![CDATA[Premier League, club]]></keywords>
<keywords lang="it"><![CDATA[Premier League, club calcistici]]></keywords>
<keywords lang="fr"><![CDATA[équipes, Premier League]]></keywords>
<keywords lang="nl"><![CDATA[club, Premier League]]></keywords>
<keywords lang="ro"><![CDATA[Premier League, club de fotbal]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:SoccerClub .
        ?uri dbo:league res:Premier_League . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Arsenal_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Chelsea_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Fulham_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Liverpool_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Manchester_United_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/West_Bromwich_Albion_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Aston_Villa_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/West_Ham_United_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Newcastle_United_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tottenham_Hotspur_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Southampton_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Queens_Park_Rangers_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Everton_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Manchester_City_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Reading_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sunderland_A.F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Stoke_City_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Norwich_City_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Wigan_Athletic_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Swansea_City_A.F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/History_of_Blackburn_Rovers_F.C.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Melchester_Rovers</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="38" onlydbo="true">
<string lang="en"><![CDATA[Which monarchs were married to a German?]]></string>
<string lang="de"><![CDATA[Welche Monarchen waren mit jemand deutschem verheiratet?]]></string>
<string lang="es"><![CDATA[¿Qué monárcas estaban casados con una persona alemana?]]></string>
<string lang="it"><![CDATA[Quali monarchi erano sposati con persone tedesche?]]></string>
<string lang="fr"><![CDATA[Quels monarques ont épousé une personne allemande?]]></string>
<string lang="nl"><![CDATA[Welke monarchen waren getrouwd met een Duitser?]]></string>
<string lang="ro"><![CDATA[Ce monarhi au fost căsătoriți cu o persoană germană?]]></string>
<keywords lang="en"><![CDATA[monarch, married, German]]></keywords>
<keywords lang="de"><![CDATA[Monarch, verheiratet, deutsch]]></keywords>
<keywords lang="es"><![CDATA[monarcha, casado, alemán]]></keywords>
<keywords lang="it"><![CDATA[monarca, sposato, tedesco]]></keywords>
<keywords lang="fr"><![CDATA[monarques, épousé, allemand]]></keywords>
<keywords lang="nl"><![CDATA[monarch, getrouwd, Duitser]]></keywords>
<keywords lang="ro"><![CDATA[monarh, căsătorit, german]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Monarch . 
        ?uri dbo:spouse ?spouse .
      { ?spouse dbo:birthPlace res:Germany. }
      UNION 
      { ?spouse dbo:birthPlace ?p . 
        ?p dbo:country res:Germany. }
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Ottokar_I_of_Bohemia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/W%C5%82adys%C5%82aw_I_Herman</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Boles%C5%82aw_III_Wrymouth</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="50" onlydbo="true">
<string lang="en"><![CDATA[What did Bruce Carver die from?]]></string>
<string lang="de"><![CDATA[Woran ist Bruce Carver gestorben?]]></string>
<string lang="es"><![CDATA[¿De qué murió Bruce Carver?]]></string>
<string lang="it"><![CDATA[Di cosa è morto Bruce Carver?]]></string>
<string lang="fr"><![CDATA[Quel est la cause de décès de Bruce Carver?]]></string>
<string lang="nl"><![CDATA[Waaraan overleed Bruce Carver?]]></string>
<string lang="ro"><![CDATA[Din ce cauză a murit Bruce Carver?]]></string>
<keywords lang="en"><![CDATA[Bruce Carver, die]]></keywords>
<keywords lang="de"><![CDATA[Bruce Carver, gestorben an]]></keywords>
<keywords lang="es"><![CDATA[Bruce Caver, muerte]]></keywords>
<keywords lang="it"><![CDATA[Bruce Caver, morire]]></keywords>
<keywords lang="fr"><![CDATA[cause de décès, Bruce Carver]]></keywords>
<keywords lang="nl"><![CDATA[Bruce Carver, gestorven aan]]></keywords>
<keywords lang="ro"><![CDATA[Bruce Carver, muri]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri
WHERE {
        res:Bruce_Carver dbo:deathCause ?uri .     
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Cancer</uri>
</answer>
</answers>
</question>
</dataset>
