<?xml version="1.0" ?>
<dataset id="qald-4_multilingual_train">
<question aggregation="false" answertype="resource" id="146" onlydbo="true">
<string lang="en"><![CDATA[Which professional surfers were born in Australia?]]></string>
<string lang="de"><![CDATA[Welche Profisurfer wurden in Australien geboren?]]></string>
<string lang="es"><![CDATA[¿Qué surfistas profesionales nacieron en Australia?]]></string>
<string lang="it"><![CDATA[Quali surfisti professionisti sono nati in Australia?]]></string>
<string lang="fr"><![CDATA[Quels surfeurs professionels sont nés en Australie?]]></string>
<string lang="nl"><![CDATA[Welke professionele surfers werden geboren in Australië?]]></string>
<string lang="ro"><![CDATA[Ce surferi profesioniști s-au născut în Australia?]]></string>
<keywords lang="en"><![CDATA[professional surfer, born, Australia]]></keywords>
<keywords lang="de"><![CDATA[Profisurfer, geboren, Australien]]></keywords>
<keywords lang="es"><![CDATA[surfista profesional, nacido, Australia]]></keywords>
<keywords lang="it"><![CDATA[surfista professionista, nato, Australia]]></keywords>
<keywords lang="fr"><![CDATA[surfeurs professionels, Australie]]></keywords>
<keywords lang="nl"><![CDATA[professionele surfer, Australië]]></keywords>
<keywords lang="ro"><![CDATA[surfer profesionist, născut, Australia]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:occupation res:Surfing .  
        ?uri dbo:birthPlace res:Australia . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Midget_Farrelly</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ian_Cairns</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="48" onlydbo="true">
<string lang="en"><![CDATA[Who is the editor of Forbes?]]></string>
<string lang="de"><![CDATA[Wer ist der Herausgeber von Forbes?]]></string>
<string lang="es"><![CDATA[¿Quién es el editor de Forbes?]]></string>
<string lang="it"><![CDATA[Chi è l'editore di Forbes?]]></string>
<string lang="fr"><![CDATA[Qui est le rédacteur en chef de Forbes?]]></string>
<string lang="nl"><![CDATA[Wie is de uitgever van Forbes.]]></string>
<string lang="ro"><![CDATA[Cine este editorul Forbes?]]></string>
<keywords lang="en"><![CDATA[Forbes, editor]]></keywords>
<keywords lang="de"><![CDATA[Forbes, Herausgeber]]></keywords>
<keywords lang="es"><![CDATA[Forbes, editor]]></keywords>
<keywords lang="it"><![CDATA[Forbes, editore]]></keywords>
<keywords lang="fr"><![CDATA[Forbes, rédacteur en chef]]></keywords>
<keywords lang="nl"><![CDATA[Forbes, uitgever]]></keywords>
<keywords lang="ro"><![CDATA[Forbes, editor]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
        res:Forbes dbo:editor ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Steve_Forbes</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="63" onlydbo="true">
<string lang="en"><![CDATA[Give me all actors starring in Last Action Hero.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.]]></string>
<string lang="es"><![CDATA[Dame todos los actores que hayan actuado en Last Action Hero.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli attori che hanno recitato in Last Action Hero.]]></string>
<string lang="fr"><![CDATA[Noem alle acteurs uit de film Last Action Hero.]]></string>
<string lang="nl"><![CDATA[Noem alle acteurs uit de film Last Action Hero.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți actorii cu roluri principale în Last Action Hero.]]></string>
<keywords lang="en"><![CDATA[actor, starring, Last Action Hero]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, mitspielen, Last Action Hero]]></keywords>
<keywords lang="es"><![CDATA[actores, Last Action Hero]]></keywords>
<keywords lang="it"><![CDATA[attori, Last Action Hero]]></keywords>
<keywords lang="fr"><![CDATA[acteurs, Last Action Hero]]></keywords>
<keywords lang="nl"><![CDATA[acteur, Last Action Hero]]></keywords>
<keywords lang="ro"><![CDATA[actor, rol principal, Last Action Hero]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Last_Action_Hero dbo:starring ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Arnold_Schwarzenegger</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Anthony_Quinn</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Art_Carney</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/F._Murray_Abraham</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Austin_O'Brien</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tom_Noonan</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bridgette_Wilson</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Charles_Dance</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Robert_Prosky</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="82" onlydbo="true">
<string lang="en"><![CDATA[In which programming language is GIMP written?]]></string>
<string lang="de"><![CDATA[In welcher Programmiersprache wurde GIMP geschrieben?]]></string>
<string lang="es"><![CDATA[¿En qué lenguaje de programación esta programado GIMP?]]></string>
<string lang="it"><![CDATA[In quale linguaggio di programmazione è scritto GIMP?]]></string>
<string lang="fr"><![CDATA[En quel langage de programmation a été écrit GIMP?]]></string>
<string lang="nl"><![CDATA[In welke programmeertaal is GIMP geschreven?]]></string>
<string lang="ro"><![CDATA[În ce limbaj de programare este scris GIMP?]]></string>
<keywords lang="en"><![CDATA[GIMP, programming language]]></keywords>
<keywords lang="de"><![CDATA[GIMP, Programmiersprache]]></keywords>
<keywords lang="es"><![CDATA[GIMP, lenguaje de programación]]></keywords>
<keywords lang="it"><![CDATA[GIMP, linguaggio di programmazione]]></keywords>
<keywords lang="fr"><![CDATA[langage de programmation, GIMP]]></keywords>
<keywords lang="nl"><![CDATA[GIMP, programmeertaal]]></keywords>
<keywords lang="ro"><![CDATA[GIMP, limbaj de programare]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        res:GIMP dbo:programmingLanguage ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/C_(programming_language)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/GTK+</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="22" onlydbo="true">
<string lang="en"><![CDATA[In which country is the Limerick Lake?]]></string>
<string lang="de"><![CDATA[In welchem Land befindet sich der Limerick Lake?]]></string>
<string lang="es"><![CDATA[¿En qué país se encuentra el lago Limerick?]]></string>
<string lang="it"><![CDATA[In quale stato si trova il lago Limerick?]]></string>
<string lang="fr"><![CDATA[Dans quel pays se trouve le lac Limerick?]]></string>
<string lang="nl"><![CDATA[In welk land ligt Limerick Lake?]]></string>
<string lang="ro"><![CDATA[În ce țară este lacul Limerick?]]></string>
<keywords lang="en"><![CDATA[Limerick Lake, country]]></keywords>
<keywords lang="de"><![CDATA[Limerick Lake, Land]]></keywords>
<keywords lang="es"><![CDATA[lago Limerick, país]]></keywords>
<keywords lang="it"><![CDATA[lago Limerick, stato]]></keywords>
<keywords lang="fr"><![CDATA[pays, lac Limerick]]></keywords>
<keywords lang="nl"><![CDATA[Limerick Lake, land]]></keywords>
<keywords lang="ro"><![CDATA[lacul Limerick, țară]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        res:Limerick_Lake dbo:country ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Canada</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="113" onlydbo="true">
<string lang="en"><![CDATA[Who is the youngest player in the Premier League?]]></string>
<string lang="de"><![CDATA[Wer ist der jüngste Spieler in der Premier League?]]></string>
<string lang="es"><![CDATA[¿Quién es el jugador más jóven de la Premier League?]]></string>
<string lang="it"><![CDATA[Chi è il giocatore più giovane della Premier League?]]></string>
<string lang="fr"><![CDATA[Quel est le joueur le plus jeune de la Premier League?]]></string>
<string lang="nl"><![CDATA[Wie is de jongste speler in de Premier League?]]></string>
<string lang="ro"><![CDATA[Cine este cel mai tânăr jucător din Premier League?]]></string>
<keywords lang="en"><![CDATA[player, Premier League, youngest]]></keywords>
<keywords lang="de"><![CDATA[Spieler, Premier League, jüngste]]></keywords>
<keywords lang="es"><![CDATA[jugador, más jóven, Premier League]]></keywords>
<keywords lang="it"><![CDATA[giocatore, Premier League, più giovane]]></keywords>
<keywords lang="fr"><![CDATA[joueur, Premier League, plus jeune]]></keywords>
<keywords lang="nl"><![CDATA[speler, jongste, Premier League]]></keywords>
<keywords lang="ro"><![CDATA[juător, Premier League, cel mai tânăr]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:team ?x . 
        ?x dbo:league res:Premier_League . 
        ?uri dbo:birthDate ?y . 
} ORDER BY DESC(?y) 
OFFSET 0 LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Marlon_Fernandez_(Footballer_born_2001)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="71" onlydbo="false">
<string lang="en"><![CDATA[Give me all video games published by Mean Hamster Software.]]></string>
<string lang="de"><![CDATA[Gib mir alle Videospiele von Mean Hamster Software.]]></string>
<string lang="es"><![CDATA[Dame todos los videojuegos de Mean Hamster Software.]]></string>
<string lang="it"><![CDATA[Dammi tutti i videogiochi di Mean Hamster Software.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les jeux vidéos publiés par Mean Hamster Software.]]></string>
<string lang="nl"><![CDATA[Geef me alle videogames van Mean Hamster Software.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate jocurile video publicate de Mean Hamster Software]]></string>
<keywords lang="en"><![CDATA[video game, publish, Mean Hamster Software]]></keywords>
<keywords lang="de"><![CDATA[Videospiel, Mean Hamster Software]]></keywords>
<keywords lang="es"><![CDATA[videojuego, Mean Hamster Software]]></keywords>
<keywords lang="it"><![CDATA[videogioco, prodotto, Mean Hamster Software]]></keywords>
<keywords lang="fr"><![CDATA[jeux vidéos, publiés, Mean Hamster Software]]></keywords>
<keywords lang="nl"><![CDATA[videogame, Mean Hamster Software]]></keywords>
<keywords lang="ro"><![CDATA[joc video, publicat, Mean Hamster Software]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
      ?uri rdf:type dbo:VideoGame .
      ?uri dbo:publisher res:Mean_Hamster_Software . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Myst</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Riven</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Crossbow_(video_game)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="83" onlydbo="true">
<string lang="en"><![CDATA[Who produced films starring Natalie Portman?]]></string>
<string lang="de"><![CDATA[Wer produzierte Filme, in denen Natalie Portman mitspielt?]]></string>
<string lang="es"><![CDATA[¿Quién ha producido películas en las que actua Natalie Portman?]]></string>
<string lang="it"><![CDATA[Chi ha prodotto i film in cui recita Natalie Portman?]]></string>
<string lang="fr"><![CDATA[Qui a produit des films dans lesquels joue Natalie Portman?]]></string>
<string lang="nl"><![CDATA[Wie produceerde films waarin Natalie Portman speelde?]]></string>
<string lang="ro"><![CDATA[Cine a produs filme cu Natalie Portman în rol principal?]]></string>
<keywords lang="en"><![CDATA[produce, film, starring, Natalie Portman]]></keywords>
<keywords lang="de"><![CDATA[produzieren, Film, mitspielen, Natalie Portman]]></keywords>
<keywords lang="es"><![CDATA[producente, perlículas, actua, Natalie Portman]]></keywords>
<keywords lang="it"><![CDATA[produttore, film, recita, Natalie Portman]]></keywords>
<keywords lang="fr"><![CDATA[produit, films, Natalie Portman]]></keywords>
<keywords lang="nl"><![CDATA[producent, film, Natalie Portman, speelt]]></keywords>
<keywords lang="ro"><![CDATA[produce, film, rol principal, Natalie Portman]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?film rdf:type dbo:Film .
        ?film dbo:starring res:Natalie_Portman .
        ?film dbo:producer ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Patrice_Ledoux</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Robert_Greenhut</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Laurence_Mark</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Carmen_Finestra</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gerrit_Folsom</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/David_McFadzean</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rick_McCallum</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gary_Gilbert</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mike_Nichols</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/John_Calley</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Cary_Brokaw</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/San_Francisco_Ballet</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Nicolas_Blanc</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Laurent_Truchot</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Michael_Tapuah</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Saul_Zaentz</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Richard_N._Gladstein</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Wong_Kar-wai</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Alison_Owen</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Doug_Magallon,_Greg_Strom</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kevin_Feige</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Michael_De_Luca</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sigurj%C3%B3n_Sighvatsson</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ryan_Kavanaugh</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Michael_DeLuca</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Natalie_Portman</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Marc_E._Platt</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Dan_Bucatinsky</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Danny_McBride</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Scott_Stuber</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Danny_McBride_(actor)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Spencer_Susser</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ivan_Reitman</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="85" onlydbo="true">
<string lang="en"><![CDATA[In which films did Julia Roberts as well as Richard Gere play?]]></string>
<string lang="de"><![CDATA[In welchen Filmen spielen sowohl Julia Roberts als auch Richard Gere mit?]]></string>
<string lang="es"><![CDATA[¿En qué películas actúan Julia Roberts y Richard Gere?]]></string>
<string lang="it"><![CDATA[In quali film recitano sia Julia Roberts che Richard Gere?]]></string>
<string lang="fr"><![CDATA[Dans quels films jouent Julia Roberts et Richard Gere?]]></string>
<string lang="nl"><![CDATA[In welke films speelden zowel Julia Roberts als Richard Gere?]]></string>
<string lang="ro"><![CDATA[În ce filme joacă Julia Roberts precum și Richard Gere?]]></string>
<keywords lang="en"><![CDATA[film, play, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="de"><![CDATA[Film, mitspielen, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="es"><![CDATA[película, actores, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="it"><![CDATA[film, recitare, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="fr"><![CDATA[films, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="nl"><![CDATA[film, speel, Julia Roberts, Richard Gere]]></keywords>
<keywords lang="ro"><![CDATA[film, joacă, Julia Roberts, Richard Gere]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:starring res:Julia_Roberts .
        ?uri dbo:starring res:Richard_Gere.
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Pretty_Woman</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Runaway_Bride_(1999_film)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="93" onlydbo="true">
<string lang="en"><![CDATA[Was Natalie Portman born in the United States?]]></string>
<string lang="de"><![CDATA[Wurde Natalie Portman in den Vereinigten Staaten geboren?]]></string>
<string lang="es"><![CDATA[¿Nació Natalie Portman en los estados unidos de américa?]]></string>
<string lang="it"><![CDATA[Natalie Portman è nata negli Stati Uniti?]]></string>
<string lang="fr"><![CDATA[Natalie Portman est-elle née aux Etats-Unis?]]></string>
<string lang="nl"><![CDATA[Werd Natalie Portman geboren in de Verenigde Staten?]]></string>
<string lang="ro"><![CDATA[A fost Natalie Portman născută în Statele Unite?]]></string>
<keywords lang="en"><![CDATA[Natalie Portman, born, United States]]></keywords>
<keywords lang="de"><![CDATA[Natalie Portman, geboren, Vereinigte Staaten]]></keywords>
<keywords lang="es"><![CDATA[Natalie Portman]]></keywords>
<keywords lang="it"><![CDATA[Natalie Portman, nata, Stati Uniti]]></keywords>
<keywords lang="fr"><![CDATA[Natalie Portman, née, Etats-Unis]]></keywords>
<keywords lang="nl"><![CDATA[Natalie Portman, geboren, Verenigde Staten]]></keywords>
<keywords lang="ro"><![CDATA[Natalie Portman, născută, Statele Unite]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE { 
        res:Natalie_Portman dbo:birthPlace ?city .
        ?city dbo:country res:United_States .
}]]></query>
<answers>
<answer>
<boolean>False</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="number" id="88" onlydbo="true">
<string lang="en"><![CDATA[How many films did Leonardo DiCaprio star in?]]></string>
<string lang="de"><![CDATA[In wievielen Filmen hat Leonardo DiCaprio mitgespielt?]]></string>
<string lang="es"><![CDATA[¿En cuántas películas ha actuado Leonardo DiCaprio?]]></string>
<string lang="it"><![CDATA[In quanti film ha recitato Leonardo DiCaprio?]]></string>
<string lang="fr"><![CDATA[Dans combien de films Leonard DiCaprio a-t-il joué?]]></string>
<string lang="nl"><![CDATA[In hoeveel films speelde Leonardo DiCaprio?]]></string>
<string lang="ro"><![CDATA[În câte filme a jucat Leonardo DiCaprio rol principal?]]></string>
<keywords lang="en"><![CDATA[film, star, Leonardo DiCaprio]]></keywords>
<keywords lang="de"><![CDATA[Film, mitspielen, Leonardo DiCaprio]]></keywords>
<keywords lang="es"><![CDATA[películas, cuántas, actúa, Leonardo DiCaprio]]></keywords>
<keywords lang="it"><![CDATA[film, recitare, Leonardo DiCaprio]]></keywords>
<keywords lang="fr"><![CDATA[combien, films, Leonard DiCaprio]]></keywords>
<keywords lang="nl"><![CDATA[film, speelt, Leonardo DiCaprio]]></keywords>
<keywords lang="ro"><![CDATA[film, rol principal, Leonardo DiCaprio]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?uri) 
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:starring res:Leonardo_DiCaprio . 
}]]></query>
<answers>
<answer>
<number>23</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="197" onlydbo="false">
<string lang="en"><![CDATA[Who painted The Storm on the Sea of Galilee?]]></string>
<string lang="de"><![CDATA[Wer malte Christus im Sturm auf dem See von Galilea?]]></string>
<string lang="es"><![CDATA[¿Quién pintó el Cristo en la tormenta en el lago de Galilea?]]></string>
<string lang="it"><![CDATA[Chi dipinse il Cristo nella tempesta sul mare di Galilea?]]></string>
<string lang="fr"><![CDATA[Qui a peint Christ dans la tempête sur la mer de Galilée?]]></string>
<string lang="nl"><![CDATA[Wie schilderde Christus in de storm op het meer van Galilea?]]></string>
<string lang="ro"><![CDATA[Cine a pictat Furtuna pe Marea Galileii?]]></string>
<keywords lang="en"><![CDATA[The Storm on the Sea of Galilee, paint]]></keywords>
<keywords lang="de"><![CDATA[Christus im Sturm auf dem See von Galilea, malen]]></keywords>
<keywords lang="es"><![CDATA[Cristo en la tormenta en el lago de Galilea, pintor]]></keywords>
<keywords lang="it"><![CDATA[Cristo nella tempesta sul mare di Galilea, pittore]]></keywords>
<keywords lang="fr"><![CDATA[peintre, Christ dans la tempête sur la mer de Galilée]]></keywords>
<keywords lang="nl"><![CDATA[schilder, Christus in de storm op het meer van Galilea]]></keywords>
<keywords lang="ro"><![CDATA[Furtuna pe Marea Galileii, picta]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:The_Storm_on_the_Sea_of_Galilee dbo:author ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Rembrandt</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="2" onlydbo="true">
<string lang="en"><![CDATA[Give me the birthdays of all actors of the television show Charmed.]]></string>
<string lang="de"><![CDATA[Gib mir die Geburtstage von allen Darstellern der Fernsehserie Charmed.]]></string>
<string lang="es"><![CDATA[Dame los cumpleaños de los actores de la serie de televisión Charmed.]]></string>
<string lang="it"><![CDATA[Dammi le date dei compleanni di tutti gli attori della serie televisiva Charmed.]]></string>
<string lang="fr"><![CDATA[Donnes-moi les dates de naissance des acteurs de la série télévisée Charmed.]]></string>
<string lang="nl"><![CDATA[Noem de verjaardag van alle acteurs uit de televisieserie Charmed.]]></string>
<string lang="ro"><![CDATA[Dă-mi zilele de naștere a tuturor actorilor din serialul de televiziune Charmed]]></string>
<keywords lang="en"><![CDATA[television show, Charmed, actor, birthday]]></keywords>
<keywords lang="de"><![CDATA[Fernsehserie, Charmed, Darsteller, Geburtstag]]></keywords>
<keywords lang="es"><![CDATA[serie televisiva, Charmed, actores, cumpleaños]]></keywords>
<keywords lang="it"><![CDATA[serie televisiva, Charmed, attore, compleanno]]></keywords>
<keywords lang="fr"><![CDATA[série télévisée, Charmed, acteurs, date de naissance]]></keywords>
<keywords lang="nl"><![CDATA[verjaardag, acteur, televisieserie, Charmed]]></keywords>
<keywords lang="ro"><![CDATA[serial de televiziune, Charmed, actor, zi de naștere]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE { 
        res:Charmed dbo:starring ?actor .
        ?actor dbo:birthDate ?date .
}]]></query>
<answers>
<answer>
<date>1968-07-27</date>
</answer>
<answer>
<date>1973-12-03</date>
</answer>
<answer>
<date>1972-12-19</date>
</answer>
<answer>
<date>1985-11-30</date>
</answer>
<answer>
<date>1969-02-01</date>
</answer>
<answer>
<date>1969-02-08</date>
</answer>
<answer>
<date>1971-01-26</date>
</answer>
<answer>
<date>1973-09-05</date>
</answer>
<answer>
<date>1971-04-12</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="6" onlydbo="true">
<string lang="en"><![CDATA[In which city did John F. Kennedy die?]]></string>
<string lang="de"><![CDATA[In welcher Stadt ist John F. Kennedy gestorben?]]></string>
<string lang="es"><![CDATA[¿En qué ciudad murió John F. Kennedy?]]></string>
<string lang="it"><![CDATA[In quale città morì John F. Kennedy?]]></string>
<string lang="fr"><![CDATA[Dans quelle ville est mort John F. Kennedy?]]></string>
<string lang="nl"><![CDATA[In welke stad kwam John F. Kennedy om het leven?]]></string>
<string lang="ro"><![CDATA[În ce oraș a murit John F. Kennedy?]]></string>
<keywords lang="en"><![CDATA[city, John F. Kennedy, die]]></keywords>
<keywords lang="de"><![CDATA[Stadt, John F. Kennedy, gestorben]]></keywords>
<keywords lang="es"><![CDATA[cuidad, John F. Kennedy, murió]]></keywords>
<keywords lang="it"><![CDATA[città, John F. Kennedy, morto]]></keywords>
<keywords lang="fr"><![CDATA[ville, John F. Kennedy]]></keywords>
<keywords lang="nl"><![CDATA[stad, John F. Kennedy, gestorven]]></keywords>
<keywords lang="ro"><![CDATA[oraș, John F. Kennedy, muri]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE { 
        res:John_F._Kennedy dbo:deathPlace ?uri .
        ?uri rdf:type dbo:City .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Dallas</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="58" onlydbo="true">
<string lang="en"><![CDATA[Who produced the most films?]]></string>
<string lang="de"><![CDATA[Wer hat die meisten Filme produziert?]]></string>
<string lang="es"><![CDATA[¿Quién ha producido más películas?]]></string>
<string lang="it"><![CDATA[Chi ha prodotto più film?]]></string>
<string lang="fr"><![CDATA[Qui a produit le plus de films?]]></string>
<string lang="nl"><![CDATA[Wie produceerde de meeste films?]]></string>
<string lang="ro"><![CDATA[Cine a produs cele mai multe filme?]]></string>
<keywords lang="en"><![CDATA[film, produced, most]]></keywords>
<keywords lang="de"><![CDATA[Film, produzieren, die meisten]]></keywords>
<keywords lang="es"><![CDATA[películas, producido más]]></keywords>
<keywords lang="it"><![CDATA[film, prodotto, più]]></keywords>
<keywords lang="fr"><![CDATA[films, le plus de]]></keywords>
<keywords lang="nl"><![CDATA[producent, films, de meeste]]></keywords>
<keywords lang="ro"><![CDATA[film, produs, cel mai mult]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?film rdf:type dbo:Film .
        ?film dbo:producer ?uri .
} 
ORDER BY DESC(COUNT(?film)) 
OFFSET 0 LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Hal_Roach</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="193" onlydbo="false">
<string lang="en"><![CDATA[Which movies did Kurosawa direct after Rashomon?]]></string>
<string lang="de"><![CDATA[Welche Filme hat Kurosawa nach Rashomon gedreht?]]></string>
<string lang="es"><![CDATA[¿Qué películas ha rodado Kurosawa después de Rashomon?]]></string>
<string lang="it"><![CDATA[Che film ha diretto Kurosawa dopo Rashomon?]]></string>
<string lang="fr"><![CDATA[Quels films ont été realisés par Kurosawa après Rashomon?]]></string>
<string lang="nl"><![CDATA[Welke films heeft Kurosawa geregisseerd na Rashomon?]]></string>
<string lang="ro"><![CDATA[Ce filme a regizat Kurosawa după Rashomon?]]></string>
<keywords lang="en"><![CDATA[film, direct, Kurosawa, after, Rashomon]]></keywords>
<keywords lang="de"><![CDATA[Film, drehen, Kurosawa, nach, Rashomon]]></keywords>
<keywords lang="es"><![CDATA[película, rodada, Kurosawa, después de Rashomon?]]></keywords>
<keywords lang="it"><![CDATA[film, dirigere, Kurosawa, dopo Rashomon]]></keywords>
<keywords lang="fr"><![CDATA[films, Kurosawa, après Rashomon]]></keywords>
<keywords lang="nl"><![CDATA[film, Kurosawa, regisseur, na Rashomon]]></keywords>
<keywords lang="ro"><![CDATA[film, regiza, Kurosawa, după, Rashomon]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:director res:Akira_Kurosawa .
      { ?uri dbo:releaseDate ?x . } 
      UNION 
      { ?uri dbp:released ?x . }
        res:Rashomon dbo:releaseDate ?y .
        FILTER (?y > ?x)
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Rashomon</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Quiet_Duel</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Idiot_(1951_film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Most_Beautiful</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/No_Regrets_for_Our_Youth</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/One_Wonderful_Sunday</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Scandal_(1950_film)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="60" onlydbo="true">
<string lang="en"><![CDATA[Is there a video game called Battle Chess?]]></string>
<string lang="de"><![CDATA[Gibt es ein Videospiel, das Battle Chess heißt?]]></string>
<string lang="es"><![CDATA[¿Hay algún videojuego que se llame Battle Chess?]]></string>
<string lang="it"><![CDATA[Esiste un videogioco che si chiama Battle Chess?]]></string>
<string lang="fr"><![CDATA[Existe-t-il un jeu vidéo appelé Battle Chess?]]></string>
<string lang="nl"><![CDATA[Bestaat er een videospel met de naam Battle Chess?]]></string>
<string lang="ro"><![CDATA[Există un joc video numit Battle Chess?]]></string>
<keywords lang="en"><![CDATA[video game, Battle Chess]]></keywords>
<keywords lang="de"><![CDATA[Videospiel, Battle Chess]]></keywords>
<keywords lang="es"><![CDATA[videojuego, Battle Chess]]></keywords>
<keywords lang="it"><![CDATA[videogioco, Battle Chess]]></keywords>
<keywords lang="fr"><![CDATA[jeu vidéo, Battle Chess]]></keywords>
<keywords lang="nl"><![CDATA[videospel, Battle Chess]]></keywords>
<keywords lang="ro"><![CDATA[joc video, Battle Chess]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
ASK 
WHERE {
        ?uri rdf:type dbo:VideoGame .
        ?uri rdfs:label 'Battle Chess'@en .
}]]></query>
<answers>
<answer>
<boolean>True</boolean>
</answer>
</answers>
</question>
