<?xml version="1.0" ?>
<dataset id="qald-4_multilingual_train">
<question aggregation="false" answertype="number" id="138" onlydbo="true">
<string lang="en"><![CDATA[How many inhabitants does Maribor have?]]></string>
<string lang="de"><![CDATA[Wieviele Einwohner hat Maribor?]]></string>
<string lang="es"><![CDATA[¿Cuántos habitantes tiene Maribor?]]></string>
<string lang="it"><![CDATA[Quanti abitanti ha Maribor?]]></string>
<string lang="fr"><![CDATA[Combien d'habitants a Maribor?]]></string>
<string lang="nl"><![CDATA[Hoeveel inwoners heeft Maribor?]]></string>
<string lang="ro"><![CDATA[Câți locuitori are Maribor?]]></string>
<keywords lang="en"><![CDATA[Maribor, inhabitants]]></keywords>
<keywords lang="de"><![CDATA[Maribor, Einwohner]]></keywords>
<keywords lang="es"><![CDATA[Maribor, habitantes]]></keywords>
<keywords lang="it"><![CDATA[Maribor, abitanti]]></keywords>
<keywords lang="fr"><![CDATA[nombre d'habitants, Maribor]]></keywords>
<keywords lang="nl"><![CDATA[Maribor, inwoners]]></keywords>
<keywords lang="ro"><![CDATA[Maribor, locuitori]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?num 
WHERE { 
        res:Maribor dbo:populationTotal ?num . 
}]]></query>
<answers>
<answer>
<number>94984</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="12" onlydbo="true">
<string lang="en"><![CDATA[Is proinsulin a protein?]]></string>
<string lang="de"><![CDATA[Ist Proinsulin ein Protein?]]></string>
<string lang="es"><![CDATA[¿La proinsulina es una proteina?]]></string>
<string lang="it"><![CDATA[La proinsulina è una proteina?]]></string>
<string lang="fr"><![CDATA[La pro-insuline est-elle une protéine?]]></string>
<string lang="nl"><![CDATA[Is proinsuline een proteïne?]]></string>
<string lang="ro"><![CDATA[Este proinsulina o proteină?]]></string>
<keywords lang="en"><![CDATA[proinsulin, protein]]></keywords>
<keywords lang="de"><![CDATA[Proinsulin, Protein]]></keywords>
<keywords lang="es"><![CDATA[proinsulina, protein]]></keywords>
<keywords lang="it"><![CDATA[proinsulina, proteina]]></keywords>
<keywords lang="fr"><![CDATA[pro-insuline, protéine]]></keywords>
<keywords lang="nl"><![CDATA[proinsuline, proteïne]]></keywords>
<keywords lang="ro"><![CDATA[proinsulină, proteină]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
ASK 
WHERE { 
        res:Proinsulin rdf:type dbo:Protein . 
}]]></query>
<answers>
<answer>
<boolean>True</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="29" onlydbo="false">
<string lang="en"><![CDATA[Which awards did WikiLeaks win?]]></string>
<string lang="de"><![CDATA[Welche Preise hat WikiLeaks gewonnen?]]></string>
<string lang="es"><![CDATA[¿Qué premios ha ganado WikiLeaks?]]></string>
<string lang="it"><![CDATA[Quali premi ha vinto WikiLeaks?]]></string>
<string lang="fr"><![CDATA[Quels prix ont été gagnés par Wikileaks?]]></string>
<string lang="nl"><![CDATA[Welke prijzen heeft WikiLeaks gewonnen?]]></string>
<string lang="ro"><![CDATA[Ce premii a câștigat WikiLeaks?]]></string>
<keywords lang="en"><![CDATA[WikiLeaks, award]]></keywords>
<keywords lang="de"><![CDATA[WikiLeaks, Preise]]></keywords>
<keywords lang="es"><![CDATA[Wikileaks, premios]]></keywords>
<keywords lang="it"><![CDATA[WikiLeaks, premio]]></keywords>
<keywords lang="fr"><![CDATA[prix, WikiLeaks]]></keywords>
<keywords lang="nl"><![CDATA[prijs, Wikileaks]]></keywords>
<keywords lang="ro"><![CDATA[WikiLeaks, premii]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri
WHERE {
        res:WikiLeaks dbp:awards ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Index_on_Censorship</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Amnesty_International_UK_Media_Awards</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sam_Adams_Award</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="81" onlydbo="false">
<string lang="en"><![CDATA[Which country has the most official languages?]]></string>
<string lang="de"><![CDATA[Welches Land hat die meisten Amtssprachen?]]></string>
<string lang="es"><![CDATA[¿Qué país tiene más idiomas oficiales?]]></string>
<string lang="it"><![CDATA[Quale stato ha più lingue ufficiali?]]></string>
<string lang="fr"><![CDATA[Quels pays a le plus de langues officielles?]]></string>
<string lang="nl"><![CDATA[Welk land heeft de meeste officiële talen.]]></string>
<string lang="ro"><![CDATA[Ce țară are cele mai multe limbi oficiale?]]></string>
<keywords lang="en"><![CDATA[country, official language, most]]></keywords>
<keywords lang="de"><![CDATA[Land, Amtssprache, die meisten]]></keywords>
<keywords lang="es"><![CDATA[país, idiomas oficiales, más]]></keywords>
<keywords lang="it"><![CDATA[stato, lingue ufficiali, più]]></keywords>
<keywords lang="fr"><![CDATA[pays, plus de langues officielles]]></keywords>
<keywords lang="nl"><![CDATA[land, officiële taal, meeste]]></keywords>
<keywords lang="ro"><![CDATA[șară, limbă oficială, cele mai multe]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Country  .
        ?uri dbp:officialLanguages ?language .
} 
ORDER BY DESC(COUNT(?language)) 
OFFSET 0 LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Basque_Country_(greater_region)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="28" onlydbo="false">
<string lang="en"><![CDATA[Give me all communist countries.]]></string>
<string lang="de"><![CDATA[Gib mir alle kommunistischen Länder.]]></string>
<string lang="es"><![CDATA[Dame todos los países comunistas.]]></string>
<string lang="it"><![CDATA[Dammi tutti i paesi comunisti.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les pays communistes.]]></string>
<string lang="nl"><![CDATA[Geef alle communistische landen.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate țările comuniste.]]></string>
<keywords lang="en"><![CDATA[communist countries]]></keywords>
<keywords lang="de"><![CDATA[kommunistische Länder]]></keywords>
<keywords lang="es"><![CDATA[países comunistas]]></keywords>
<keywords lang="it"><![CDATA[paesi comunisti]]></keywords>
<keywords lang="fr"><![CDATA[pays communistes]]></keywords>
<keywords lang="nl"><![CDATA[communistische landen]]></keywords>
<keywords lang="ro"><![CDATA[țări comuniste]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Country .
      { ?uri dbo:governmentType res:Communism . }
        UNION
      { ?uri dbo:governmentType res:Communist_state . }
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Division_of_Korea</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Provisional_People's_Committee_for_North_Korea</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mongolian_People's_Republic</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Finnish_Democratic_Republic</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/People's_Revolutionary_Government_(Grenada)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/North_Vietnam</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Republic_of_Mahabad</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="165" onlydbo="true">
<string lang="en"><![CDATA[Which instruments does Cat Stevens play?]]></string>
<string lang="de"><![CDATA[Welche Instrumente spielt Cat Stevens?]]></string>
<string lang="es"><![CDATA[¿Qué instrumentos tocaba Cat Stevens?]]></string>
<string lang="it"><![CDATA[Quali strumenti suona Cat Stevens?]]></string>
<string lang="fr"><![CDATA[Quels instruments joue Cat Stevens?]]></string>
<string lang="nl"><![CDATA[Welke instrumenten speeld Cat Stevens?]]></string>
<string lang="ro"><![CDATA[La ce instrumente cântă Cat Stevens?]]></string>
<keywords lang="en"><![CDATA[Cat Stevens, instrument]]></keywords>
<keywords lang="de"><![CDATA[Cat Stevens, Instrument]]></keywords>
<keywords lang="es"><![CDATA[Cat Stevens, instrumento, tocaba]]></keywords>
<keywords lang="it"><![CDATA[Cat Stevens, strumenti]]></keywords>
<keywords lang="fr"><![CDATA[Cat Stevens, instrument]]></keywords>
<keywords lang="nl"><![CDATA[Cat Stevens, instrument]]></keywords>
<keywords lang="ro"><![CDATA[Cat Stevens, instrument]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Cat_Stevens dbo:instrument ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Bass_guitar</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Double_bass</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Guitar</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mandolin</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rhodes_piano</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mellotron</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Organ_(music)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gibson_ES-335</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gibson_J-200</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gibson_Everly_Brothers_Flattop</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Baldwin_Piano_Company</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Epiphone_Casino</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Synthesizer</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Fender_Telecaster</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Synthesiser</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Electric_bass</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Fender_Rhodes</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="35" onlydbo="true">
<string lang="en"><![CDATA[Who is the owner of Universal Studios?]]></string>
<string lang="de"><![CDATA[Wem gehören die Universal Studios?]]></string>
<string lang="es"><![CDATA[¿A quién le pertenecen los Universal Studios?]]></string>
<string lang="it"><![CDATA[Chi è il proprietario degli Universal Studios?]]></string>
<string lang="fr"><![CDATA[A qui appartient Universal Studios?]]></string>
<string lang="nl"><![CDATA[Wie is de eigenaar van Universal Studios?]]></string>
<string lang="ro"><![CDATA[Cine este proprietarul Universal Studios?]]></string>
<keywords lang="en"><![CDATA[Universal Studios, owner]]></keywords>
<keywords lang="de"><![CDATA[Universal Studios, gehören]]></keywords>
<keywords lang="es"><![CDATA[Universal Studios, dueño]]></keywords>
<keywords lang="it"><![CDATA[Universal Studios, proprietario]]></keywords>
<keywords lang="fr"><![CDATA[appartient, Universal Studios]]></keywords>
<keywords lang="nl"><![CDATA[eigenaar, Universal Studios]]></keywords>
<keywords lang="ro"><![CDATA[Universal Studios, proprietar]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Universal_Studios dbo:owner ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Decca_Records</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/MCA_Inc.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/NBCUniversal</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Vivendi</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Independent_business</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Vivendi_Universal</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="3" onlydbo="true">
<string lang="en"><![CDATA[Who is the daughter of Ingrid Bergman married to?]]></string>
<string lang="de"><![CDATA[Mit wem ist die Tochter von Ingrid Bergman verheiratet?]]></string>
<string lang="es"><![CDATA[¿Con quién está casada la hija de Ingrid Bergman?]]></string>
<string lang="it"><![CDATA[Con chi è sposata la figlia di Ingrid Bergman?]]></string>
<string lang="fr"><![CDATA[Qui est l'épou de la fille d'Ingrid Bergman?]]></string>
<string lang="nl"><![CDATA[Met wie is de dochter van Ingrid Bergman getrouwd?]]></string>
<string lang="ro"><![CDATA[Cu cine este căsătorită fiica lui Ingrid Bergman?]]></string>
<keywords lang="en"><![CDATA[Ingrid Bergman, daughter, married]]></keywords>
<keywords lang="de"><![CDATA[Ingrid Bergman, Tochter, verheiratet]]></keywords>
<keywords lang="es"><![CDATA[Ingrid Bergman, hija, casada]]></keywords>
<keywords lang="it"><![CDATA[Ingrid Bergman, figlia, sposata]]></keywords>
<keywords lang="fr"><![CDATA[épou, fille, Ingrid Bergman]]></keywords>
<keywords lang="nl"><![CDATA[Ingrid Bergman, dochter, getrouwd]]></keywords>
<keywords lang="ro"><![CDATA[Ingrid Bergman, fiică, căsătorită]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Ingrid_Bergman dbo:child ?child .
        ?child dbo:spouse ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Martin_Scorsese</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="51" onlydbo="false">
<string lang="en"><![CDATA[Give me all libraries established earlier than 1400.]]></string>
<string lang="de"><![CDATA[Gib mir alle Bibliotheken, die vor 1400 gegründet worden.]]></string>
<string lang="es"><![CDATA[Dame todas las bibliotecas que fueron establecidas antes de 1400.]]></string>
<string lang="it"><![CDATA[Dammi tutte le biblioteche fondate prima del 1400.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les bibliothèques établies avant 1400.]]></string>
<string lang="nl"><![CDATA[Geef me alle bibliotheken die voor 1400 werden opgericht.]]></string>
<string lang="ro"><![CDATA[Dă-mi tote bibliotecile înființate înainte de 1400]]></string>
<keywords lang="en"><![CDATA[libraries, established, earlier than 1400]]></keywords>
<keywords lang="de"><![CDATA[Bibliotheken, gegründet, vor 1400]]></keywords>
<keywords lang="es"><![CDATA[bibliotecas, establecidas, antes de 1400]]></keywords>
<keywords lang="it"><![CDATA[biblioteche, fondate, prima del 1400]]></keywords>
<keywords lang="fr"><![CDATA[bibliothèques, établies, avant 1400]]></keywords>
<keywords lang="nl"><![CDATA[bibliotheken, opgericht, voor 1400]]></keywords>
<keywords lang="ro"><![CDATA[biblioteci, înființat, înainte de 1400]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Library .
        ?uri dbp:established ?year . 
        FILTER (?year < 1400)
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Cambridge_University_Library</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Connemara_Public_Library</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Austrian_National_Library</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Library_of_Ashurbanipal</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/National_Parliamentary_Library_of_Ukraine</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jagiellonian_Library</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Biblioteca_Nacional_de_Portugal</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Maughan_Library</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/University_Library_Heidelberg</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bait_al_Hikmat</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Zaporizhia_Region_Universal_Scientific_Library_named_after_A.M._Gorky</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/National_Library_of_Indonesia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Evelyn_Rutnam_Institute_for_Inter-Cultural_Studies</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Instituto_Aut%C3%B3nomo_de_Bibliotecas_e_Informaci%C3%B3n_del_Estado_M%C3%A9rida</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/National_and_University_Library_of_the_Republika_Srpska</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Biblioth%C3%A8que_Sainte-Barbe</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Durr%C3%ABs_Library</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="boolean" id="19" onlydbo="true">
<string lang="en"><![CDATA[Is Egypts largest city also its capital?]]></string>
<string lang="de"><![CDATA[Ist Ägyptens größte Stadt auch seine Hauptstadt?]]></string>
<string lang="es"><![CDATA[¿Es la cuidad más grande de Egipto también capital?]]></string>
<string lang="it"><![CDATA[La città più grande dell'Egitto è anche la sua capitale?]]></string>
<string lang="fr"><![CDATA[La ville la plus grande de l'Egypte est-elle sa capitale?]]></string>
<string lang="nl"><![CDATA[Is de grootste stad van Egypte ook de hoofdstad?]]></string>
<string lang="ro"><![CDATA[Orașul cel mai mare din EGipt este și capital sa?]]></string>
<keywords lang="en"><![CDATA[largest city, Egypt, capital]]></keywords>
<keywords lang="de"><![CDATA[größte Stadt, Ägypten, Hauptstadt]]></keywords>
<keywords lang="es"><![CDATA[cuidad más grande, Egipto, capital]]></keywords>
<keywords lang="it"><![CDATA[città più grande, Egitto, capitale]]></keywords>
<keywords lang="fr"><![CDATA[ville plus grande, Egypte, capitale]]></keywords>
<keywords lang="nl"><![CDATA[grootste stad, Egypte, hoofdstad]]></keywords>
<keywords lang="ro"><![CDATA[cel mai mare oraș, Egipt, capitală]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
ASK 
WHERE {
        res:Egypt dbo:largestCity ?large .
        res:Egypt dbo:capital ?capital .
        FILTER (?large = ?capital)
}]]></query>
<answers>
<answer>
<boolean>True</boolean>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="5" onlydbo="false">
<string lang="en"><![CDATA[How many countries are there in Europe?]]></string>
<string lang="de"><![CDATA[Wieviele Länder gibt es in Europa?]]></string>
<string lang="es"><![CDATA[¿Cuántos países existen en Europa?]]></string>
<string lang="it"><![CDATA[Quanti stati ci sono in Europa?]]></string>
<string lang="fr"><![CDATA[Combien de pays sont-il en Europe?]]></string>
<string lang="nl"><![CDATA[Hoeveel landen zijn er in Europa?]]></string>
<string lang="ro"><![CDATA[Câte țări sunt în Europa?]]></string>
<keywords lang="en"><![CDATA[Europe, countries]]></keywords>
<keywords lang="de"><![CDATA[Europa, Länder]]></keywords>
<keywords lang="es"><![CDATA[Europa, países]]></keywords>
<keywords lang="it"><![CDATA[Europa, stati]]></keywords>
<keywords lang="fr"><![CDATA[Europe, pays]]></keywords>
<keywords lang="nl"><![CDATA[Europa, landen]]></keywords>
<keywords lang="ro"><![CDATA[Europa, țări]]></keywords>
<query><![CDATA[PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?uri) 
WHERE {
        ?uri rdf:type yago:EuropeanCountries .
}]]></query>
<answers>
<answer>
<number>50</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="number" id="185" onlydbo="true">
<string lang="en"><![CDATA[How many people live in the capital of Australia?]]></string>
<string lang="de"><![CDATA[Wieviele Menschen leben in der Hauptstadt Australiens?]]></string>
<string lang="es"><![CDATA[¿Cuánta gente vive en la capital de Australia?]]></string>
<string lang="it"><![CDATA[Quante persone vivono nella capitale dell'Australia?]]></string>
<string lang="fr"><![CDATA[Quel est le nombre d'habitants de la capitale de l'Australie?]]></string>
<string lang="nl"><![CDATA[Hoeveel mensen wonen er in de hoofdstad van Australië?]]></string>
<string lang="ro"><![CDATA[Câți oameni locuiesc in capitala Australiei?]]></string>
<keywords lang="en"><![CDATA[Australia, capital, people, live]]></keywords>
<keywords lang="de"><![CDATA[Australien, Hauptstadt, Menschen, leben]]></keywords>
<keywords lang="es"><![CDATA[Australia, capital, habitantes]]></keywords>
<keywords lang="it"><![CDATA[Australia, capitale, abitanti]]></keywords>
<keywords lang="fr"><![CDATA[nombre d'habitants, capitale, Australie]]></keywords>
<keywords lang="nl"><![CDATA[inwoners, hoofdstad van Australië]]></keywords>
<keywords lang="ro"><![CDATA[Australia, captital, oameni, locui]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num 
WHERE {
        res:Australia dbo:capital ?x .
        ?x dbo:populationTotal ?num .
}]]></query>
<answers>
<answer>
<number>367752</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="string" id="196" onlydbo="true">
<string lang="en"><![CDATA[Give me all B-sides of the Ramones.]]></string>
<string lang="de"><![CDATA[Gib mir alle B-Seiten der Ramones.]]></string>
<string lang="es"><![CDATA[Dame todas las caras B de los Ramones.]]></string>
<string lang="it"><![CDATA[Dammi tutti i lati B dei Ramones.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les faces B des Ramones.]]></string>
<string lang="nl"><![CDATA[Geef alle B-kantjes van singles van de Ramones.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate laturile B ale Ramones]]></string>
<keywords lang="en"><![CDATA[Ramones, B-sides]]></keywords>
<keywords lang="de"><![CDATA[Ramones, B-Seiten]]></keywords>
<keywords lang="es"><![CDATA[Ramones, cara B]]></keywords>
<keywords lang="it"><![CDATA[Ramones, lato B]]></keywords>
<keywords lang="fr"><![CDATA[faces B, Ramones]]></keywords>
<keywords lang="nl"><![CDATA[B-kant, single, de Ramones]]></keywords>
<keywords lang="ro"><![CDATA[Ramones, laturi B]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?string 
WHERE {
        ?x dbo:musicalArtist res:Ramones .
        ?x dbo:bSide ?string . 
}]]></query>
<answers>
<answer>
<string><![CDATA[Go Home Ann (12 only)]]></string>
</answer>
<answer>
<string><![CDATA[Daytime Dilemma (Dangers of Love)]]></string>
</answer>
<answer>
<string><![CDATA[I Don't Want You]]></string>
</answer>
<answer>
<string><![CDATA[Babysitter]]></string>
</answer>
<answer>
<string><![CDATA[I Don't Care]]></string>
</answer>
<answer>
<string><![CDATA[Do You Wanna Dance?]]></string>
</answer>
<answer>
<string><![CDATA[Censorshit]]></string>
</answer>
</answers>
</question>
<question aggregation="false" answertype="number" id="33" onlydbo="true">
<string lang="en"><![CDATA[What is the area code of Berlin?]]></string>
<string lang="de"><![CDATA[Was ist die Vorwahl von Berlin?]]></string>
<string lang="es"><![CDATA[¿Cuál es el prefijo de Berlin?]]></string>
<string lang="it"><![CDATA[Qual è il prefisso di Berlino?]]></string>
<string lang="fr"><![CDATA[Quel est l'indicatif téléphonique de Berlin?]]></string>
<string lang="nl"><![CDATA[Wat is het kengetal van Berlijn?]]></string>
<string lang="ro"><![CDATA[Care este prefixul telephonic pentru Berlin?]]></string>
<keywords lang="en"><![CDATA[Berlin, area code]]></keywords>
<keywords lang="de"><![CDATA[Berlin, Vorwahl]]></keywords>
<keywords lang="es"><![CDATA[prefijo, Berlin]]></keywords>
<keywords lang="it"><![CDATA[prefisso, Berlino]]></keywords>
<keywords lang="fr"><![CDATA[indicatif téléphonique, Berlin]]></keywords>
<keywords lang="nl"><![CDATA[kengetal, Berlijn]]></keywords>
<keywords lang="ro"><![CDATA[Berlin, prefix telefonic]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?string 
WHERE {
        res:Berlin dbo:areaCode ?string .
}]]></query>
<answers>
<answer>
<number>030</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="31" onlydbo="true">
<string lang="en"><![CDATA[What is the currency of the Czech Republic?]]></string>
<string lang="de"><![CDATA[Was ist die Währung der Tschechischen Republik?]]></string>
<string lang="es"><![CDATA[¿Cuál es la moneda de la república checa?]]></string>
<string lang="it"><![CDATA[Qual è la valuta della Repubblica Ceca?]]></string>
<string lang="fr"><![CDATA[Quel est la devise de la Tchéquie?]]></string>
<string lang="nl"><![CDATA[Wat is de munteenheid van Tsjechië?]]></string>
<string lang="ro"><![CDATA[Care este moneda națională a Cehiei?]]></string>
<keywords lang="en"><![CDATA[Czech republic, currency]]></keywords>
<keywords lang="de"><![CDATA[Tschechischen Republik, Währung]]></keywords>
<keywords lang="es"><![CDATA[moneda, república checa]]></keywords>
<keywords lang="it"><![CDATA[valuta, Repubblica Ceca]]></keywords>
<keywords lang="fr"><![CDATA[devise, Tchéquie]]></keywords>
<keywords lang="nl"><![CDATA[Tsjechië, munteenheid]]></keywords>
<keywords lang="ro"><![CDATA[Cehia, monedă națională]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
       res:Czech_Republic dbo:currency ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Czech_koruna</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="77" onlydbo="false">
<string lang="en"><![CDATA[Which music albums contain the song Last Christmas?]]></string>
<string lang="de"><![CDATA[Auf welchen Musikalben ist das Lied Last Christmas?]]></string>
<string lang="es"><![CDATA[¿Qué albums musicales contienen la canción Las Christmas?]]></string>
<string lang="it"><![CDATA[Quali album musicali contengono la canzone Last Christmas?]]></string>
<string lang="fr"><![CDATA[Quels albums contiennent le morceau Last Christmas?]]></string>
<string lang="nl"><![CDATA[Op welke muziekalbums staat het nummer Last Christmas?]]></string>
<string lang="ro"><![CDATA[Ce albume muzicale conțin melodia Last Christmas?]]></string>
<keywords lang="en"><![CDATA[music album, song, Last Christmas]]></keywords>
<keywords lang="de"><![CDATA[Musikalbum, Lied, Last Christmas]]></keywords>
<keywords lang="es"><![CDATA[album musical, canción, Last Christmas]]></keywords>
<keywords lang="it"><![CDATA[album musicale, canzone, Last Christmas]]></keywords>
<keywords lang="fr"><![CDATA[albums, contiennent, Last Christmas?]]></keywords>
<keywords lang="nl"><![CDATA[muziekalbum, nummer, Last Christmas]]></keywords>
<keywords lang="ro"><![CDATA[album musical, melodie, Last Christmas]]></keywords>
<query><![CDATA[PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT DISTINCT ?uri 
WHERE {
        ?single dbo:album ?uri .
        ?single rdfs:label 'Last Christmas'@en .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Crazy_Frog_Presents_More_Crazy_Hits</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Music_from_the_Edge_of_Heaven</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Whigfield_(album)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Perfect_Day_(Cascada_album)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Disco_Defenders</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Whigfield_II</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Classic_Christmas_(Joe_McElderry_album)</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="112" onlydbo="false">
<string lang="en"><![CDATA[Give me all world heritage sites designated within the past two years.]]></string>
<string lang="de"><![CDATA[Gib mir alle Welterbestätten, die in den vergangenen zwei Jahren aufgenommen wurden.]]></string>
<string lang="es"><![CDATA[¿Qué patrimonios de la humanidad fueron reconocidos en los últimos dos años?]]></string>
<string lang="it"><![CDATA[Dammi tutti i siti designati patrimoni dell'umanità negli ultimi due anni.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les patrimoines mondiaux qui ont été inscrits pendant les derniers deux ans.]]></string>
<string lang="nl"><![CDATA[Noem alle plaatsen op de Werelderfgoedlijst die in de laatste twee jaar zijn toegevoegd.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate siturile de patrimoniu mondial desemnate in ultimii doi ani.]]></string>
<keywords lang="en"><![CDATA[world heritage site, designate, past two years]]></keywords>
<keywords lang="de"><![CDATA[Welterbestätte, aufnehmen, vergangene zwei Jahre]]></keywords>
<keywords lang="es"><![CDATA[patrimonios de la humanidad, reconocidos, últimos dos años]]></keywords>
<keywords lang="it"><![CDATA[patrimoni dell'umanità, designare, ultimi due anni]]></keywords>
<keywords lang="fr"><![CDATA[patrimoines mondiaux, inscrits, derniers deux ans]]></keywords>
<keywords lang="nl"><![CDATA[Werelderfgoed, laatste twee jaar, toevoegen]]></keywords>
<keywords lang="ro"><![CDATA[situri de patrimoniu mondial, desemna, ultimii doi ani]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:WorldHeritageSite . 
        ?uri dbp:year ?x . 
        FILTER ( ?x >= '2012'^^xsd:integer) 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Shangdu</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Western_Ghats</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lenggong</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Subak_(irrigation)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lena_Pillars</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Decorated_Farmhouses_of_H%C3%A4lsingland</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gonbad-e_Qabus_(tower)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bahrain_Pearling_Trail</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Heritage_of_Mercury._Almad%C3%A9n_and_Idrija</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Garrison_Border_Town_of_Elvas_and_its_Fortifications</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Major_Mining_Sites_of_Wallonia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Nahal_Me'arot_Nature_Reserve</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sangha_Trinational</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lakes_of_Ounianga</uri>
</answer>
</answers>
</question>
