<?xml version="1.0" ?>
<dataset id="qald-4_multilingual_train">
<question aggregation="false" answertype="resource" id="57" onlydbo="true">
<string lang="en"><![CDATA[List all episodes of the first season of the HBO television series The Sopranos.]]></string>
<string lang="de"><![CDATA[Liste alle Episoden der ersten Staffel der HBO-Fernsehserie Die Sopranos auf.]]></string>
<string lang="es"><![CDATA[Dame todos los episodios de la prímera época de la serie de HBO Los Sporanos.]]></string>
<string lang="it"><![CDATA[Elenca tutti gli episodi della prima stagione della serie televisiva di HBO i Sopranos.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les épisodes de la première saison de la série télévisée de HBO les Sopranos.]]></string>
<string lang="nl"><![CDATA[Noem alle afleveringen van het eerste seizoen van de HBO-serie The Sopranos.]]></string>
<string lang="ro"><![CDATA[Listează toate episodele din primul sezon al serialului HBO de televiziune The Sopranos]]></string>
<keywords lang="en"><![CDATA[HBO, television series, Sopranos, first season, episode]]></keywords>
<keywords lang="de"><![CDATA[HBO-Fernsehserie, Sopranos, erste Staffel, Episode]]></keywords>
<keywords lang="es"><![CDATA[serie televisiva de HBO, Los Sopranos, primera época, episodios]]></keywords>
<keywords lang="it"><![CDATA[serie televisiva di HBO, i Sopranos, prima stagione, episodio]]></keywords>
<keywords lang="fr"><![CDATA[épisodes de la première saison, HBO, les Sopranos]]></keywords>
<keywords lang="nl"><![CDATA[HBO-serie, The Sopranos, eerste seizoen, aflevering]]></keywords>
<keywords lang="ro"><![CDATA[HBO, serial de televiziune, Sopranos, primul sezon, episod]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        ?uri dbo:series res:The_Sopranos  .
        ?uri dbo:seasonNumber 1 .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/The_Sopranos_(episode)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/46_Long</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Denial,_Anger,_Acceptance</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Meadowlands_(The_Sopranos)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/College_(The_Sopranos)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Pax_Soprana</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Down_Neck</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Boca_(The_Sopranos)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/A_Hit_Is_a_Hit</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Nobody_Knows_Anything</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Isabella_(The_Sopranos)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="7" onlydbo="true">
<string lang="en"><![CDATA[Is the wife of president Obama called Michelle?]]></string>
<string lang="de"><![CDATA[Heißt die Frau von Präsident Obama Michelle?]]></string>
<string lang="es"><![CDATA[¿La mujer del presidente Obama se llama Michelle?]]></string>
<string lang="it"><![CDATA[La moglie del presidente Obama si chiama Michelle?]]></string>
<string lang="fr"><![CDATA[L'épouse du président Obama s'appelle-t-elle Michelle?]]></string>
<string lang="nl"><![CDATA[Heet de echtgenote van president Barack Obama Michelle?]]></string>
<string lang="ro"><![CDATA[Este soția președintelui Obama numită Michelle?]]></string>
<keywords lang="en"><![CDATA[Obama, president, wife, called, Michelle]]></keywords>
<keywords lang="de"><![CDATA[Obama, Präsident, Frau, heißen, Michelle]]></keywords>
<keywords lang="es"><![CDATA[mujer, presidente, Obama, se lamma, Michelle]]></keywords>
<keywords lang="it"><![CDATA[moglie, presidente, Obama, si chiama, Michelle]]></keywords>
<keywords lang="fr"><![CDATA[épouse, Obama, Michelle, appelle]]></keywords>
<keywords lang="nl"><![CDATA[echtgenote, Barack Obama, Michelle]]></keywords>
<keywords lang="ro"><![CDATA[Obama, președinte, soție, numită, Michelle]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
ASK 
WHERE {
        res:Barack_Obama dbo:spouse ?spouse .
        ?spouse rdfs:label ?name .
        FILTER(regex(?name,'Michelle')) 
}]]></query>
<answers>
<answer>
<boolean>True</boolean>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="92" onlydbo="true">
<string lang="en"><![CDATA[What is the highest mountain?]]></string>
<string lang="de"><![CDATA[Was ist der höchste Berg?]]></string>
<string lang="es"><![CDATA[¿Cuál es la montaña más alta?]]></string>
<string lang="it"><![CDATA[Qual è la montagna più alta?]]></string>
<string lang="fr"><![CDATA[Quelle est la montagne la plus haute?]]></string>
<string lang="nl"><![CDATA[Wat is de hoogste berg?]]></string>
<string lang="ro"><![CDATA[Care este cel mai înalt munte?]]></string>
<keywords lang="en"><![CDATA[mountain, highest]]></keywords>
<keywords lang="de"><![CDATA[höchster, Berg]]></keywords>
<keywords lang="es"><![CDATA[montaña, más alta]]></keywords>
<keywords lang="it"><![CDATA[montagna, più alta]]></keywords>
<keywords lang="fr"><![CDATA[montagne, la plus haute]]></keywords>
<keywords lang="nl"><![CDATA[hoogste berg]]></keywords>
<keywords lang="ro"><![CDATA[munte, cel mai înalt]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Mountain  .
        ?uri dbo:elevation ?elevation .
} 
ORDER BY DESC(?elevation) 
OFFSET 0 LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Mount_Everest</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="80" onlydbo="true">
<string lang="en"><![CDATA[Give me all Canadian Grunge record labels.]]></string>
<string lang="de"><![CDATA[Gib mir alle kanadischen Grunge-Plattenfirmen.]]></string>
<string lang="es"><![CDATA[Dame todos las empresas canadienses productoras de música Grunge.]]></string>
<string lang="it"><![CDATA[Dammi tutti i produttori canadesi di musica Grunge.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les labels discographiques canadiens de grunge.]]></string>
<string lang="nl"><![CDATA[Noem alle Canadese grunge-platenlabels.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate casele canadiene Grunge de înregistrări.]]></string>
<keywords lang="en"><![CDATA[record label, Canadian, Grunge]]></keywords>
<keywords lang="de"><![CDATA[kanadisch, Plattenfirma, Grunge]]></keywords>
<keywords lang="es"><![CDATA[empresa productora de música, canadiense, Grunge]]></keywords>
<keywords lang="it"><![CDATA[produttore di musica, canadese, Grunge]]></keywords>
<keywords lang="fr"><![CDATA[labels discographiques, canadiens, grunge]]></keywords>
<keywords lang="nl"><![CDATA[Canadees, platenlabel, Grunge]]></keywords>
<keywords lang="ro"><![CDATA[casă de înregistrări, canadian, Grunge]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:RecordLabel .
        ?uri dbo:genre res:Grunge .
        ?uri dbo:country res:Canada .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Murderecords</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="148" onlydbo="true">
<string lang="en"><![CDATA[In which UK city are the headquarters of the MI6?]]></string>
<string lang="de"><![CDATA[In welcher Stadt im Vereinigten Königreich ist das Hauptquartier des MI6?]]></string>
<string lang="es"><![CDATA[¿En qué ciudad del reino unido se encuentra el cuartel genetal del MI6?]]></string>
<string lang="it"><![CDATA[In quale città del Regno Unito si trova il quartier generale del MI6?]]></string>
<string lang="fr"><![CDATA[Dans quelle ville anglaise se trouvent les quartiers genéraux du MI6?]]></string>
<string lang="nl"><![CDATA[In welke Britse stad is het hoofdkwartier van MI6 gevestigd?]]></string>
<string lang="ro"><![CDATA[În care oraș din Regatul Unit se află cartierul general al MI6?]]></string>
<keywords lang="en"><![CDATA[MI6, headquarters, city, UK]]></keywords>
<keywords lang="de"><![CDATA[MI6, Hauptquartier, Stadt, Vereinigtes Königreich]]></keywords>
<keywords lang="es"><![CDATA[MI6, cuartel general, ciudad, reino unido]]></keywords>
<keywords lang="it"><![CDATA[MI6, quartier generale, città, Regno Unito]]></keywords>
<keywords lang="fr"><![CDATA[ville anglaise, quartiers genéraux, MI6]]></keywords>
<keywords lang="nl"><![CDATA[MI6, hoofdkwartier, Britse stad]]></keywords>
<keywords lang="ro"><![CDATA[MI6, cartier general, oraș, Regatul Unit]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:City . 
        res:Secret_Intelligence_Service dbo:headquarter ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/London</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="115" onlydbo="false">
<string lang="en"><![CDATA[What is the longest river?]]></string>
<string lang="de"><![CDATA[Was ist der längste Fluss?]]></string>
<string lang="es"><![CDATA[¿Cuál es el río más largo?]]></string>
<string lang="it"><![CDATA[Qual è il fiume più lungo?]]></string>
<string lang="fr"><![CDATA[Quel est le cours d'eau le plus long?]]></string>
<string lang="nl"><![CDATA[Wat is de langste rivier?]]></string>
<string lang="ro"><![CDATA[Care este cel mai lung fluviu?]]></string>
<keywords lang="en"><![CDATA[river, longest]]></keywords>
<keywords lang="de"><![CDATA[Fluss, längster]]></keywords>
<keywords lang="es"><![CDATA[río, más largo]]></keywords>
<keywords lang="it"><![CDATA[fiume, più lungo]]></keywords>
<keywords lang="fr"><![CDATA[cours d'eau, plus long]]></keywords>
<keywords lang="nl"><![CDATA[rivier, langste]]></keywords>
<keywords lang="ro"><![CDATA[fluviu, cel mai lung]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:River . 
      { ?uri dbo:length ?l . } 
      UNION 
      { ?uri dbp:length ?l . } 
} ORDER BY DESC(?l) 
OFFSET 0 LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Lochbach_(Itter)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="25" onlydbo="true">
<string lang="en"><![CDATA[In which films directed by Garry Marshall was Julia Roberts starring?]]></string>
<string lang="de"><![CDATA[In welchem Filmen, bei denen Garry Marshall Regie geführt hat, hat Julia Roberts mitgespielt?]]></string>
<string lang="es"><![CDATA[¿En qué películas dirigidas por Garry Mashall actuó Julia Roberts?]]></string>
<string lang="it"><![CDATA[In quali film diretti da Garry Marshall recita Julia Roberts?]]></string>
<string lang="fr"><![CDATA[Dans quels films dirigés par Garry Marshall joue Julia Roberts?]]></string>
<string lang="nl"><![CDATA[In welke films die werden geregisseerd door Garry Marshall speelde Julia Roberts?]]></string>
<string lang="ro"><![CDATA[În ce filme regizate de Garry Marsall a jucat Julia Roberts roluri principale?]]></string>
<keywords lang="en"><![CDATA[film, directed, Garry Marshall, starring, Julia Roberts]]></keywords>
<keywords lang="de"><![CDATA[Film, Regie, Garry Marshall, mitspielen, Julia Roberts]]></keywords>
<keywords lang="es"><![CDATA[película, director, Garry Marshall, actuar, Julia Roberts]]></keywords>
<keywords lang="it"><![CDATA[film, regista, Garry Marshall, recitare, Julia Roberts]]></keywords>
<keywords lang="fr"><![CDATA[film, dirigés, Garry Marshall, joue Julia Roberts]]></keywords>
<keywords lang="nl"><![CDATA[film, regisseur, Garry Marshall, speelt, Julia Roberts]]></keywords>
<keywords lang="ro"><![CDATA[film, regizat, Garry Marshall, rol principal, Julia Roberts]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:starring res:Julia_Roberts .
        ?uri dbo:director res:Garry_Marshall .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Pretty_Woman</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Runaway_Bride_(1999_film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Valentine's_Day_(film)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="66" onlydbo="true">
<string lang="en"><![CDATA[Is Christian Bale starring in Velvet Goldmine?]]></string>
<string lang="de"><![CDATA[Spielt Christian Bale in Velvet Goldmine mit?]]></string>
<string lang="es"><![CDATA[¿Actúa Christian Bale en Velvet Goldmine?]]></string>
<string lang="it"><![CDATA[Christian Bale ha recitato in Velvet Goldmine?]]></string>
<string lang="fr"><![CDATA[Christian Bale joue-t-il dans Velvet Goldmine?]]></string>
<string lang="nl"><![CDATA[Speelt Christian Bale in Velvet Goldmine?]]></string>
<string lang="ro"><![CDATA[Joacă Christian Bale un rol principal în Velvet Goldmine?]]></string>
<keywords lang="en"><![CDATA[Christian Bale, starring, Velvet Goldmine]]></keywords>
<keywords lang="de"><![CDATA[Christian Bale, mitspielen, Velvet Goldmine]]></keywords>
<keywords lang="es"><![CDATA[Christian Bale, actúa, Velvet Goldmine]]></keywords>
<keywords lang="it"><![CDATA[Christian Bale, recitare, Velvet Goldmine]]></keywords>
<keywords lang="fr"><![CDATA[Christian Bale, joue, Velvet Goldmine]]></keywords>
<keywords lang="nl"><![CDATA[Christian Bale, speelt in, Velvet Goldmine]]></keywords>
<keywords lang="ro"><![CDATA[Christian Bale, rol principal, Velevet Goldmine]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE {
        res:Velvet_Goldmine dbo:starring res:Christian_Bale .
}]]></query>
<answers>
<answer>
<boolean>True</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="55" onlydbo="true">
<string lang="en"><![CDATA[Who developed the video game World of Warcraft?]]></string>
<string lang="de"><![CDATA[Wer hat das Videospiel World of Warcraft entwickelt?]]></string>
<string lang="es"><![CDATA[¿Quién desarrolló el videojuego Warcraft?]]></string>
<string lang="it"><![CDATA[Chi ha creato il videogioco World of Warcraft?]]></string>
<string lang="fr"><![CDATA[Qui a développé World of Warcraft?]]></string>
<string lang="nl"><![CDATA[Wie heeft het videospel World of Warcraft ontwikkeld?]]></string>
<string lang="ro"><![CDATA[Cine a dezvoltat jocul video World of Warcraft?]]></string>
<keywords lang="en"><![CDATA[video game, World of Warcraft, develop]]></keywords>
<keywords lang="de"><![CDATA[Videospiel, World of Warcraft, entwickeln]]></keywords>
<keywords lang="es"><![CDATA[videojuego, Warcraft, desarrollar]]></keywords>
<keywords lang="it"><![CDATA[videogioco, World of Warcraft, creare]]></keywords>
<keywords lang="fr"><![CDATA[développé, World of Warcraft]]></keywords>
<keywords lang="nl"><![CDATA[World of Warcraft, ontwikkelaar]]></keywords>
<keywords lang="ro"><![CDATA[joc video, World of Warcraft, dezvolta]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:World_of_Warcraft dbo:developer ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Blizzard_Entertainment</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="36" onlydbo="true">
<string lang="en"><![CDATA[Through which countries does the Yenisei river flow?]]></string>
<string lang="de"><![CDATA[Durch welche Länder fließt der Yenisei?]]></string>
<string lang="es"><![CDATA[¿Por qué países fluye el río Yenisei?]]></string>
<string lang="it"><![CDATA[Attraverso quali stati scorre il fiume Yenisei?]]></string>
<string lang="fr"><![CDATA[Quels sont les pays traversés par l'Ienisseï?]]></string>
<string lang="nl"><![CDATA[Door welke landen stroomt de Jenisej?]]></string>
<string lang="ro"><![CDATA[Ce țări traversează fluviul Enisei?]]></string>
<keywords lang="en"><![CDATA[Yenisei river, flow through, country]]></keywords>
<keywords lang="de"><![CDATA[Yenisei, fließen, Land]]></keywords>
<keywords lang="es"><![CDATA[países, fluye, río Yenisei]]></keywords>
<keywords lang="it"><![CDATA[fiume Yenisei, scorrere attraverso, stato]]></keywords>
<keywords lang="fr"><![CDATA[Ienisseï, pays traversés]]></keywords>
<keywords lang="nl"><![CDATA[Jenisej, land, stroomt door]]></keywords>
<keywords lang="ro"><![CDATA[fluviul Enisei, traversează, țară]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
        res:Yenisei_River dbo:country ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Mongolia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Russia</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="108" onlydbo="false">
<string lang="en"><![CDATA[To which countries does the Himalayan mountain system extend?]]></string>
<string lang="de"><![CDATA[Über welche Länder erstreckt sich der Himalaya?]]></string>
<string lang="es"><![CDATA[¿Por qué países se extiende el Himalaya?]]></string>
<string lang="it"><![CDATA[Su quali stati si estende la catena montuosa dell'Himalaya?]]></string>
<string lang="fr"><![CDATA[Quels sont les pays chevauchés par l'Himalaya?]]></string>
<string lang="nl"><![CDATA[Over welke landen strekt de Himalaya zich uit?]]></string>
<string lang="ro"><![CDATA[Peste ce țări se întinde lanțul munților Himalaya?]]></string>
<keywords lang="en"><![CDATA[Himalayan mountain system, extend, country]]></keywords>
<keywords lang="de"><![CDATA[Himalaya, erstrecken, Land]]></keywords>
<keywords lang="es"><![CDATA[Himalaya, extiende, países]]></keywords>
<keywords lang="it"><![CDATA[catena montuosa dell'Himalaya, estendersi, stati]]></keywords>
<keywords lang="fr"><![CDATA[Himalaya, chevauchés, pays]]></keywords>
<keywords lang="nl"><![CDATA[Himalaya, land, uitstrekken]]></keywords>
<keywords lang="ro"><![CDATA[lanțul munților Himalaya, întinde, țară]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Himalayas dbp:country ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Afghanistan</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/China</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/India</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Burma</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Pakistan</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Nepal</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bhutan</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/People's_Republic_of_China</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="number" id="20" onlydbo="true">
<string lang="en"><![CDATA[How many employees does IBM have?]]></string>
<string lang="de"><![CDATA[Wieviele Angestellte hat IBM?]]></string>
<string lang="es"><![CDATA[¿Cuántos empleados tiene IBM?]]></string>
<string lang="it"><![CDATA[Quanti dipendenti ha IBM?]]></string>
<string lang="fr"><![CDATA[Combien d'employés a IBM?]]></string>
<string lang="nl"><![CDATA[Hoeveel medewerkers heeft IBM?]]></string>
<string lang="ro"><![CDATA[Câți angajați are IBM?]]></string>
<keywords lang="en"><![CDATA[IBM, employees]]></keywords>
<keywords lang="de"><![CDATA[IBM, Angestellte]]></keywords>
<keywords lang="es"><![CDATA[IBM, empleados]]></keywords>
<keywords lang="it"><![CDATA[IBM, dipendenti]]></keywords>
<keywords lang="fr"><![CDATA[employés, IBM]]></keywords>
<keywords lang="nl"><![CDATA[medewerkers, IBM]]></keywords>
<keywords lang="ro"><![CDATA[IBM, angajați]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?number 
WHERE {
        res:IBM dbo:numberOfEmployees ?number .
}]]></query>
<answers>
<answer>
<number>434246</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="145" onlydbo="true">
<string lang="en"><![CDATA[Which countries are connected by the Rhine?]]></string>
<string lang="de"><![CDATA[Welche Länder verbindet der Rhein?]]></string>
<string lang="es"><![CDATA[¿Qué países une el Rhin?]]></string>
<string lang="it"><![CDATA[Quali stati sono collegati dal Reno?]]></string>
<string lang="fr"><![CDATA[Quels sont les pays connectés pas le Rhin?]]></string>
<string lang="nl"><![CDATA[Welke landen worden door de Rijn verbonden?]]></string>
<string lang="ro"><![CDATA[Ce țări sunt unite de Rin?]]></string>
<keywords lang="en"><![CDATA[Rhine, country]]></keywords>
<keywords lang="de"><![CDATA[Rhein, Land]]></keywords>
<keywords lang="es"><![CDATA[Rhin, une, países]]></keywords>
<keywords lang="it"><![CDATA[Reno, collegare, stati]]></keywords>
<keywords lang="fr"><![CDATA[pays connectés, Rhin]]></keywords>
<keywords lang="nl"><![CDATA[land, Rijn]]></keywords>
<keywords lang="ro"><![CDATA[Rin, țară]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Rhine dbp:country ?string .  
        ?uri rdf:type dbo:Country .  
        ?uri rdfs:label ?string . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Switzerland</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Germany</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Netherlands</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/France</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Austria</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="43" onlydbo="true">
<string lang="en"><![CDATA[Who is the mayor of Tel Aviv?]]></string>
<string lang="de"><![CDATA[Wer ist der Bürgermeister von Tel Aviv?]]></string>
<string lang="es"><![CDATA[¿Quién es el alcalde de Tel Aviv?]]></string>
<string lang="it"><![CDATA[Chi è il sindaco di Tel Aviv?]]></string>
<string lang="fr"><![CDATA[Qui est le maire de Tel Aviv?]]></string>
<string lang="nl"><![CDATA[Wie is de burgemeester van Tel Aviv?]]></string>
<string lang="ro"><![CDATA[Cien este primarul din Tel Aviv?]]></string>
<keywords lang="en"><![CDATA[Tel Aviv, mayor]]></keywords>
<keywords lang="de"><![CDATA[Tel Aviv, Bürgermeister]]></keywords>
<keywords lang="es"><![CDATA[Tel Aviv, alcalde]]></keywords>
<keywords lang="it"><![CDATA[Tel Aviv, sindaco]]></keywords>
<keywords lang="fr"><![CDATA[Tel Aviv, maire]]></keywords>
<keywords lang="nl"><![CDATA[Tel Aviv, burgemeester]]></keywords>
<keywords lang="ro"><![CDATA[Tel Aviv, primar]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Tel_Aviv dbo:leaderName ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Ron_Huldai</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="number" id="168" onlydbo="true">
<string lang="en"><![CDATA[How many employees does Google have?]]></string>
<string lang="de"><![CDATA[Wieviele Angestellte hat Google?]]></string>
<string lang="es"><![CDATA[¿Cuántos empleados tiene Google?]]></string>
<string lang="it"><![CDATA[Quanti dipendenti ha Google?]]></string>
<string lang="fr"><![CDATA[Combien d'employés a Google?]]></string>
<string lang="nl"><![CDATA[Hoeveel werknemers heeft Google?]]></string>
<string lang="ro"><![CDATA[Câți angajați are Google?]]></string>
<keywords lang="en"><![CDATA[Google, employees]]></keywords>
<keywords lang="de"><![CDATA[Google, Angestellte]]></keywords>
<keywords lang="es"><![CDATA[Google, empleados]]></keywords>
<keywords lang="it"><![CDATA[Google, dipendenti]]></keywords>
<keywords lang="fr"><![CDATA[Nombre d'employés, Google]]></keywords>
<keywords lang="nl"><![CDATA[werknemers, Google]]></keywords>
<keywords lang="ro"><![CDATA[Google, angajați]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?num 
WHERE { 
        res:Google dbo:numberOfEmployees ?num . 
}]]></query>
<answers>
<answer>
<number>53861</number>
</answer>
</answers>
</question>
<question aggregation="true" answertype="boolean" id="116" onlydbo="true">
<string lang="en"><![CDATA[Does Breaking Bad have more episodes than Game of Thrones?]]></string>
<string lang="de"><![CDATA[Hat Breaking Bad mehr Episoden als Game of Thrones?]]></string>
<string lang="es"><![CDATA[¿Tiene Breaking Bad más episodios que Game of Thrones?]]></string>
<string lang="it"><![CDATA[Breaking Bad ha più episodi di Game of Thrones?]]></string>
<string lang="fr"><![CDATA[A Breaking Bad plus d'épisodes que Game of Thrones?]]></string>
<string lang="nl"><![CDATA[Heeft Breaking Bad meer afleveringen dan Game of Thrones?]]></string>
<string lang="ro"><![CDATA[Are Breaking Bad mai multe episoade decât Game of Thrones?]]></string>
<keywords lang="en"><![CDATA[Breaking Bad, episodes, more than, Game of Thrones]]></keywords>
<keywords lang="de"><![CDATA[Breaking Bad, Episoden, mehr als, Game of Thrones]]></keywords>
<keywords lang="es"><![CDATA[Breaking Bad, episodios, más que, Game of Thrones]]></keywords>
<keywords lang="it"><![CDATA[Breaking Bad, eposido, più di, Game of Thrones]]></keywords>
<keywords lang="fr"><![CDATA[Breaking Bad, épisodes plus que, Game of Thrones]]></keywords>
<keywords lang="nl"><![CDATA[Breaking Bad, afleveringen, meer dan, Game of Thrones]]></keywords>
<keywords lang="ro"><![CDATA[Breaking Bad, episoade, mai multe decât, Game of Thrones]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Breaking_Bad dbo:numberOfEpisodes ?x . 
        res:Game_of_Thrones dbo:numberOfEpisodes ?y . 
        FILTER (?y > ?x) 
}]]></query>
<answers>
<answer>
<boolean>False</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="39" onlydbo="true">
<string lang="en"><![CDATA[When was the Battle of Gettysburg?]]></string>
<string lang="de"><![CDATA[Wann fand die Schlacht von Gettysburg statt?]]></string>
<string lang="es"><![CDATA[¿Cuándo tuvo lugar la batalla de Gettysburg?]]></string>
<string lang="it"><![CDATA[Quando ha avuto luogo la battaglia di Gettysburg?]]></string>
<string lang="fr"><![CDATA[Quand se déroula la bataille de Gettysburg?]]></string>
<string lang="nl"><![CDATA[Wanneer was de Slag bij Gettysburg?]]></string>
<string lang="ro"><![CDATA[Când a fost bătălia de la Gettysburg?]]></string>
<keywords lang="en"><![CDATA[Battle of Gettysburg]]></keywords>
<keywords lang="de"><![CDATA[Schlacht von Gettysburg]]></keywords>
<keywords lang="es"><![CDATA[batalla de Gettysburg]]></keywords>
<keywords lang="it"><![CDATA[battaglia di Gettysburg]]></keywords>
<keywords lang="fr"><![CDATA[bataille de Gettysburg, quand]]></keywords>
<keywords lang="nl"><![CDATA[Slag bij Gettysburg]]></keywords>
<keywords lang="ro"><![CDATA[bătălia de la Gettysburg]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE { 
        res:Battle_of_Gettysburg dbo:date ?date .
}]]></query>
<answers>
<answer>
<date>1863-07-03</date>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="126" onlydbo="true">
<string lang="en"><![CDATA[How many languages are spoken in Turkmenistan?]]></string>
<string lang="de"><![CDATA[Wieviele Sprachen werden in Turkmenistan gesprochen?]]></string>
<string lang="es"><![CDATA[¿Cuántos idiomas se hablan en Turkmenistán?]]></string>
<string lang="it"><![CDATA[Quante lingue sono parlate in Turkmenistan?]]></string>
<string lang="fr"><![CDATA[Combien de langues sont parlées au Turkménistan?]]></string>
<string lang="nl"><![CDATA[Hoeveel talen worden er gesproken in Turkmenistan?]]></string>
<string lang="ro"><![CDATA[Câte limbi sunt vorbite în Turkmenistan?]]></string>
<keywords lang="en"><![CDATA[languages, Turkmenistan]]></keywords>
<keywords lang="de"><![CDATA[Sprachen, Turkmenistan]]></keywords>
<keywords lang="es"><![CDATA[idiomas, Turkmenistán]]></keywords>
<keywords lang="it"><![CDATA[lingue, Turkmenistan]]></keywords>
<keywords lang="fr"><![CDATA[langues, Turkménistan]]></keywords>
<keywords lang="nl"><![CDATA[talen, Turkmenistan]]></keywords>
<keywords lang="ro"><![CDATA[limbi, Turkmenistan]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT COUNT(DISTINCT ?x) 
WHERE { 
        res:Turkmenistan dbo:language ?x . 
}]]></query>
<answers>
<answer>
<number>4</number>
</answer>
</answers>
</question>
<question aggregation="true" answertype="boolean" id="46" onlydbo="true">
<string lang="en"><![CDATA[Is Frank Herbert still alive?]]></string>
<string lang="de"><![CDATA[Lebt Frank Herbert noch?]]></string>
<string lang="es"><![CDATA[¿Todavía vive Frank Herbert?]]></string>
<string lang="it"><![CDATA[Frank Herbert è ancora vivo?]]></string>
<string lang="fr"><![CDATA[Frank Herbert est-il encore en vie?]]></string>
<string lang="nl"><![CDATA[Leeft Frank Herbert nog?]]></string>
<string lang="ro"><![CDATA[Este Frank Herbert încă în viață?]]></string>
<keywords lang="en"><![CDATA[Frank Herbert, alive]]></keywords>
<keywords lang="de"><![CDATA[Frank Herbert, leben]]></keywords>
<keywords lang="es"><![CDATA[Frank Herbert, vive]]></keywords>
<keywords lang="it"><![CDATA[Frank Herbert, vivente]]></keywords>
<keywords lang="fr"><![CDATA[Frank Herbert, en vie]]></keywords>
<keywords lang="nl"><![CDATA[Frank Herbert, leeft]]></keywords>
<keywords lang="ro"><![CDATA[Frak Herbert, în viață]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        OPTIONAL { res:Frank_Herbert dbo:deathDate ?date . }
        FILTER (!BOUND(?date))
}]]></query>
<answers>
<answer>
<boolean>True</boolean>
</answer>
</answers>
</question>
