<?xml version="1.0" ?>
<dataset id="qald-4_multilingual_train">
<question aggregation="true" answertype="number" id="132" onlydbo="true">
<string lang="en"><![CDATA[How often did Jane Fonda marry?]]></string>
<string lang="de"><![CDATA[Wie oft hat Jane Fonda geheiratet?]]></string>
<string lang="es"><![CDATA[¿Cuántas veces ha estado casada Jane Fonda?]]></string>
<string lang="it"><![CDATA[Quante volte si è sposata Jane Fonda?]]></string>
<string lang="fr"><![CDATA[Combien de fois s'est mariée Jane Fonda?]]></string>
<string lang="nl"><![CDATA[Hoe vaak is Jane Fonda getrouwd?]]></string>
<string lang="ro"><![CDATA[Cât de des s-a măritat Jane Fonda?]]></string>
<keywords lang="en"><![CDATA[Jane Fonda, marry, how often]]></keywords>
<keywords lang="de"><![CDATA[Jane Fonda, heiraten, wie oft]]></keywords>
<keywords lang="es"><![CDATA[Jane Fonda, casada, cuántas veces]]></keywords>
<keywords lang="it"><![CDATA[Jane Fonda, sposata, quante volte]]></keywords>
<keywords lang="fr"><![CDATA[Jane Fonda, marriages, nombre de fois]]></keywords>
<keywords lang="nl"><![CDATA[Jane Fonda, getrouwd, hoe vaak]]></keywords>
<keywords lang="ro"><![CDATA[Jane Fonda, mărita, cât de des]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT COUNT(DISTINCT ?uri) 
WHERE { 
        res:Jane_Fonda dbo:spouse ?uri . 
}]]></query>
<answers>
<answer>
<number>3</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="181" onlydbo="true">
<string lang="en"><![CDATA[Which books by Kerouac were published by Viking Press?]]></string>
<string lang="de"><![CDATA[Welche Bücher von Kerouac wurden von Viking Press verlegt?]]></string>
<string lang="es"><![CDATA[¿Qué libros de Kerouac han sido publicados por Viking Press?]]></string>
<string lang="it"><![CDATA[Quali libri di Kerouac furono pubblicati da Viking Press?]]></string>
<string lang="fr"><![CDATA[Quels lives de Kerouac ont été publiés par Viking Press?]]></string>
<string lang="nl"><![CDATA[Welke boeken van Jack Kerouac werden uitgegeven door Viking Press?]]></string>
<string lang="ro"><![CDATA[Ce cărți de Kerouac a fost publicate de Viking Press?]]></string>
<keywords lang="en"><![CDATA[book, Kerouac, publish, Viking Press]]></keywords>
<keywords lang="de"><![CDATA[Buch, Kerouac, verlegen, Viking Press]]></keywords>
<keywords lang="es"><![CDATA[libro, Kerouac, publicado, Viking Press]]></keywords>
<keywords lang="it"><![CDATA[libro, Kerouac, pubblicare, Viking Press]]></keywords>
<keywords lang="fr"><![CDATA[lives de Kerouac, publiés, Viking Press]]></keywords>
<keywords lang="nl"><![CDATA[boek, Jack Kerouac, uitgever, Viking Press]]></keywords>
<keywords lang="ro"><![CDATA[carte, Kerouac, publica, Viking Press]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Book .
        ?uri dbo:publisher res:Viking_Press .
        ?uri dbo:author res:Jack_Kerouac .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/On_the_Road</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Dharma_Bums</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/References_in_On_the_Road</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Atop_an_Underwood:_Early_Stories_and_Other_Writings</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Door_Wide_Open</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="string" id="56" onlydbo="false">
<string lang="en"><![CDATA[What is the official website of Tom Cruise?]]></string>
<string lang="de"><![CDATA[Was ist die offizielle Website von Tom Cruise?]]></string>
<string lang="es"><![CDATA[¿Cuál el la página de Web oficial de Tom Cruise?]]></string>
<string lang="it"><![CDATA[Qual è il sito internet ufficiale di Tom Cruise?]]></string>
<string lang="fr"><![CDATA[Quel est le site web officiel de Tom Cruise?]]></string>
<string lang="nl"><![CDATA[Wat is de officiële website van Tom Cruise?]]></string>
<string lang="ro"><![CDATA[Care este website-ul oficial al lui Tom Cruise?]]></string>
<keywords lang="en"><![CDATA[Tom Cruise, official website]]></keywords>
<keywords lang="de"><![CDATA[Tom Cruise, offizielle Website]]></keywords>
<keywords lang="es"><![CDATA[Tom Cruise, página de Web oficial]]></keywords>
<keywords lang="it"><![CDATA[Tom Cruise, sito internet ufficiale]]></keywords>
<keywords lang="fr"><![CDATA[site web officiel, Tom Cruise]]></keywords>
<keywords lang="nl"><![CDATA[officiële website, Tom Cruise]]></keywords>
<keywords lang="ro"><![CDATA[Tom Cruise, website oficial]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?string 
WHERE { 
        res:Tom_Cruise dbp:website ?string .
}]]></query>
<answers>
<answer>
<uri>http://www.tomcruise.com/</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="30" onlydbo="false">
<string lang="en"><![CDATA[Which U.S. state has the highest population density?]]></string>
<string lang="de"><![CDATA[Welcher Staat in den USA hat die höchste Bevölkerungsdichte?]]></string>
<string lang="es"><![CDATA[¿Que estado de los estados unidos de america tiene la mayor densidad de población?]]></string>
<string lang="it"><![CDATA[Quale stato americano ha la densità di popolazione maggiore?]]></string>
<string lang="fr"><![CDATA[Quel état des Etats-Unis a la plus haute densité de population?]]></string>
<string lang="nl"><![CDATA[Welke deelstaat van de Verenigde Staten heeft de hoogste bevolkingsdichtheid?]]></string>
<string lang="ro"><![CDATA[Ce stat American are cea mai mare densitate a populației?]]></string>
<keywords lang="en"><![CDATA[state, USA, population density, highest]]></keywords>
<keywords lang="de"><![CDATA[Staat, USA, Bevölkerungsdichte, höchste]]></keywords>
<keywords lang="es"><![CDATA[estado, estados unidos de america, densidad de población]]></keywords>
<keywords lang="it"><![CDATA[stato, Stati Uniti d'America, maggiore densità di popolazione]]></keywords>
<keywords lang="fr"><![CDATA[densité de population, état des Etats-Unis]]></keywords>
<keywords lang="nl"><![CDATA[deelstaat van de Verenigde Staten, hoogste bevolkingsdichtheid]]></keywords>
<keywords lang="ro"><![CDATA[stat, Statele Unite ale Americii, densitatea populației, cea mai mare]]></keywords>
<query><![CDATA[PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type yago:StatesOfTheUnitedStates .
        ?uri dbp:densityrank ?rank .
} 
ORDER BY ASC(?rank) 
OFFSET 0 LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Wisconsin</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="62" onlydbo="true">
<string lang="en"><![CDATA[Who created Wikipedia?]]></string>
<string lang="de"><![CDATA[Wer hat Wikipedia gegründet?]]></string>
<string lang="es"><![CDATA[¿Quién creó Wikipedia?]]></string>
<string lang="it"><![CDATA[Chi ha creato Wikipedia?]]></string>
<string lang="fr"><![CDATA[Qui est le créateur de Wikipedia?]]></string>
<string lang="nl"><![CDATA[Wie heeft Wikipedia opgericht?]]></string>
<string lang="ro"><![CDATA[Cine a creat Wikipedia?]]></string>
<keywords lang="en"><![CDATA[Wikipedia, created]]></keywords>
<keywords lang="de"><![CDATA[Wikipedia, gründen]]></keywords>
<keywords lang="es"><![CDATA[Wikipedia, creador]]></keywords>
<keywords lang="it"><![CDATA[Wikipedia, creatore]]></keywords>
<keywords lang="fr"><![CDATA[créateur, Wikipedia]]></keywords>
<keywords lang="nl"><![CDATA[Wikipedia, oprichter]]></keywords>
<keywords lang="ro"><![CDATA[Wikipedia, creat]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Wikipedia dbo:author ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Jimmy_Wales</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Larry_Sanger</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="76" onlydbo="true">
<string lang="en"><![CDATA[How many films did Hal Roach produce?]]></string>
<string lang="de"><![CDATA[Wieviele Filme hat Hal Roach produziert?]]></string>
<string lang="es"><![CDATA[¿Cuántas películas ha producido Hal Roach?]]></string>
<string lang="it"><![CDATA[Quanti film ha prodotto Hal Roach?]]></string>
<string lang="fr"><![CDATA[Combien de films ont été produit par Hal Roach?]]></string>
<string lang="nl"><![CDATA[Hoeveel films heeft Hal Roach geproduceerd?]]></string>
<string lang="ro"><![CDATA[Câte filme a produs Hal Roach?]]></string>
<keywords lang="en"><![CDATA[Hal Roach, produce, film]]></keywords>
<keywords lang="de"><![CDATA[Hal Roach, produzieren, Film]]></keywords>
<keywords lang="es"><![CDATA[películas, producido, Hal Roach]]></keywords>
<keywords lang="it"><![CDATA[film, prodotto, Hal Roach]]></keywords>
<keywords lang="fr"><![CDATA[combien, films, Hal Roach]]></keywords>
<keywords lang="nl"><![CDATA[Hal Roach, producent, film]]></keywords>
<keywords lang="ro"><![CDATA[Hal Roach, produs, film]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
SELECT COUNT(DISTINCT ?uri) 
WHERE {
        ?uri dbo:producer res:Hal_Roach .
}]]></query>
<answers>
<answer>
<number>512</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="10" onlydbo="true">
<string lang="en"><![CDATA[In which country does the Nile start?]]></string>
<string lang="de"><![CDATA[In welchem Land entspringt der Nil?]]></string>
<string lang="es"><![CDATA[¿En qué país nace el Nilo?]]></string>
<string lang="it"><![CDATA[In quale stato nasce il Nilo?]]></string>
<string lang="fr"><![CDATA[Dans quel pays commence le Nil?]]></string>
<string lang="nl"><![CDATA[In welk land ontspringt de Nijl?]]></string>
<string lang="ro"><![CDATA[Din ce țară izvorăște Nilul?]]></string>
<keywords lang="en"><![CDATA[Nile, start, country]]></keywords>
<keywords lang="de"><![CDATA[Nil, entspringen, Land]]></keywords>
<keywords lang="es"><![CDATA[Nilo, país, orígen]]></keywords>
<keywords lang="it"><![CDATA[Nilo, stato, origine]]></keywords>
<keywords lang="fr"><![CDATA[pays, commence, Nil]]></keywords>
<keywords lang="nl"><![CDATA[ontspringt, Nijl]]></keywords>
<keywords lang="ro"><![CDATA[Nil, izvor, țară]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Nile dbo:sourceCountry ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Rwanda</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ethiopia</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="53" onlydbo="true">
<string lang="en"><![CDATA[Give me all federal chancellors of Germany.]]></string>
<string lang="de"><![CDATA[Gib mir alle Bundeskanzler.]]></string>
<string lang="es"><![CDATA[Dame todos los cancilleres alemanos.]]></string>
<string lang="it"><![CDATA[Dammi tutti i cancellieri tedeschi.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les chancelièrs allemands.]]></string>
<string lang="nl"><![CDATA[Noem alle Duitse bondskanseliers.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți cancelarii federali ai Germaniei]]></string>
<keywords lang="en"><![CDATA[Germany, federal chancellors]]></keywords>
<keywords lang="de"><![CDATA[Bundeskanzler]]></keywords>
<keywords lang="es"><![CDATA[cancilleres, alemanos]]></keywords>
<keywords lang="it"><![CDATA[cancellieri, tedeschi]]></keywords>
<keywords lang="fr"><![CDATA[chanceliers, allemands]]></keywords>
<keywords lang="nl"><![CDATA[Duits, bondskanseliers]]></keywords>
<keywords lang="ro"><![CDATA[Germania, cancelar federal]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        ?uri dbp:office res:Chancellor_of_Germany . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Konrad_Adenauer</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kurt_Georg_Kiesinger</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Helmut_Kohl</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ludwig_Erhard</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Helmut_Schmidt</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Willy_Brandt</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Angela_Merkel</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gerhard_Schr%C3%B6der</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="8" onlydbo="false">
<string lang="en"><![CDATA[Which states of Germany are governed by the Social Democratic Party?]]></string>
<string lang="de"><![CDATA[Welche Bundesländer in Deutschland werden von der SPD regiert?]]></string>
<string lang="es"><![CDATA[¿En qué estados federales de Alemania gobierna la SPD?]]></string>
<string lang="it"><![CDATA[In quali stati federati della Germania governa il Partito Socialista Democratico?]]></string>
<string lang="fr"><![CDATA[Quels sont les états d'Allemagne gouvernés par le parti social-démocrate d'Allemagne?]]></string>
<string lang="nl"><![CDATA[In welke Duitse deelstaten is de SPD aan de macht?]]></string>
<string lang="ro"><![CDATA[Ce state germane sunt guvernate de Partidul Social Democrat?]]></string>
<keywords lang="en"><![CDATA[state, Germany, govern, Social Democratic Party]]></keywords>
<keywords lang="de"><![CDATA[Deutschland, Bundesland, regieren, SPD]]></keywords>
<keywords lang="es"><![CDATA[estado federal, Alemania, gobierna, SPD]]></keywords>
<keywords lang="it"><![CDATA[stato federato, Germania, governo, Partito Socialista Democratico]]></keywords>
<keywords lang="fr"><![CDATA[états d'Allemagne, parti social-démocrate d'Allemagne, gouvernés]]></keywords>
<keywords lang="nl"><![CDATA[Duitse deelstaat, SPD, aan de macht]]></keywords>
<keywords lang="ro"><![CDATA[stat, Germania, guverna, Partidul Social Democrat]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
          ?uri rdf:type yago:StatesOfGermany .
        { ?uri dbo:leaderParty res:Social_Democratic_Party_of_Germany . }
        UNION
        { ?uri dbp:rulingParty 'SPD'@en . } 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Berlin</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Saarland</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Schleswig-Holstein</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mecklenburg-Vorpommern</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Brandenburg</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Hamburg</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lower_Saxony</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rhineland-Palatinate</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Thuringia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Saxony-Anhalt</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/North_Rhine-Westphalia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Baden-W%C3%BCrttemberg</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bremen_(state)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="4" onlydbo="true">
<string lang="en"><![CDATA[Which river does the Brooklyn Bridge cross?]]></string>
<string lang="de"><![CDATA[Welchen Fluss überspannt die Brooklyn Bridge?]]></string>
<string lang="es"><![CDATA[¿Por qué río cruza la Brooklyn Bridge?]]></string>
<string lang="it"><![CDATA[Quale fiume attraversa il ponte di Brooklyn?]]></string>
<string lang="fr"><![CDATA[Quelle cours d'eau est traversé par le pont de Brooklyn?]]></string>
<string lang="nl"><![CDATA[Welke rivier overspant de Brooklyn Bridge?]]></string>
<string lang="ro"><![CDATA[Ce râu traversează podul din Brooklyn?]]></string>
<keywords lang="en"><![CDATA[river, cross, Brooklyn Bridge]]></keywords>
<keywords lang="de"><![CDATA[Fluss, überspannen, Brooklyn Bridge]]></keywords>
<keywords lang="es"><![CDATA[río, cruza, Brooklyn Bridge]]></keywords>
<keywords lang="it"><![CDATA[fiume, attraversare, ponte di Brooklyn]]></keywords>
<keywords lang="fr"><![CDATA[cours d'eau, pont de Brooklyn]]></keywords>
<keywords lang="nl"><![CDATA[rivier, Brooklyn Bridge, overspant]]></keywords>
<keywords lang="ro"><![CDATA[râu, traversează, podul din Brooklyn]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {       
        res:Brooklyn_Bridge dbo:crosses ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/East_River</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="number" id="14" onlydbo="true">
<string lang="en"><![CDATA[How tall is Claudia Schiffer?]]></string>
<string lang="de"><![CDATA[Wie groß ist Claudia Schiffer?]]></string>
<string lang="es"><![CDATA[¿Cómo de alta es Claudia Schiffer?]]></string>
<string lang="it"><![CDATA[Quanto è alta Claudia Schiffer?]]></string>
<string lang="fr"><![CDATA[Quelle est la taille de Claudia Schiffer?]]></string>
<string lang="nl"><![CDATA[Hoe lang is Claudia Schiffer?]]></string>
<string lang="ro"><![CDATA[Ce înălțime are Claudia Schiffer?]]></string>
<keywords lang="en"><![CDATA[Claudia Schiffer, tall]]></keywords>
<keywords lang="de"><![CDATA[Claudia Schiffer, groß]]></keywords>
<keywords lang="es"><![CDATA[Claudia Schiffer, altura]]></keywords>
<keywords lang="it"><![CDATA[Claudia Schiffer, altezza]]></keywords>
<keywords lang="fr"><![CDATA[taille, Claudia Schiffer]]></keywords>
<keywords lang="nl"><![CDATA[lengte, Claudia Schiffer]]></keywords>
<keywords lang="ro"><![CDATA[Claudia Schiffer, înălțime]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?height 
WHERE { 
        res:Claudia_Schiffer dbo:height ?height . 
}]]></query>
<answers>
<answer>
<number>1.81</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="23" onlydbo="true">
<string lang="en"><![CDATA[Which television shows were created by Walt Disney?]]></string>
<string lang="de"><![CDATA[Welche Fernsehserien hat Walt Disney entworfen?]]></string>
<string lang="es"><![CDATA[¿Qué series televisivas ideó Walt Disney?]]></string>
<string lang="it"><![CDATA[Quali serie televisive sono state create dalla Walt Disney?]]></string>
<string lang="fr"><![CDATA[Quelles séries télevisées ont été créées par Walt Disney?]]></string>
<string lang="nl"><![CDATA[Welke televisieseries werden bedacht door Walt Disney?]]></string>
<string lang="ro"><![CDATA[Ce seriale de televiziune au fost create de Walt Disney?]]></string>
<keywords lang="en"><![CDATA[television show, create, Walt Disney]]></keywords>
<keywords lang="de"><![CDATA[Fernsehserie, entwerfen, Walt Disney]]></keywords>
<keywords lang="es"><![CDATA[serie televisica, ideó, Walt Disney]]></keywords>
<keywords lang="it"><![CDATA[serie televisiva, ideata, Walt Disney?]]></keywords>
<keywords lang="fr"><![CDATA[séries télevisées, créées, Walt Disney]]></keywords>
<keywords lang="nl"><![CDATA[televisieserie, bedacht, Walt Disney]]></keywords>
<keywords lang="ro"><![CDATA[serial de televiziune, creat, Walt Disney]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:TelevisionShow .
        ?uri dbo:creator res:Walt_Disney .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/The_Mickey_Mouse_Club</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Walt_Disney_anthology_television_series</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/List_of_Jiminy_Cricket_educational_serials</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="17" onlydbo="true">
<string lang="en"><![CDATA[Give me all cities in New Jersey with more than 100000 inhabitants.]]></string>
<string lang="de"><![CDATA[Gib mir alle Städte in New Jersey, die mehr als 100000 Einwohner haben.]]></string>
<string lang="es"><![CDATA[Dame todas las cuidades en New Jersey que tengan más de 100000 habitantes.]]></string>
<string lang="it"><![CDATA[Dammi tutte le città del New Jersey con più di 100000 abitanti.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les villes du New Jersey avec plus de 100000 habitants.]]></string>
<string lang="nl"><![CDATA[Geef alle steden in New Jersey met meer dan 100000 inwoners.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate orașele din New Jersey cu mai mult de 100000 de locuitori.]]></string>
<keywords lang="en"><![CDATA[New Jersey, city, inhabitants, more than 100000]]></keywords>
<keywords lang="de"><![CDATA[New Jersey, Stadt, Einwohner, mehr als 100000]]></keywords>
<keywords lang="es"><![CDATA[New Jersey, ciudad, habitantes, más de 100000]]></keywords>
<keywords lang="it"><![CDATA[New Jersey, città, abitanti, più di 100000]]></keywords>
<keywords lang="fr"><![CDATA[New Jersey, villes, habitants, plus de 100000]]></keywords>
<keywords lang="nl"><![CDATA[New Jersey, stad, inwoners, meer dan 100000]]></keywords>
<keywords lang="ro"><![CDATA[New Jersey, oraș, locuitori, mai mult de 100000]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:City .  
        ?uri dbo:isPartOf res:New_Jersey .  
        ?uri dbo:populationTotal ?inhabitants . 
        FILTER (?inhabitants > 100000) . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Newark,_New_Jersey</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jersey_City,_New_Jersey</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Paterson,_New_Jersey</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Elizabeth,_New_Jersey</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="68" onlydbo="true">
<string lang="en"><![CDATA[Which actors were born in Germany?]]></string>
<string lang="de"><![CDATA[Welche Schauspieler wurden in Deutschland geboren?]]></string>
<string lang="es"><![CDATA[¿Qué actores nacieron en Alemania?]]></string>
<string lang="it"><![CDATA[Quali attori sono nati in Germania?]]></string>
<string lang="fr"><![CDATA[Quels acteurs sont nés en Allemagne?]]></string>
<string lang="nl"><![CDATA[Welke acteurs zijn geboren in Duitsland?]]></string>
<string lang="ro"><![CDATA[Ce actori au fost născuți în Germania?]]></string>
<keywords lang="en"><![CDATA[actor, born, Germany]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, geboren, Deutschland]]></keywords>
<keywords lang="es"><![CDATA[Actores, nacidos, Alemania]]></keywords>
<keywords lang="it"><![CDATA[attore, nato, Germania]]></keywords>
<keywords lang="fr"><![CDATA[acteurs, nés, Allemagne]]></keywords>
<keywords lang="nl"><![CDATA[acteur, geboren, Duitsland]]></keywords>
<keywords lang="ro"><![CDATA[actor, născut, Germania]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Actor .
      { ?uri dbo:birthPlace res:Germany . }
      UNION 
      { ?uri dbo:birthPlace ?place .
        ?place dbo:country res:Germany . }
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Briana_Banks</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Michaela_Schaffrath</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Vince_Rockland</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Julie_K._Smith</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kelly_Trump</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Karin_Schubert</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Dru_Berrymore</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Shy_Love</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Axel_Anderson</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Caroline_Welz</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Annette_Schwarz</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Harry_S._Morgan</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Amy_Ried</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Freddy_Dalton</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Susan_Wayland</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tyra_Misoux</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Victoria_Sin</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Janine_Chang</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Logan_McCree</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Till_Kraemer</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sascha_(pornographic_actor)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Katja_Kassin</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Thom_Barron</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Marcel_Schlutt</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ana_Nova</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Shimon_Schwarzschild</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="9" onlydbo="false">
<string lang="en"><![CDATA[In which U.S. state is Mount McKinley located?]]></string>
<string lang="de"><![CDATA[In welchem US-Bundesstaat befindet sich der Mount McKinley?]]></string>
<string lang="es"><![CDATA[¿En qué estado de los estados unidos se encuentra el monte McKinley?]]></string>
<string lang="it"><![CDATA[In quale stato degli Stati Uniti si trova il Monte McKinley?]]></string>
<string lang="fr"><![CDATA[Dans quel état des Etats-Unis d'Amérique se trouve le mont McKinley?]]></string>
<string lang="nl"><![CDATA[In welke deelstaat van de Verenigde Staten is Mount McKinley gelegen?]]></string>
<string lang="ro"><![CDATA[În ce stat american se află muntele McKinley?]]></string>
<keywords lang="en"><![CDATA[U.S. state, located, Mount McKinley]]></keywords>
<keywords lang="de"><![CDATA[US-Staat, befinden, Mount McKinley]]></keywords>
<keywords lang="es"><![CDATA[estado, estados unidos de américa, encuentra, monte McKinley]]></keywords>
<keywords lang="it"><![CDATA[Stati Uniti d'America, trova, Mount McKinley]]></keywords>
<keywords lang="fr"><![CDATA[états, Etats-Unis d'Amérique, trouve, mont McKinley]]></keywords>
<keywords lang="nl"><![CDATA[deelstaat, Verenigde Staten, gelegen, Mount McKinley]]></keywords>
<keywords lang="ro"><![CDATA[stat american, aflat, muntele McKinley]]></keywords>
<query><![CDATA[PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type yago:StatesOfTheUnitedStates .
        res:Mount_McKinley dbo:locatedInArea ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Alaska</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="119" onlydbo="true">
<string lang="en"><![CDATA[Give me all people that were born in Vienna and died in Berlin.]]></string>
<string lang="de"><![CDATA[Gib mir alle Personen, die in Wien geboren wurden und in Berlin gestorben sind.]]></string>
<string lang="es"><![CDATA[Dame todas las personas que hayan nacido en Viena y hayan muerto en Berlin.]]></string>
<string lang="it"><![CDATA[Dammi tutte le persone che sono nate a Vienna e morte a Berlino.]]></string>
<string lang="fr"><![CDATA[Donne-moi toutes les personnes qui sont nées à Vienne et mortes à Berlin.]]></string>
<string lang="nl"><![CDATA[Noem alle personen die geboren zijn in Wenen en gestorven zijn in Berlijn.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți oamenii care s-au născut în Viena și au murit în Berlin.]]></string>
<keywords lang="en"><![CDATA[people, born, Vienna, die, Berlin]]></keywords>
<keywords lang="de"><![CDATA[Person, geboren, Wien, gestorben, Berlin]]></keywords>
<keywords lang="es"><![CDATA[personas, nacidas en Viena, muertas en Berlin]]></keywords>
<keywords lang="it"><![CDATA[persona, nata, Vienna, morta, Berlino]]></keywords>
<keywords lang="fr"><![CDATA[personnes, nées, Vienne, mortes, Berlin]]></keywords>
<keywords lang="nl"><![CDATA[persoon, geboren, Wenen, gestorven, Berlijn]]></keywords>
<keywords lang="ro"><![CDATA[oameni, născut, Viena, murit, Berlin]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:birthPlace res:Vienna . 
        ?uri dbo:deathPlace res:Berlin . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Erik_Jan_Hanussen</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Hilde_K%C3%B6rber</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Karl_Hellmer</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Karl_Etlinger</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Grete_von_Zieritz</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Peter_Sturm</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Therese_Gr%C3%BCnbaum</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Alfred_Halm</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Richard_Thurnwald</uri>
</answer>
</answers>
</question>
