<?xml version="1.0" ?>
<dataset id="qald-4_multilingual_train">
<question aggregation="false" answertype="boolean" id="27" onlydbo="true">
<string lang="en"><![CDATA[Was U.S. president Jackson involved in a war?]]></string>
<string lang="de"><![CDATA[War US-Präsident Jackson in einen Krieg verwickelt?]]></string>
<string lang="es"><![CDATA[¿Estuvo el el presidente de los estados unidos Jackson involucrado en una guerra?]]></string>
<string lang="it"><![CDATA[Il presidente degli Stati Uniti Jackson è stato coinvolto in una guerra?]]></string>
<string lang="fr"><![CDATA[Le président Jackson a-t-il participé à une guerre?]]></string>
<string lang="nl"><![CDATA[Was president Jackson van de Verenigde Staten betrokken bij een oorlog?]]></string>
<string lang="ro"><![CDATA[A fost președintele american Jackson implicat într-un război?]]></string>
<keywords lang="en"><![CDATA[U.S. president, Jackson, war]]></keywords>
<keywords lang="de"><![CDATA[US-Präsident, Jackson, Krieg]]></keywords>
<keywords lang="es"><![CDATA[presidente de los estados unidos, Jackson, guerra]]></keywords>
<keywords lang="it"><![CDATA[presidente degli Stati Uniti, Jackson, guerra]]></keywords>
<keywords lang="fr"><![CDATA[président Jackson, guerre, participé]]></keywords>
<keywords lang="nl"><![CDATA[president van de Verenigde Staten, Jackson, oorlog, betrokken bij]]></keywords>
<keywords lang="ro"><![CDATA[președinte american, Jackson, război]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        res:Andrew_Jackson dbo:battle ?battle .    
}]]></query>
<answers>
<answer>
<boolean>True</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="18" onlydbo="true">
<string lang="en"><![CDATA[Which museum exhibits The Scream by Munch?]]></string>
<string lang="de"><![CDATA[In welchem Museum ist Der Schrei von Munch ausgestellt?]]></string>
<string lang="es"><![CDATA[¿En qué museo está expuesto el Grito de Munch?]]></string>
<string lang="it"><![CDATA[In quale museo è esposto l'Urlo di Munch?]]></string>
<string lang="fr"><![CDATA[Dans quel musée est exposé Le Cri de Munch?]]></string>
<string lang="nl"><![CDATA[In welk museum hangt De Schreeuw van Munch?]]></string>
<string lang="ro"><![CDATA[În ce muzeu este expus “Strigătul” lui Munch?]]></string>
<keywords lang="en"><![CDATA[museum, Scream, Munch]]></keywords>
<keywords lang="de"><![CDATA[Museum, Schrei, Munch]]></keywords>
<keywords lang="es"><![CDATA[museo, El Grito, Munch]]></keywords>
<keywords lang="it"><![CDATA[museo, l'Urlo, Munch]]></keywords>
<keywords lang="fr"><![CDATA[musée, le Cri, Munch]]></keywords>
<keywords lang="nl"><![CDATA[museum, De Schreeuw, Munch]]></keywords>
<keywords lang="ro"><![CDATA[muzeu, Strigătul, Munch]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
       res:The_Scream dbo:museum ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/National_Gallery_of_Norway</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/National_Gallery,_Oslo</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="199" onlydbo="true">
<string lang="en"><![CDATA[For which label did Elvis record his first album?]]></string>
<string lang="de"><![CDATA[Welche Plattenfirma hat Elvis' erstes Album aufgenommen?]]></string>
<string lang="es"><![CDATA[¿Qué discográfica grabó el primer album de Elvis?]]></string>
<string lang="it"><![CDATA[Quale casa discografica ha inciso il primo album di Elvis?]]></string>
<string lang="fr"><![CDATA[Quel est le label discographe qui a publié le premier disque d'Elvis?]]></string>
<string lang="nl"><![CDATA[Bij welk platenlabel verscheen het eerste album van Elvis Presley?]]></string>
<string lang="ro"><![CDATA[Ce casă discografică a înregistrat primul album al lui Elvis?]]></string>
<keywords lang="en"><![CDATA[Elvis, first, album, label]]></keywords>
<keywords lang="de"><![CDATA[Elvis, erstes, Album, Plattenfirma]]></keywords>
<keywords lang="es"><![CDATA[discográfica, primer album de Elvis]]></keywords>
<keywords lang="it"><![CDATA[Elvis, primo, album, casa discografica]]></keywords>
<keywords lang="fr"><![CDATA[label discographe, publié, premier disque, Elvis]]></keywords>
<keywords lang="nl"><![CDATA[platenlabel, eerste album, Elvis Presley]]></keywords>
<keywords lang="ro"><![CDATA[Elvis, prim, album, casă discografică]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?x rdf:type dbo:Album .
        ?x dbo:artist res:Elvis_Presley .
        ?x dbo:releaseDate ?y .
        ?x dbo:recordLabel ?uri .
}
ORDER BY ASC(?y) 
OFFSET 0 LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/RCA_Victor</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="16" onlydbo="false">
<string lang="en"><![CDATA[Give me the capitals of all countries in Africa.]]></string>
<string lang="de"><![CDATA[Gib mir die Haupstädte von allen Ländern in Afrika.]]></string>
<string lang="es"><![CDATA[Dame las capitales de todos los países africanos.]]></string>
<string lang="it"><![CDATA[Dammi le capitali di tutti gli stati dell'Africa.]]></string>
<string lang="fr"><![CDATA[Donnes-moi la capitale de chaque pays d'Afrique.]]></string>
<string lang="nl"><![CDATA[Noem de hoofdsteden van alle landen in Afrika.]]></string>
<string lang="ro"><![CDATA[Dă-mi capitalele tuturor țărilor din Africa.]]></string>
<keywords lang="en"><![CDATA[Africa, country, capital]]></keywords>
<keywords lang="de"><![CDATA[Afrika, Land, Hauptstadt]]></keywords>
<keywords lang="es"><![CDATA[países, africanos, capital]]></keywords>
<keywords lang="it"><![CDATA[Africa, stato, capitale]]></keywords>
<keywords lang="fr"><![CDATA[capitale, pays, Afrique]]></keywords>
<keywords lang="nl"><![CDATA[Africa, land, hoof]]></keywords>
<keywords lang="ro"><![CDATA[Africa, țară, capitală]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX yago: <http://dbpedia.org/class/yago/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?states rdf:type yago:AfricanCountries . 
        ?states dbo:capital ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Luanda</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Porto-Novo</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gaborone</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ouagadougou</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Moroni,_Comoros</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Yaound%C3%A9</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bangui</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Malabo</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Libreville</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Accra</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bissau</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tripoli</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Maseru</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Monrovia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Antananarivo</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lilongwe</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bamako</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Port_Louis</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rabat</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Maputo</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Windhoek</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Niamey</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Abuja</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kigali</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Dakar</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Victoria,_Seychelles</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Freetown</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mogadishu</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Khartoum</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Dodoma</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lom%C3%A9</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tunis</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Harare</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lusaka</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Banjul</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kinshasa</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Addis_Ababa</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Nairobi</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Port_Mathurin</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Cairo</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Djibouti_(city)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Asmara</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Nouakchott</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Praia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Brazzaville</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bujumbura</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Juba</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="21" onlydbo="false">
<string lang="en"><![CDATA[Which states border Illinois?]]></string>
<string lang="de"><![CDATA[Welche Staaten grenzen an Illinois?]]></string>
<string lang="es"><![CDATA[¿Qué estados tienen frontera con Illinois?]]></string>
<string lang="it"><![CDATA[Con quali stati confina l'Illinois?]]></string>
<string lang="fr"><![CDATA[Quels sont les états voisins de l'Illinois?]]></string>
<string lang="nl"><![CDATA[Welke staten grenzen aan Illinois?]]></string>
<string lang="ro"><![CDATA[Ce state formează granite cu Illinois?]]></string>
<keywords lang="en"><![CDATA[state, border, Illinois]]></keywords>
<keywords lang="de"><![CDATA[Staat, angrenzen, Illinois]]></keywords>
<keywords lang="es"><![CDATA[estado, frontera, Illinois]]></keywords>
<keywords lang="it"><![CDATA[stati, confine, Illinois]]></keywords>
<keywords lang="fr"><![CDATA[états voisins, Illinois]]></keywords>
<keywords lang="nl"><![CDATA[staat, grenzen aan, Illinois]]></keywords>
<keywords lang="ro"><![CDATA[stat, granite, Illinois]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri 
WHERE {
        res:Illinois dbp:borderingstates ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Kentucky</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Missouri</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Wisconsin</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Indiana</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Iowa</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="159" onlydbo="false">
<string lang="en"><![CDATA[Which U.S. states are in the same time zone as Utah?]]></string>
<string lang="de"><![CDATA[Welche US-Bundesstaaten liegen in derselben Zeitzone wie Utah?]]></string>
<string lang="es"><![CDATA[¿Qué estados americanos se encuentran en la misma zona que Utah?]]></string>
<string lang="it"><![CDATA[Quali stati degli Stati Uniti d'America si trovano nello stesso fuso orario dello Utah?]]></string>
<string lang="fr"><![CDATA[Quels états américains sont dans le même fuseau horaire que l'Utah?]]></string>
<string lang="nl"><![CDATA[Welke staten van de Verenigde Staten liggen in dezelfde tijdzone als Utah?]]></string>
<string lang="ro"><![CDATA[Care state americane sunt pe același fus orar ca Utah?]]></string>
<keywords lang="en"><![CDATA[U.S. state, same, time zone, Utah]]></keywords>
<keywords lang="de"><![CDATA[US-Bundesstaat, dieselbe, Zeitzone, Utah]]></keywords>
<keywords lang="es"><![CDATA[estado americano, misma zona horaria, Utah]]></keywords>
<keywords lang="it"><![CDATA[stato degli Stati Uniti d'America, stesso, fuso orario, Utah]]></keywords>
<keywords lang="fr"><![CDATA[états américains, même fuseau horaire, Utah]]></keywords>
<keywords lang="nl"><![CDATA[Utah, zelfde tijdzone, staat van de Verenigde Staten]]></keywords>
<keywords lang="ro"><![CDATA[stat american, același, fus orar, Utah]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX yago: <http://dbpedia.org/class/yago/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Utah dbp:timezone ?x .  
        ?uri rdf:type yago:StatesOfTheUnitedStates .  
        ?uri dbp:timezone ?x . 
        FILTER (?uri != res:Utah) 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Colorado</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Nevada</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/North_Dakota</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/New_Mexico</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Oklahoma</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/South_Dakota</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Arizona</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="151" onlydbo="true">
<string lang="en"><![CDATA[Give me all islands that belong to Japan.]]></string>
<string lang="de"><![CDATA[Gib mir alle Inseln, die zu Japan gehören.]]></string>
<string lang="es"><![CDATA[Dame todas la islas que pertenezcan a Japón.]]></string>
<string lang="it"><![CDATA[Dammi tutte le isole che appartengono al Giappone.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les îles qui appartiennent aux Japon.]]></string>
<string lang="nl"><![CDATA[Geef alle eilanden die behoren tot Japan.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate insulele care aparțin Japoniei.]]></string>
<keywords lang="en"><![CDATA[islands, Japan]]></keywords>
<keywords lang="de"><![CDATA[Inseln, Japan]]></keywords>
<keywords lang="es"><![CDATA[islias, Japón]]></keywords>
<keywords lang="it"><![CDATA[isole, Giappone]]></keywords>
<keywords lang="fr"><![CDATA[îles, Japon]]></keywords>
<keywords lang="nl"><![CDATA[eilanden, Japan]]></keywords>
<keywords lang="ro"><![CDATA[insule, Japonia]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Island .  
        ?uri dbo:country res:Japan . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Kyushu</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Honshu</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Shikoku</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Iwo_Jima</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Minami-Tori-shima</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Awaji_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Minamidait%C5%8D</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Yonaguni</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Okinawa_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Amami_%C5%8Cshima</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Miyako-jima</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tsushima_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Yaeyama_Islands</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Taketomi_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Iriomote-jima</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Okinotorishima</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kitadait%C5%8D</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Yagishiri_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rishiri_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rebun_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Hateruma</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Daikon_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kozukumi_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Okushiri_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kume_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/I%C5%8Djima,_Kagoshima</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lot's_Wife_(crag)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kikai_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tori-shima_(Izu_Islands)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Teuri_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Hachij%C5%8D-kojima</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Aka_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/%C5%8Cshima,_Hokkaid%C5%8D</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kojima_(Hokkaido)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Nakanoshima_(Kagoshima)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kamome_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Smith_Island_(Japan)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tokashiki_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Zamami_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Geruma_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Fukaji_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kuchinoshima</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Inamba-jima</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Udone-shima</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/%C5%8Cnohara_Islands</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bayonnaise_Rocks</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Izena_Island</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jinai-t%C5%8D</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="44" onlydbo="false">
<string lang="en"><![CDATA[Who designed the Brooklyn Bridge?]]></string>
<string lang="de"><![CDATA[Wer hat die Brooklyn Bridge entworfen?]]></string>
<string lang="es"><![CDATA[¿Quién diseñó la Brooklyn Bridge?]]></string>
<string lang="it"><![CDATA[Chi ha progettato il ponte di Brooklyn?]]></string>
<string lang="fr"><![CDATA[Qui a conçu le pont de Brooklyn?]]></string>
<string lang="nl"><![CDATA[Wie ontwierp de Brooklyn Bridge?]]></string>
<string lang="ro"><![CDATA[Cine a proiectat podul din Brooklyn?]]></string>
<keywords lang="en"><![CDATA[Brooklyn Bridge, design]]></keywords>
<keywords lang="de"><![CDATA[Brooklyn Bridge, entwerfen]]></keywords>
<keywords lang="es"><![CDATA[diseñador, Brooklyn Bridge]]></keywords>
<keywords lang="it"><![CDATA[ponte di Brooklyn, progettare]]></keywords>
<keywords lang="fr"><![CDATA[pont de Brooklyn, conçu]]></keywords>
<keywords lang="nl"><![CDATA[ontwerp, Brooklyn Bridge]]></keywords>
<keywords lang="ro"><![CDATA[podul din Brooklyn, proiecta]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri 
WHERE {
        res:Brooklyn_Bridge dbp:designer ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/John_A._Roebling</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/John_Augustus_Roebling</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="75" onlydbo="true">
<string lang="en"><![CDATA[Who was the first president of the United States?]]></string>
<string lang="de"><![CDATA[Wer war der erste Präsident der Vereinigten Staaten?]]></string>
<string lang="es"><![CDATA[¿Quién era el primer presidente de los Estados Unidos?]]></string>
<string lang="it"><![CDATA[Chi è stato il primo presidente degli Stati Uniti?]]></string>
<string lang="fr"><![CDATA[Qui était le premier président des États-Unis?]]></string>
<string lang="nl"><![CDATA[Wie was de eerste president van de Verenigde Staten?]]></string>
<string lang="ro"><![CDATA[Cine a fost primul președinte ale Statelor Unite?]]></string>
<keywords lang="en"><![CDATA[United States, first president]]></keywords>
<keywords lang="de"><![CDATA[Vereinigte Staaten, erster Präsident]]></keywords>
<keywords lang="es"><![CDATA[estados unidos, primer presidente]]></keywords>
<keywords lang="it"><![CDATA[Stati Uniti, primo presidente]]></keywords>
<keywords lang="fr"><![CDATA[Etats-Unis, premier président]]></keywords>
<keywords lang="nl"><![CDATA[Verenigde Staten, eerste president]]></keywords>
<keywords lang="ro"><![CDATA[Statele Unite, primul președinte]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
         ?uri rdf:type dbo:Person .
         ?uri dbo:office '1st President of the United States'@en .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/George_Washington</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="40" onlydbo="true">
<string lang="en"><![CDATA[What is the highest mountain in Australia?]]></string>
<string lang="de"><![CDATA[Was ist der höchste Berg in Australien?]]></string>
<string lang="es"><![CDATA[¿Cuál es la montaña más alta de Australia?]]></string>
<string lang="it"><![CDATA[Qual è la montagna più alta d'Australia?]]></string>
<string lang="fr"><![CDATA[Quelle est la plus haute montagne d'Australie?]]></string>
<string lang="nl"><![CDATA[Wat is de hoogste berg van Australië?]]></string>
<string lang="ro"><![CDATA[Care este cel mai înalt munte din Australia?]]></string>
<keywords lang="en"><![CDATA[Australia, highest mountain]]></keywords>
<keywords lang="de"><![CDATA[Australien, höchster Berg]]></keywords>
<keywords lang="es"><![CDATA[Australia, montaña más alta]]></keywords>
<keywords lang="it"><![CDATA[Australia, montagna più alta]]></keywords>
<keywords lang="fr"><![CDATA[plus haute montagne, Australie]]></keywords>
<keywords lang="nl"><![CDATA[Australië, hoogste berg]]></keywords>
<keywords lang="ro"><![CDATA[Australia, cel mai înalt munte]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Mountain .
        ?uri dbo:locatedInArea res:Australia .
        ?uri dbo:elevation ?elevation .
} 
ORDER BY DESC(?elevation) 
OFFSET 0 LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Mawson_Peak</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="161" onlydbo="true">
<string lang="en"><![CDATA[How many space missions have there been?]]></string>
<string lang="de"><![CDATA[Wieviele Weltraummissionen gab es?]]></string>
<string lang="es"><![CDATA[¿Cuántas misiones espaciales ha habido?]]></string>
<string lang="it"><![CDATA[Quante missioni spaziali ci sono state?]]></string>
<string lang="fr"><![CDATA[Combien y a-t-il eu de vols spatials?]]></string>
<string lang="nl"><![CDATA[Hoeveel ruimtereizen zijn er geweest?]]></string>
<string lang="ro"><![CDATA[Câte misiuni spațiale au avut loc?]]></string>
<keywords lang="en"><![CDATA[space mission]]></keywords>
<keywords lang="de"><![CDATA[Weltraummission]]></keywords>
<keywords lang="es"><![CDATA[misiones espaciales]]></keywords>
<keywords lang="it"><![CDATA[missione spaziale]]></keywords>
<keywords lang="fr"><![CDATA[vols spatials, nombre]]></keywords>
<keywords lang="nl"><![CDATA[ruimtereis, hoeveel]]></keywords>
<keywords lang="ro"><![CDATA[misiune spațială]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT COUNT(DISTINCT ?uri) 
WHERE { 
        ?uri rdf:type dbo:SpaceMission . 
}]]></query>
<answers>
<answer>
<number>485</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="74" onlydbo="false">
<string lang="en"><![CDATA[Which capitals in Europe were host cities of the summer olympic games?]]></string>
<string lang="de"><![CDATA[In welchen europäischen Hauptstädten fanden olympische Sommerspiele statt?]]></string>
<string lang="es"><![CDATA[¿En qué capitales europeas tuvieron lugar los juegos olímpicos de verano?]]></string>
<string lang="it"><![CDATA[Quali capitali europee hanno ospitato i giochi olimpici estivi?]]></string>
<string lang="fr"><![CDATA[Quelles capitales européenes ont été hôtes de jeux olympiques d'été?]]></string>
<string lang="nl"><![CDATA[In welke Europese hoofdsteden waren de Olympische Zomerspelen?]]></string>
<string lang="ro"><![CDATA[Ce capitale europene au fost gazde ale Jocurile Olimpice de vară?]]></string>
<keywords lang="en"><![CDATA[capital, Europe, host city, summer olympic games]]></keywords>
<keywords lang="de"><![CDATA[europäisch, Hauptstadt, stattfinden, olympische Sommerspiele]]></keywords>
<keywords lang="es"><![CDATA[capital europea, juegos olímpicos de verano]]></keywords>
<keywords lang="it"><![CDATA[capitale, Europa, ospitare, giochi olimpici estivi]]></keywords>
<keywords lang="fr"><![CDATA[capitales européenes, hôtes, jeux olympiques d'été]]></keywords>
<keywords lang="nl"><![CDATA[Europese hoofdstad, plaatvinden, Olympische Zomerspelen]]></keywords>
<keywords lang="ro"><![CDATA[capital, Europa, oraș gazdă, Jocurile Olimpice]]></keywords>
<query><![CDATA[PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type yago:CapitalsInEurope .
        ?uri rdf:type yago:HostCitiesOfTheSummerOlympicGames .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Amsterdam</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Athens</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Berlin</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Helsinki</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/London</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Moscow</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Paris</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rome</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Stockholm</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="54" onlydbo="true">
<string lang="en"><![CDATA[Who was the wife of U.S. president Lincoln?]]></string>
<string lang="de"><![CDATA[Wer war die Frau von US-Präsident Lincoln?]]></string>
<string lang="es"><![CDATA[¿Quién fué la mujer del presidente americano Lincoln?]]></string>
<string lang="it"><![CDATA[Chi era la moglie del presidente degli Stati Uniti Lincoln?]]></string>
<string lang="fr"><![CDATA[Qui était l'épouse du président américain Lincoln?]]></string>
<string lang="nl"><![CDATA[Wie was de vrouw van de Amerikaanse president Lincoln?]]></string>
<string lang="ro"><![CDATA[Cine a fost soția președintelui American Lincoln?]]></string>
<keywords lang="en"><![CDATA[U.S. president, Lincoln, wife]]></keywords>
<keywords lang="de"><![CDATA[US-Präsident, Lincoln, Frau]]></keywords>
<keywords lang="es"><![CDATA[presidente Americano, Lincoln, mujer]]></keywords>
<keywords lang="it"><![CDATA[presidente degli Stati Uniti, Lincoln, moglie]]></keywords>
<keywords lang="fr"><![CDATA[épouse, président américain Lincoln]]></keywords>
<keywords lang="nl"><![CDATA[vrouw, president van America, Lincoln]]></keywords>
<keywords lang="ro"><![CDATA[președinte American, Lincoln, soție]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:Abraham_Lincoln dbo:spouse ?uri.
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Mary_Todd_Lincoln</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="129" onlydbo="true">
<string lang="en"><![CDATA[Give me all actors starring in movies directed by William Shatner.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schauspieler von Filmen, in denen William Shatner Regie geführt hat.]]></string>
<string lang="es"><![CDATA[Dame todos los actores de películas dirigidas por William Shatner.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli attori che recitano in film diretti da William Shatner.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les acteurs qui ont joué dans des films réalisés par Williams Shatner.]]></string>
<string lang="nl"><![CDATA[Geef alle acteurs van films waar William Shatner de regie van voerde.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți actorii care joacă roluri principale în filme regizate de William Shatner.]]></string>
<keywords lang="en"><![CDATA[actor, starring, movie, direct, William Shatner]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, Film, Regie, William Shatner]]></keywords>
<keywords lang="es"><![CDATA[actor, película, director, William Shatner]]></keywords>
<keywords lang="it"><![CDATA[attore, recitare, film, diretto, William Shatner]]></keywords>
<keywords lang="fr"><![CDATA[acteur, film, réalisé, William Shatner]]></keywords>
<keywords lang="nl"><![CDATA[acteur, film, regisseur, William Shatner]]></keywords>
<keywords lang="ro"><![CDATA[actor, rol principal, film, regiza, William Shatner]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?x dbo:director res:William_Shatner . 
        ?x dbo:starring ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Leonard_Nimoy</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/DeForest_Kelley</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/James_Doohan</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Nichelle_Nichols</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Walter_Koenig</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/George_Takei</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/William_Shatner</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Amy_Acker</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Dan_Gauthier</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Dick_Van_Patten</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Brenda_Bakke</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Duane_Whitaker</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tom_Towles</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Dan_Martin_(actor)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rickey_Medlocke</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Chuck_Williams</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/J.T._Colosa</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/John_Prosky</uri>
</answer>
</answers>
</question>
