<?xml version="1.0" ?>
<dataset id="qald-4_multilingual_train">
<question aggregation="false" answertype="resource" id="84" onlydbo="true">
<string lang="en"><![CDATA[Give me all movies with Tom Cruise.]]></string>
<string lang="de"><![CDATA[Gib mir alle Filme mit Tom Cruise.]]></string>
<string lang="es"><![CDATA[Dame todas las películas con Tom Cruise]]></string>
<string lang="it"><![CDATA[Dammi tutti i film con Tom Cruise.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les films avec Tom Cruise.]]></string>
<string lang="nl"><![CDATA[Noem alle films met Tom Cruise.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate filmele cu Tom Cruise.]]></string>
<keywords lang="en"><![CDATA[movie, Tom Cruise]]></keywords>
<keywords lang="de"><![CDATA[Film, Tom Cruise]]></keywords>
<keywords lang="es"><![CDATA[películas, Tom Cruise]]></keywords>
<keywords lang="it"><![CDATA[film, Tom Cruise]]></keywords>
<keywords lang="fr"><![CDATA[films, Tom Cruise]]></keywords>
<keywords lang="nl"><![CDATA[film, Tom Cruise]]></keywords>
<keywords lang="ro"><![CDATA[film, Tom Cruise]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Film.
        ?uri dbo:starring res:Tom_Cruise .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Eyes_Wide_Shut</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Vanilla_Sky</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rain_Man</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Minority_Report_(film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jerry_Maguire</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Color_of_Money</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Top_Gun</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Last_Samurai</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Firm_(1993_film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/War_of_the_Worlds_(2005_film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Risky_Business</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Cocktail_(1988_film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Days_of_Thunder</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Far_and_Away</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mission:_Impossible_(film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Collateral_(film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Legend_(film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mission:_Impossible_III</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Losin'_It</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/All_the_Right_Moves_(film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Outsiders_(film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Interview_with_the_Vampire:_The_Vampire_Chronicles</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Born_on_the_Fourth_of_July_(film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lions_for_Lambs</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Valkyrie_(film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mission:_Impossible_(film_series)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mission:_Impossible_%E2%80%93_Ghost_Protocol</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/A_Few_Good_Men</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Knight_and_Day</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rock_of_Ages_(2012_film)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jack_Reacher_(film)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="143" onlydbo="false">
<string lang="en"><![CDATA[Give me all breeds of the German Shepherd dog.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schäferhundrassen.]]></string>
<string lang="es"><![CDATA[Dame todas las razas de pastor alemán.]]></string>
<string lang="it"><![CDATA[Dammi tutte le razze del pastore tedesco.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les races de bergers allemands.]]></string>
<string lang="nl"><![CDATA[Noem alle soorten Duitse herders.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate rasele câinelui Ciobănesc German.]]></string>
<keywords lang="en"><![CDATA[breed, German Shepherd dog]]></keywords>
<keywords lang="de"><![CDATA[Schäferhundrasse]]></keywords>
<keywords lang="es"><![CDATA[razas de pastor alemán]]></keywords>
<keywords lang="it"><![CDATA[razza, pastore tedesco]]></keywords>
<keywords lang="fr"><![CDATA[races, bergers allemands]]></keywords>
<keywords lang="nl"><![CDATA[Duitse herder, soort]]></keywords>
<keywords lang="ro"><![CDATA[rasă, câine Ciobănesc German]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbp:breed res:German_Shepherd . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Strongheart</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mancs_(dog)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Appollo_(dog)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Nemo_A534</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Trakr</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jet_of_Iada</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Crumstone_Irma</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lightning_(dog)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rifleman_Khan</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="42" onlydbo="true">
<string lang="en"><![CDATA[What is the official language of Suriname?]]></string>
<string lang="de"><![CDATA[Was ist die Amtssprache Von Surinam?]]></string>
<string lang="es"><![CDATA[¿Cuál es la idioma oficial de Surinam?]]></string>
<string lang="it"><![CDATA[Qual è la lingua ufficiale del Suriname?]]></string>
<string lang="fr"><![CDATA[Quelle est la langue officielle du Suriname?]]></string>
<string lang="nl"><![CDATA[Wat is de officiële taal van Suriname?]]></string>
<string lang="ro"><![CDATA[Care este limba oficială din Suriname?]]></string>
<keywords lang="en"><![CDATA[Suriname, official language]]></keywords>
<keywords lang="de"><![CDATA[Surinam, Amtssprache]]></keywords>
<keywords lang="es"><![CDATA[Surinam, idioma oficial]]></keywords>
<keywords lang="it"><![CDATA[Suriname, lingua ufficiale]]></keywords>
<keywords lang="fr"><![CDATA[Suriname, langue officielle]]></keywords>
<keywords lang="nl"><![CDATA[Suriname, officiële taal]]></keywords>
<keywords lang="ro"><![CDATA[Suriname, limba oficială]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Suriname dbo:officialLanguage ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Dutch_language</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="87" onlydbo="true">
<string lang="en"><![CDATA[Who wrote the book The Pillars of the Earth?]]></string>
<string lang="de"><![CDATA[Wer schrieb das Buch Die Säulen der Erde?]]></string>
<string lang="es"><![CDATA[¿Quen escribió el libro Los pilares de la Tierra?]]></string>
<string lang="it"><![CDATA[Chi ha scritto il libro I pilastri della Terra?]]></string>
<string lang="fr"><![CDATA[Qui a écrit le livre Les Piliers de la Terre?]]></string>
<string lang="nl"><![CDATA[Wie schreef het boek De Pilaren van de Aarde?]]></string>
<string lang="ro"><![CDATA[Cine e scris cartea Stâlpii Pământului?]]></string>
<keywords lang="en"><![CDATA[wrote, book, The pillars of the Earth]]></keywords>
<keywords lang="de"><![CDATA[schreiben, Buch, Die Säulen der Erde]]></keywords>
<keywords lang="es"><![CDATA[escritor, libro, Pilares de la Tierra]]></keywords>
<keywords lang="it"><![CDATA[scritto, libro, I pilastri della Terra]]></keywords>
<keywords lang="fr"><![CDATA[Les Piliers de la Terre, écrivain]]></keywords>
<keywords lang="nl"><![CDATA[auteur, De Pilaren van de Aarde]]></keywords>
<keywords lang="ro"><![CDATA[scrie, carte, Stâlpii Pământului]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:The_Pillars_of_the_Earth dbo:author ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Ken_Follett</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="string" id="154" onlydbo="false">
<string lang="en"><![CDATA[What are the nicknames of San Francisco?]]></string>
<string lang="de"><![CDATA[Was sind die Spitznamen von San Francisco?]]></string>
<string lang="es"><![CDATA[¿Cuál es el apodo de San Francisco?]]></string>
<string lang="it"><![CDATA[Quali sono i soprannomi di San Francisco?]]></string>
<string lang="fr"><![CDATA[Quels sont les surnoms de San Francisco?]]></string>
<string lang="nl"><![CDATA[Wat zijn bijnamen van San Francisco?]]></string>
<string lang="ro"><![CDATA[Care sunt poreclele pentru San Francisco?]]></string>
<keywords lang="en"><![CDATA[San Francisco, nickname]]></keywords>
<keywords lang="de"><![CDATA[San Francisco, Spitzname]]></keywords>
<keywords lang="es"><![CDATA[San Francisco, apodo]]></keywords>
<keywords lang="it"><![CDATA[San Francisco, soprannome]]></keywords>
<keywords lang="fr"><![CDATA[surnoms, San Francisco]]></keywords>
<keywords lang="nl"><![CDATA[bijnaam, San Francisco]]></keywords>
<keywords lang="ro"><![CDATA[San Francisco, poreclă]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?string 
WHERE { 
        res:San_Francisco dbp:nickname ?string . 
}]]></query>
<answers>
<answer>
<string><![CDATA[The City by the Bay; Fog City; S.F.; Frisco; The City that Knows How ; Baghdad by the Bay ; The Paris of the West]]></string>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="65" onlydbo="false">
<string lang="en"><![CDATA[Which companies work in the aerospace industry as well as in medicine?]]></string>
<string lang="de"><![CDATA[Welche Unternehmen sind sowohl in der Luft- und Raumfahrt als auch im Bereich der Medizin tätig?]]></string>
<string lang="es"><![CDATA[¿Qué empresas aerospaciales trabajar también en en medicina?]]></string>
<string lang="it"><![CDATA[Quali aziende si occupano sia nell'industria aerospaziale che in ambito medico?]]></string>
<string lang="fr"><![CDATA[Quelles companies travaillent dans l'aérospatial et dans la médecine?]]></string>
<string lang="nl"><![CDATA[Welke bedrijven zijn zowel actief in de ruimtevaartindustrie als in de geneeskunde?]]></string>
<string lang="ro"><![CDATA[Ce companii lucrează în industria aerospațială, precum și în medicină?]]></string>
<keywords lang="en"><![CDATA[company, aerospace industry, medicine]]></keywords>
<keywords lang="de"><![CDATA[Unternehmen, Luft- und Raumfahrt, Medizin]]></keywords>
<keywords lang="es"><![CDATA[empresas, areospaciales, medicina]]></keywords>
<keywords lang="it"><![CDATA[azienda, industria aerospaziale, ambito medico]]></keywords>
<keywords lang="fr"><![CDATA[companies, aérospatial, médecine]]></keywords>
<keywords lang="nl"><![CDATA[bedrijf, ruimtevaartindustrie, geneeskunde]]></keywords>
<keywords lang="ro"><![CDATA[companii, industrie aerospațială, medicină]]></keywords>
<query><![CDATA[PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Company  .
        ?uri dbo:industry res:Aerospace . 
        ?uri dbo:industry res:Medicine .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Makino</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Radiall</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/ATI_425_Titanium_Alloy</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="72" onlydbo="true">
<string lang="en"><![CDATA[Which languages are spoken in Estonia?]]></string>
<string lang="de"><![CDATA[Welche Sprachen werden in Estland gesprochen?]]></string>
<string lang="es"><![CDATA[¿Qué idiomas se hablan en Estonia?]]></string>
<string lang="it"><![CDATA[Quali lingue sono parlate in Estonia?]]></string>
<string lang="fr"><![CDATA[Quelles langues parle-t-on en Estonie?]]></string>
<string lang="nl"><![CDATA[Welke talen worden gesproken in Estland?]]></string>
<string lang="ro"><![CDATA[Ce limbi sunt vorbite în Estonia?]]></string>
<keywords lang="en"><![CDATA[language, spoken, Estonia]]></keywords>
<keywords lang="de"><![CDATA[Sprache, sprechen, Estland]]></keywords>
<keywords lang="es"><![CDATA[idiomas, Estonia]]></keywords>
<keywords lang="it"><![CDATA[lingua, Estonia]]></keywords>
<keywords lang="fr"><![CDATA[langues, Estonie]]></keywords>
<keywords lang="nl"><![CDATA[taal, gesproken, Estland]]></keywords>
<keywords lang="ro"><![CDATA[limbă, vorbită, Estonia]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:spokenIn res:Estonia . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Estonian_language</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/V%C3%B5ro_language</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Modern_Swedish</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Seto_dialect</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Baltic_Romani</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Estonian_Sign_Language</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Laiuse_Romani_language</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Finnish_language</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Russian_Sign_Language</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="13" onlydbo="true">
<string lang="en"><![CDATA[Are tree frogs a type of amphibian?]]></string>
<string lang="de"><![CDATA[Sind Laubfrösche Amphibien?]]></string>
<string lang="es"><![CDATA[¿Son las ranas verdes un tipo de anfibio?]]></string>
<string lang="it"><![CDATA[Le rane verdi sono un tipo di anfibio?]]></string>
<string lang="fr"><![CDATA[Sont les grenouilles arboricoles un type d'amphibiens?]]></string>
<string lang="nl"><![CDATA[Zijn boomkikkers een soort amfibie?]]></string>
<string lang="ro"><![CDATA[Sunt broaștele de copac un tip de amfibieni?]]></string>
<keywords lang="en"><![CDATA[tree frog, amphibian]]></keywords>
<keywords lang="de"><![CDATA[Laubfrosch, Amphibie]]></keywords>
<keywords lang="es"><![CDATA[rana verde, anfibio]]></keywords>
<keywords lang="it"><![CDATA[rana verde, anfibio]]></keywords>
<keywords lang="fr"><![CDATA[grenouilles arboricoles, amphibien]]></keywords>
<keywords lang="nl"><![CDATA[boomkikker, amfibie]]></keywords>
<keywords lang="ro"><![CDATA[broască de copac, amfibian]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Hylidae dbo:class res:Amphibian . 
}]]></query>
<answers>
<answer>
<boolean>True</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="37" onlydbo="false">
<string lang="en"><![CDATA[When did Latvia join the EU?]]></string>
<string lang="de"><![CDATA[Wann ist Lettland der EU beigetreten?]]></string>
<string lang="es"><![CDATA[¿Cuándo ingresó Letonia a la unión europea?]]></string>
<string lang="it"><![CDATA[Quando la Lettonia è entrata nell'Unione Europea?]]></string>
<string lang="fr"><![CDATA[Quand est la Lettonie devenue membre de l'Union européene?]]></string>
<string lang="nl"><![CDATA[Wanneer trad Letland toe tot de EU?]]></string>
<string lang="ro"><![CDATA[Când a aderat Letonia la Uniunea Europeană?]]></string>
<keywords lang="en"><![CDATA[Latvia, join, EU]]></keywords>
<keywords lang="de"><![CDATA[Lettland, beitreten, EU]]></keywords>
<keywords lang="es"><![CDATA[Letonia, ingreso, unión europea]]></keywords>
<keywords lang="it"><![CDATA[Lettonia, entrare, Unione Europea]]></keywords>
<keywords lang="fr"><![CDATA[Lettonie, membre, Union européene]]></keywords>
<keywords lang="nl"><![CDATA[Letland, toetreden, EU]]></keywords>
<keywords lang="ro"><![CDATA[Letonia, adera, Uniunea Europeană]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?date 
WHERE {       
        res:Latvia dbp:accessioneudate ?date .      
}]]></query>
<answers>
<answer>
<date>2004-05-01</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="15" onlydbo="true">
<string lang="en"><![CDATA[Who created Goofy?]]></string>
<string lang="de"><![CDATA[Wer hat Goofy erfunden?]]></string>
<string lang="es"><![CDATA[¿Quién es el creador de Goofy?]]></string>
<string lang="it"><![CDATA[Chi è il creatore di Pippo?]]></string>
<string lang="fr"><![CDATA[Qui est le créateur de Goofy?]]></string>
<string lang="nl"><![CDATA[Wie bedacht Goofy?]]></string>
<string lang="ro"><![CDATA[Cine l-a creat pe Goofy?]]></string>
<keywords lang="en"><![CDATA[created, Goofy]]></keywords>
<keywords lang="de"><![CDATA[erfinden, Goofy]]></keywords>
<keywords lang="es"><![CDATA[creador, Goofy]]></keywords>
<keywords lang="it"><![CDATA[creatore, Pippo]]></keywords>
<keywords lang="fr"><![CDATA[Goofy, créateur]]></keywords>
<keywords lang="nl"><![CDATA[bedenker, Goofy]]></keywords>
<keywords lang="ro"><![CDATA[creat, Goofy]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Goofy dbo:creator ?uri . 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Art_Babbitt</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Paul_Murry</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Del_Connell</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="69" onlydbo="false">
<string lang="en"><![CDATA[Which caves have more than 3 entrances?]]></string>
<string lang="de"><![CDATA[Welche Höhlen haben mehr als 3 Eingänge?]]></string>
<string lang="es"><![CDATA[¿Qué cuevas tienen más de 3 entradas?]]></string>
<string lang="it"><![CDATA[Quali grotte hanno più di 3 entrate?]]></string>
<string lang="fr"><![CDATA[Quelles grottes ont plus de 3 entrées?]]></string>
<string lang="nl"><![CDATA[Welke grotten hebben meer dan drie ingangen?]]></string>
<string lang="ro"><![CDATA[Ce peșteri au mai mult de 3 intrări?]]></string>
<keywords lang="en"><![CDATA[cave, entrance, more than 3]]></keywords>
<keywords lang="de"><![CDATA[Höhle, Eingang, mehr als 3]]></keywords>
<keywords lang="es"><![CDATA[cueva, entrada, más de 3]]></keywords>
<keywords lang="it"><![CDATA[grotta, entrata, più di 3]]></keywords>
<keywords lang="fr"><![CDATA[grottes, plus de 3 entrées]]></keywords>
<keywords lang="nl"><![CDATA[grot, ingang, meer dan drie]]></keywords>
<keywords lang="ro"><![CDATA[peșteră, intrare, mai mult de 3]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Cave .
        ?uri dbp:entranceCount ?entrance .
        FILTER (?entrance > 3) .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Great_Douk_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ingleborough_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Windsor_Great_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lost_John's_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gargantua_(cave)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Paisley_Caves</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Steinbr%C3%BCcken_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Redmond_Caves</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Boho_Caves</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Pollnagollum</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Traungold_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Shuang_River_Cave_Group</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Trail_Creek_Caves</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kharosa</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Porth_yr_Ogof</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mahakali_Caves</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gaping_Gill</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sistema_Dos_Ojos</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sistema_Nohoch_Nah_Chich</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kazumura_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kanheri_Caves</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sistema_Ox_Bel_Ha</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sistema_Sac_Actun</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="32" onlydbo="false">
<string lang="en"><![CDATA[Which countries adopted the Euro?]]></string>
<string lang="de"><![CDATA[Welche Länder haben den Euro übernommen?]]></string>
<string lang="es"><![CDATA[¿Qué países han introducido el Euro?]]></string>
<string lang="it"><![CDATA[Quali stati hanno introdotto l'Euro?]]></string>
<string lang="fr"><![CDATA[Quels pays ont adopté l'Euro?]]></string>
<string lang="nl"><![CDATA[Welke landen hebben de Euro geïntroduceerd?]]></string>
<string lang="ro"><![CDATA[În ce țări a fost introdus euro?]]></string>
<keywords lang="en"><![CDATA[country, adopt, Euro]]></keywords>
<keywords lang="de"><![CDATA[Land, übernehmen, Euro]]></keywords>
<keywords lang="es"><![CDATA[países, introducido, Euro]]></keywords>
<keywords lang="it"><![CDATA[stato, introdurre, Euro]]></keywords>
<keywords lang="fr"><![CDATA[pays, adopté, Euro]]></keywords>
<keywords lang="nl"><![CDATA[land, Euro, geïntroduceerd]]></keywords>
<keywords lang="ro"><![CDATA[țară, introdus, euro]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
          ?uri rdf:type dbo:Country .
        { ?uri dbo:currency res:Euro . } 
        UNION 
        { ?uri dbp:currencyCode 'EUR'@en . }
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Andorra</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Belgium</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Cyprus</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Finland</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/French_Southern_and_Antarctic_Lands</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Germany</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Greece</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Republic_of_Ireland</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kerguelen_Islands</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Luxembourg</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mayotte</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Montenegro</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Portugal</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Spain</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Saint_Pierre_and_Miquelon</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/San_Marino</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Slovenia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/United_Nations_Interim_Administration_Mission_in_Kosovo</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Free_Territory_of_Trieste</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ad%C3%A9lie_Land</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Akrotiri_and_Dhekelia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Twente</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/%C3%8Eles_des_Saintes</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Collectivity_of_Saint_Martin</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Austria</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Estonia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Saint_Barth%C3%A9lemy</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Italy</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Malta</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Monaco</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Vatican_City</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/%C3%85land_Islands</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="179" onlydbo="false">
<string lang="en"><![CDATA[Was Marc Chagall a jew?]]></string>
<string lang="de"><![CDATA[War Marc Chagall ein Jude?]]></string>
<string lang="es"><![CDATA[¿Fué Marc Chagall judío?]]></string>
<string lang="it"><![CDATA[Marc Chagall era ebreo?]]></string>
<string lang="fr"><![CDATA[Etait Marc Chagall juif?]]></string>
<string lang="nl"><![CDATA[Was Marc Chagall joods?]]></string>
<string lang="ro"><![CDATA[A fost Marc Chagall un evreu?]]></string>
<keywords lang="en"><![CDATA[Marc Chagall, jew]]></keywords>
<keywords lang="de"><![CDATA[Marc Chagall, Jude]]></keywords>
<keywords lang="es"><![CDATA[Marc Chagall, judío]]></keywords>
<keywords lang="it"><![CDATA[Marc Chagall, ebreo]]></keywords>
<keywords lang="fr"><![CDATA[Marc Chagall, juif]]></keywords>
<keywords lang="nl"><![CDATA[Marc Chagall, joods]]></keywords>
<keywords lang="ro"><![CDATA[Marc Chagall, evreu]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
       res:Marc_Chagall dbp:ethnicity 'Jewish'@en .
}]]></query>
<answers>
<answer>
<boolean>True</boolean>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="52" onlydbo="true">
<string lang="en"><![CDATA[Which presidents were born in 1945?]]></string>
<string lang="de"><![CDATA[Welche Präsidenten wurden 1945 geboren?]]></string>
<string lang="es"><![CDATA[¿Qué presidentes nacieron en 1945?]]></string>
<string lang="it"><![CDATA[Quali presidenti sono nati nel 1945?]]></string>
<string lang="fr"><![CDATA[Quels présidents sont nés en 1945?]]></string>
<string lang="nl"><![CDATA[Welke presidenten werden geboren in 1945?]]></string>
<string lang="ro"><![CDATA[Ce președinți au fost născuți în 1945]]></string>
<keywords lang="en"><![CDATA[president, born, 1945]]></keywords>
<keywords lang="de"><![CDATA[Präsident, geboren, 1945]]></keywords>
<keywords lang="es"><![CDATA[presidentes nacidos 1945]]></keywords>
<keywords lang="it"><![CDATA[presidente, nato, 1945]]></keywords>
<keywords lang="fr"><![CDATA[présidents, nés, 1945]]></keywords>
<keywords lang="nl"><![CDATA[president, geboren, 1945]]></keywords>
<keywords lang="ro"><![CDATA[președinte, născut, 1945]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:President . 
        ?uri dbo:birthDate ?date .
        FILTER regex(?date, '^1945') .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Igor_Ivanov</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Moshe_Katsav</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lee_Jong-wook</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Vladislav_Ardzinba</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Joe_Ghiz</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jorge_Serrano_El%C3%ADas</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/John_Olsen</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/John_Fahey_(politician)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Zlatko_Tom%C4%8Di%C4%87</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mom%C4%8Dilo_Kraji%C5%A1nik</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Akbar_Tanjung</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Charles_Margai</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Joe_Robert_Pemagbi</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Faruk_S%C3%BCren</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Radovan_Karad%C5%BEi%C4%87</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Abdirahman_Farole</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Yuriy_Meshkov</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Shekou_Momodou_Touray</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bu-Buakei_Jabbi</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sheku_Badara_Bashiru_Dumbuya</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="number" id="73" onlydbo="true">
<string lang="en"><![CDATA[How many Aldi stores are there?]]></string>
<string lang="de"><![CDATA[Wieviele Aldi-Filialen gibt es?]]></string>
<string lang="es"><![CDATA[¿Cuántas tiendas Aldi hay?]]></string>
<string lang="it"><![CDATA[Quanti negozi Aldi ci sono?]]></string>
<string lang="fr"><![CDATA[Combien de magasins Aldi sont là?]]></string>
<string lang="nl"><![CDATA[Hoeveel Aldi winkels zijn er?]]></string>
<string lang="ro"><![CDATA[Câte magazine Aldi există?]]></string>
<keywords lang="en"><![CDATA[own, Aldi]]></keywords>
<keywords lang="de"><![CDATA[gehören, Aldi]]></keywords>
<keywords lang="es"><![CDATA[pertenece, Aldi]]></keywords>
<keywords lang="it"><![CDATA[possedere, Aldi]]></keywords>
<keywords lang="fr"><![CDATA[possède, Aldi]]></keywords>
<keywords lang="nl"><![CDATA[eigenaar, Aldi]]></keywords>
<keywords lang="ro"><![CDATA[avea, Aldi]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?number
WHERE {
        res:Aldi dbo:numberOfLocations ?number .
}]]></query>
<answers>
<answer>
<number>9221</number>
</answer>
</answers>
</question>
