<?xml version="1.0" ?>
<dataset id="dbpedia-train">
<question aggregation="false" answertype="string" id="48" onlydbo="false">
<string lang="en"><![CDATA[Give me the homepage of Forbes.]]></string>
<string lang="de"><![CDATA[Gib mir die Homepage von Forbes.]]></string>
<string lang="es"><![CDATA[Dame la página de web de Forbes.]]></string>
<string lang="it"><![CDATA[Dammi il sito internet di Forbes.]]></string>
<string lang="fr"><![CDATA[Quel est la site web de Forbes?]]></string>
<string lang="nl"><![CDATA[Geef de homepage van Forbes.]]></string>
<keywords lang="en"><![CDATA[Forbes, homepage]]></keywords>
<keywords lang="de"><![CDATA[Forbes, Homepage]]></keywords>
<keywords lang="es"><![CDATA[página de web, Forbes]]></keywords>
<keywords lang="it"><![CDATA[sito internet, Forbes]]></keywords>
<keywords lang="fr"><![CDATA[Forbes, site web]]></keywords>
<keywords lang="nl"><![CDATA[homepage, Forbes]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?string 
WHERE {
	res:Forbes foaf:homepage ?string .
}]]></query>
<answers>
<answer>
<uri>http://www.forbes.com</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="81" onlydbo="false">
<string lang="en"><![CDATA[Which country has the most official languages?]]></string>
<string lang="de"><![CDATA[Welches Land hat die meisten Amtssprachen?]]></string>
<string lang="es"><![CDATA[¿Qué país tiene más idiomas oficiales?]]></string>
<string lang="it"><![CDATA[Quale stato ha più lingue ufficiali?]]></string>
<string lang="fr"><![CDATA[Quels pays a le plus de langues officielles?]]></string>
<string lang="nl"><![CDATA[Welk land heeft de meeste officiële talen.]]></string>
<keywords lang="en"><![CDATA[country, official language, most]]></keywords>
<keywords lang="de"><![CDATA[Land, Amtssprache, die meisten]]></keywords>
<keywords lang="es"><![CDATA[país, idiomas oficiales, más]]></keywords>
<keywords lang="it"><![CDATA[stato, lingue ufficiali, più]]></keywords>
<keywords lang="fr"><![CDATA[pays, plus de langues officielles]]></keywords>
<keywords lang="nl"><![CDATA[land, officiële taal, meeste]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
	?uri rdf:type dbo:Country  .
        ?uri dbp:officialLanguages ?language .
} 
ORDER BY DESC(COUNT(?language)) LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Bolivia</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="9" onlydbo="false">
<string lang="en"><![CDATA[Which U.S. states possess gold minerals?]]></string>
<string lang="de"><![CDATA[In welchen US-Staaten gibt es Goldvorkommen?]]></string>
<string lang="es"><![CDATA[¿En qué estados de los estados unidos de américa hay oro?]]></string>
<string lang="it"><![CDATA[In quali stati degli Stati Uniti c'è l'oro?]]></string>
<string lang="fr"><![CDATA[Quels états des Etats-Unis d'Amérique possèdent de l'or?]]></string>
<string lang="nl"><![CDATA[In welke deelstaat van de Verenigde Staten komt goud voor?]]></string>
<keywords lang="en"><![CDATA[U.S. state, mineral, gold]]></keywords>
<keywords lang="de"><![CDATA[US-Staat, Goldvorkommen]]></keywords>
<keywords lang="es"><![CDATA[estado, estados unidos de américa, oro]]></keywords>
<keywords lang="it"><![CDATA[Stati Uniti d'America, oro]]></keywords>
<keywords lang="fr"><![CDATA[états, Etats-Unis d'Amérique, or]]></keywords>
<keywords lang="nl"><![CDATA[deelstaat, Verenigde Staten, goud]]></keywords>
<query><![CDATA[PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type yago:StatesOfTheUnitedStates .
        ?uri dbp:mineral ?mineral .
        FILTER (regex(?mineral,'gold','i')) .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/California</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="69" onlydbo="false">
<string lang="en"><![CDATA[Which caves have more than 3 entrances?]]></string>
<string lang="de"><![CDATA[Welche Höhlen haben mehr als 3 Eingänge?]]></string>
<string lang="es"><![CDATA[¿Qué cuevas tienen más de 3 entradas?]]></string>
<string lang="it"><![CDATA[Quali grotte hanno più di 3 entrate?]]></string>
<string lang="fr"><![CDATA[Quelles grottes ont plus de 3 entrées?]]></string>
<string lang="nl"><![CDATA[Welke grotten hebben meer dan drie ingangen?]]></string>
<keywords lang="en"><![CDATA[cave, entrance, more than 3]]></keywords>
<keywords lang="de"><![CDATA[Höhle, Eingang, mehr als 3]]></keywords>
<keywords lang="es"><![CDATA[cueva, entrada, más de 3]]></keywords>
<keywords lang="it"><![CDATA[grotta, entrata, più di 3]]></keywords>
<keywords lang="fr"><![CDATA[grottes, plus de 3 entrées]]></keywords>
<keywords lang="nl"><![CDATA[grot, ingang, meer dan drie]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
	?uri rdf:type dbo:Cave .
        ?uri dbp:entranceCount ?entrance .
        FILTER (?entrance > 3) .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Ingleborough_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Windsor_Great_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lost_John's_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gargantua_(cave)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Paisley_Caves</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Steinbr%C3%BCcken_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Redmond_Caves</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Boho_Caves</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Pollnagollum</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Traungold_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Shuang_River_Cave_Group</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Trail_Creek_Caves</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kharosa</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Porth_yr_Ogof</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mahakali_Caves</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gaping_Gill</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sistema_Dos_Ojos</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sistema_Nohoch_Nah_Chich</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kazumura_Cave</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kanheri_Caves</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sistema_Ox_Bel_Ha</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sistema_Sac_Actun</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="75" onlydbo="true">
<string lang="en"><![CDATA[Who has been the 5th president of the United States of America?]]></string>
<string lang="de"><![CDATA[Wer war der 5. Präsident der Vereinigten Staaten von Amerika?]]></string>
<string lang="es"><![CDATA[¿Quién fue el quinto presidente de los estados unidos de américa?]]></string>
<string lang="it"><![CDATA[Chi è stato il quinto presidente degli Stati Uniti d'America?]]></string>
<string lang="fr"><![CDATA[Qui fut le 5e président des Etats-Unis?]]></string>
<string lang="nl"><![CDATA[Wie was de vijfde president van de Verenigde Staten?]]></string>
<keywords lang="en"><![CDATA[United States of America, president, 5th]]></keywords>
<keywords lang="de"><![CDATA[Vereinigte Staaten von Amerika, Präsident, 5.]]></keywords>
<keywords lang="es"><![CDATA[estados unidos de américa, presidente, quinto]]></keywords>
<keywords lang="it"><![CDATA[Stati Uniti d'America, presidente, quinto]]></keywords>
<keywords lang="fr"><![CDATA[5e président, Etats-Unis]]></keywords>
<keywords lang="nl"><![CDATA[president, Verenigde Staten, vijfde]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
	?uri dbo:orderInOffice '5th President of the United States'@en .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/James_Monroe</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="77" onlydbo="false">
<string lang="en"><![CDATA[Which music albums contain the song Last Christmas?]]></string>
<string lang="de"><![CDATA[Auf welchen Musikalben ist das Lied Last Christmas?]]></string>
<string lang="es"><![CDATA[¿Qué albums musicales contienen la canción Las Christmas?]]></string>
<string lang="it"><![CDATA[Quale album musicale contiene la canzone Last Christmas?]]></string>
<string lang="fr"><![CDATA[Quels albums contiennent le morceau Last Christmas?]]></string>
<string lang="nl"><![CDATA[Op welke muziekalbums staat het nummer Last Christmas?]]></string>
<keywords lang="en"><![CDATA[music album, song, Last Christmas]]></keywords>
<keywords lang="de"><![CDATA[Musikalbum, Lied, Last Christmas]]></keywords>
<keywords lang="es"><![CDATA[album musical, canción, Last Christmas]]></keywords>
<keywords lang="it"><![CDATA[album musicale, canzone, Last Christmas]]></keywords>
<keywords lang="fr"><![CDATA[albums, contiennent, Last Christmas?]]></keywords>
<keywords lang="nl"><![CDATA[muziekalbum, nummer, Last Christmas]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
        ?single dbo:album ?uri .
        ?single foaf:name 'Last Christmas'@en .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Music_from_the_Edge_of_Heaven</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Whigfield_(album)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Whigfield_II</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Crazy_Frog_Presents_More_Crazy_Hits</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Perfect_Day_(Cascada_album)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Disco_Defenders</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Classic_Christmas_(Joe_McElderry_album)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="1" onlydbo="false">
<string lang="en"><![CDATA[Give me all female Russian astronauts.]]></string>
<string lang="de"><![CDATA[Gib mir alle russischen Astronautinnen.]]></string>
<string lang="es"><![CDATA[Dame todas las astronautas rusas.]]></string>
<string lang="it"><![CDATA[Dammi tutte le austronaute russe.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les astronautes féminins russes.]]></string>
<string lang="nl"><![CDATA[Geef alle vrouwelijke Russische astronauten.]]></string>
<keywords lang="en"><![CDATA[astronaut, female, Russian]]></keywords>
<keywords lang="de"><![CDATA[Astronautin, russisch]]></keywords>
<keywords lang="es"><![CDATA[astronautas rusas]]></keywords>
<keywords lang="it"><![CDATA[austronaute, russe]]></keywords>
<keywords lang="fr"><![CDATA[astronaute, russes, féminins]]></keywords>
<keywords lang="nl"><![CDATA[astronaut, vrouwelijk, Russisch]]></keywords>
<query><![CDATA[PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
	?uri rdf:type yago:RussianCosmonauts .
        ?uri rdf:type yago:FemaleAstronauts .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Valentina_Tereshkova</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Yelena_Kondakova</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Yelena_Serova</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="63" onlydbo="false">
<string lang="en"><![CDATA[Give me all actors starring in Last Action Hero.]]></string>
<string lang="de"><![CDATA[Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.]]></string>
<string lang="es"><![CDATA[Dame todos los actores que hayan actuado en Last Action Hero.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli attori che hanno recitato in Last Action Hero.]]></string>
<string lang="fr"><![CDATA[Noem alle acteurs uit de film Last Action Hero.]]></string>
<string lang="nl"><![CDATA[Noem alle acteurs uit de film Last Action Hero.]]></string>
<keywords lang="en"><![CDATA[actor, starring, Last Action Hero]]></keywords>
<keywords lang="de"><![CDATA[Schauspieler, mitspielen, Last Action Hero]]></keywords>
<keywords lang="es"><![CDATA[actores, Last Action Hero]]></keywords>
<keywords lang="it"><![CDATA[attori, Last Action Hero]]></keywords>
<keywords lang="fr"><![CDATA[acteurs, Last Action Hero]]></keywords>
<keywords lang="nl"><![CDATA[acteur, Last Action Hero]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:Last_Action_Hero dbp:starring ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Arnold_Schwarzenegger</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Anthony_Quinn</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/F._Murray_Abraham</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Art_Carney</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Austin_O'Brien</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tom_Noonan</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bridgette_Wilson</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Charles_Dance</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Robert_Prosky</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="32" onlydbo="false">
<string lang="en"><![CDATA[Which countries in the European Union adopted the Euro?]]></string>
<string lang="de"><![CDATA[Welche Länder in der Europäischen Union haben den Euro übernommen?]]></string>
<string lang="es"><![CDATA[¿Qué países de la unión europea han introducido el Euro?]]></string>
<string lang="it"><![CDATA[Quali stati dell'Unione Europea hanno introdotto l'Euro?]]></string>
<string lang="fr"><![CDATA[Quels pays de l'Union Européene ont adopté l'Euro?]]></string>
<string lang="nl"><![CDATA[Welke landen in de Europese Unie hebben de Euro geïntroduceerd?]]></string>
<keywords lang="en"><![CDATA[European Union, country, adopt, Euro]]></keywords>
<keywords lang="de"><![CDATA[Europäische Union, Land, übernehmen, Euro]]></keywords>
<keywords lang="es"><![CDATA[países, unión europea, introducido, Euro]]></keywords>
<keywords lang="it"><![CDATA[Unione Europea, stato, introdurre, Euro]]></keywords>
<keywords lang="fr"><![CDATA[pays de l'Union Européene, adopté, Euro]]></keywords>
<keywords lang="nl"><![CDATA[land, Europese Unie, Euro,  geïntroduceerd]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
	?uri rdf:type yago:EuropeanUnionMemberStates .
        { ?uri dbp:currency res:Euro . } 
        UNION 
        { ?uri dbp:currencyCode 'EUR'@en . }
        UNION 
        { ?uri dbp:currencyCode 'Euro'@en . }
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Slovenia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Austria</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Malta</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Cyprus</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Spain</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Italy</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Estonia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Belgium</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Greece</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Finland</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Luxembourg</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Portugal</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="90" onlydbo="false">
<string lang="en"><![CDATA[When was Capcom founded?]]></string>
<string lang="de"><![CDATA[Wann wurde Capcom gegründet?]]></string>
<string lang="es"><![CDATA[¿Cúando se fundó Capcom?]]></string>
<string lang="it"><![CDATA[Quando è stata fondata Capcom?]]></string>
<string lang="fr"><![CDATA[Quand a été fondé Capcom?]]></string>
<string lang="nl"><![CDATA[Wanneer werd Capcom opgericht?]]></string>
<keywords lang="en"><![CDATA[Capcom, founded]]></keywords>
<keywords lang="de"><![CDATA[Capcom, gründen]]></keywords>
<keywords lang="es"><![CDATA[Capcom, fundada]]></keywords>
<keywords lang="it"><![CDATA[Capcom, fondata]]></keywords>
<keywords lang="fr"><![CDATA[fondé, Capcom]]></keywords>
<keywords lang="nl"><![CDATA[Capcom, opgericht]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE {
     res:Capcom dbp:foundation ?date .
}]]></query>
<answers>
<answer>
<date>1983-06-11</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="35" onlydbo="true">
<string lang="en"><![CDATA[Who is the owner of Universal Studios?]]></string>
<string lang="de"><![CDATA[Wem gehören die Universal Studios?]]></string>
<string lang="es"><![CDATA[¿A quién le pertenecen los Universal Studios?]]></string>
<string lang="it"><![CDATA[Chi è il proprietario degli Universal Studios?]]></string>
<string lang="fr"><![CDATA[A qui appartient Universal Studios?]]></string>
<string lang="nl"><![CDATA[Wie is de eigenaar van Universal Studios?]]></string>
<keywords lang="en"><![CDATA[Universal Studios, owner]]></keywords>
<keywords lang="de"><![CDATA[Universal Studios, gehören]]></keywords>
<keywords lang="es"><![CDATA[Universal Studios, dueño]]></keywords>
<keywords lang="it"><![CDATA[Universal Studios, proprietario]]></keywords>
<keywords lang="fr"><![CDATA[appartient, Universal Studios]]></keywords>
<keywords lang="nl"><![CDATA[eigenaar, Universal Studios]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
	res:Universal_Studios dbo:owner ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/General_Electric</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/MCA_Inc.</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Seagram</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Comcast</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/NBCUniversal</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Vivendi</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Independent_business</uri>
</answer>
</answers>
</question>
