<?xml version="1.0" ?>
<dataset id="dbpedia-train">
<question aggregation="false" answertype="resource" id="38" onlydbo="false">
<string lang="en"><![CDATA[Which monarchs of the United Kingdom were married to a German?]]></string>
<string lang="de"><![CDATA[Welche Monarchen des Vereinigten Königreichs waren mit jemand deutschem verheiratet?]]></string>
<string lang="es"><![CDATA[¿Qué monárcas del reino unido estaban casados con una persona alemana?]]></string>
<string lang="it"><![CDATA[Quali monarchi del Regno Unito erano sposati a persone tedesche?]]></string>
<string lang="fr"><![CDATA[Quels monarques du Royaume-Uni ont épousé une personne allemande?]]></string>
<string lang="nl"><![CDATA[Welke monarchen van het Verenigd Koninkrijk waren getrouwd met een Duitser?]]></string>
<keywords lang="en"><![CDATA[United Kingdom, monarch, married, German]]></keywords>
<keywords lang="de"><![CDATA[Vereinigtes Königreich, Monarch, verheiratet, deutsch]]></keywords>
<keywords lang="es"><![CDATA[Reino Unido, monarcha, casado, alemán]]></keywords>
<keywords lang="it"><![CDATA[Regno Unito, monarca, sposato, tedesco]]></keywords>
<keywords lang="fr"><![CDATA[monarques, Royaume-Uni, épousé, allemand]]></keywords>
<keywords lang="nl"><![CDATA[monarch, Verenigd Koninkrijk, getrouwd, Duitser]]></keywords>
<query><![CDATA[PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type yago:MonarchsOfTheUnitedKingdom .
        ?uri dbo:spouse ?spouse .
        ?spouse dbo:birthPlace res:Germany.
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/George_III_of_the_United_Kingdom</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/William_IV_of_the_United_Kingdom</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="86" onlydbo="false">
<string lang="en"><![CDATA[Give me all female German chancellors.]]></string>
<string lang="de"><![CDATA[Gib mir alle deutschen Kanzlerinnen.]]></string>
<string lang="es"><![CDATA[Dame todas las cancilleres alemanas.]]></string>
<string lang="it"><![CDATA[Dammi tutte le cancelliere tedesche.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les chancelières allemandes.]]></string>
<string lang="nl"><![CDATA[Geef me alle vrouwelijke Duitse bondskanseliers.]]></string>
<keywords lang="en"><![CDATA[German chancellor, female]]></keywords>
<keywords lang="de"><![CDATA[deutsch, Kanzlerin]]></keywords>
<keywords lang="es"><![CDATA[canciller alemásn, mujer]]></keywords>
<keywords lang="it"><![CDATA[cancelliere tedesco, donna]]></keywords>
<keywords lang="fr"><![CDATA[chancelières, allemandes]]></keywords>
<keywords lang="nl"><![CDATA[vrouwelijk, Duits, bondskanselier]]></keywords>
<query><![CDATA[PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type yago:FemaleHeadsOfGovernment.
        ?uri dbp:office res:Chancellor_of_Germany .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Angela_Merkel</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="71" onlydbo="false">
<string lang="en"><![CDATA[Give me all video games published by Mean Hamster Software.]]></string>
<string lang="de"><![CDATA[Gib mir alle Videospiele von Mean Hamster Software.]]></string>
<string lang="es"><![CDATA[Dame todos los videojuegos de Mean Hamster Software.]]></string>
<string lang="it"><![CDATA[Dammi tutti i videogiochi di Mean Hamster Software.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les jeux vidéos publiés par Mean Hamster Software.]]></string>
<string lang="nl"><![CDATA[Geef me alle videogames van Mean Hamster Software.]]></string>
<keywords lang="en"><![CDATA[video game, publish, Mean Hamster Software]]></keywords>
<keywords lang="de"><![CDATA[Videospiel, Mean Hamster Software]]></keywords>
<keywords lang="es"><![CDATA[videojuego, Mean Hamster Software]]></keywords>
<keywords lang="it"><![CDATA[videogioco, prodotto, Mean Hamster Software]]></keywords>
<keywords lang="fr"><![CDATA[jeux vidéos, publiés, Mean Hamster Software]]></keywords>
<keywords lang="nl"><![CDATA[videogame, Mean Hamster Software]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
      ?uri rdf:type dbo:VideoGame .
      { ?uri dbp:publisher 'Mean Hamster Software'@en . }
      UNION 
      { ?uri dbo:publisher res:Mean_Hamster_Software . }
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Riven</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Myst</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Crossbow_(video_game)</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="5" onlydbo="false">
<string lang="en"><![CDATA[How many monarchical countries are there in Europe?]]></string>
<string lang="de"><![CDATA[Wieviele Monarchien gibt es in Europa?]]></string>
<string lang="es"><![CDATA[¿Cuántas monarquías existen en Europa?]]></string>
<string lang="it"><![CDATA[Quante monarchie ci sono in Europa?]]></string>
<string lang="fr"><![CDATA[Combien de monarchies existent en Europe?]]></string>
<string lang="nl"><![CDATA[Hoeveel monarchieën zijn er in Europa?]]></string>
<keywords lang="en"><![CDATA[Europe, monarchical country]]></keywords>
<keywords lang="de"><![CDATA[Europa, Monarchie]]></keywords>
<keywords lang="es"><![CDATA[Europa, monarquía, país]]></keywords>
<keywords lang="it"><![CDATA[Europa, monarchia, nazione]]></keywords>
<keywords lang="fr"><![CDATA[Europe, monarchies, combien]]></keywords>
<keywords lang="nl"><![CDATA[monarchie, Europa, hoeveel]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?uri) 
WHERE {
	?uri rdf:type yago:EuropeanCountries .
        ?uri dbo:governmentType ?govern .
        FILTER regex(?govern,'monarchy') .
}]]></query>
<answers>
<answer>
<number>6</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="53" onlydbo="false">
<string lang="en"><![CDATA[Give me all presidents of the United States.]]></string>
<string lang="de"><![CDATA[Gib mir alle Präsidenten der Vereinigten Staaten.]]></string>
<string lang="es"><![CDATA[Dame todos los presidentes de los estados unidos de américa.]]></string>
<string lang="it"><![CDATA[Dammi tutti i presidenti degli Stati Uniti.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les présidents des Etats-Unis.]]></string>
<string lang="nl"><![CDATA[Noem alle presidenten van de Verenigde Staten.]]></string>
<keywords lang="en"><![CDATA[United States, president]]></keywords>
<keywords lang="de"><![CDATA[Vereinigte Staaten, Präsident]]></keywords>
<keywords lang="es"><![CDATA[estados unidos, presidente]]></keywords>
<keywords lang="it"><![CDATA[Stati Uniti, presidente]]></keywords>
<keywords lang="fr"><![CDATA[Etats-Unis, présidents]]></keywords>
<keywords lang="nl"><![CDATA[president, Verenigde Staten]]></keywords>
<query><![CDATA[PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Person .
        { ?uri rdf:type yago:PresidentsOfTheUnitedStates. }
        UNION
        { ?uri rdf:type dbo:President.
          ?uri dbp:title res:President_of_the_United_States. }
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Abraham_Lincoln</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bill_Clinton</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Calvin_Coolidge</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/George_Washington</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Herbert_Hoover</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/James_Madison</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/James_K._Polk</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Andrew_Jackson</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Grover_Cleveland</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jimmy_Carter</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Andrew_Johnson</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Dwight_D._Eisenhower</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Franklin_D._Roosevelt</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/John_Quincy_Adams</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/James_Monroe</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Thomas_Jefferson</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ulysses_S._Grant</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Warren_G._Harding</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Woodrow_Wilson</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/James_A._Garfield</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Martin_Van_Buren</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Richard_Nixon</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/William_Henry_Harrison</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ronald_Reagan</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Theodore_Roosevelt</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/William_Howard_Taft</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/William_McKinley</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lyndon_B._Johnson</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Barack_Obama</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/George_W._Bush</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Harry_S._Truman</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gerald_Ford</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Benjamin_Harrison</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/John_Adams</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rutherford_B._Hayes</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Franklin_Pierce</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Millard_Fillmore</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Zachary_Taylor</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/John_Tyler</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Chester_A._Arthur</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Presidency_of_George_Washington</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ulysses_S._Grant_and_the_American_Civil_War</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="58" onlydbo="true">
<string lang="en"><![CDATA[Who produced the most films?]]></string>
<string lang="de"><![CDATA[Wer hat die meisten Filme produziert?]]></string>
<string lang="es"><![CDATA[¿Quién ha producido más películas?]]></string>
<string lang="it"><![CDATA[Chi ha prodotto più film?]]></string>
<string lang="fr"><![CDATA[Qui a produit le plus de films?]]></string>
<string lang="nl"><![CDATA[Wie produceerde de meeste films?]]></string>
<keywords lang="en"><![CDATA[film, produced, most]]></keywords>
<keywords lang="de"><![CDATA[Film, produzieren, die meisten]]></keywords>
<keywords lang="es"><![CDATA[películas, producido más]]></keywords>
<keywords lang="it"><![CDATA[film, prodotto, più]]></keywords>
<keywords lang="fr"><![CDATA[films, le plus de]]></keywords>
<keywords lang="nl"><![CDATA[producent, films, de meeste]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	?film rdf:type dbo:Film .
        ?film dbo:producer ?uri .
} 
ORDER BY DESC(COUNT(?film)) LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Hal_Roach</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="72" onlydbo="true">
<string lang="en"><![CDATA[Which languages are spoken in Estonia?]]></string>
<string lang="de"><![CDATA[Welche Sprachen werden in Estland gesprochen?]]></string>
<string lang="es"><![CDATA[¿Qué idiomas se hablan en Estonia?]]></string>
<string lang="it"><![CDATA[Quali lingue sono parlate in Estonia?]]></string>
<string lang="fr"><![CDATA[Quelles langues parle-t-on en Estonie?]]></string>
<string lang="nl"><![CDATA[Welke talen worden gesproken in Estland?]]></string>
<keywords lang="en"><![CDATA[language, spoken, Estonia]]></keywords>
<keywords lang="de"><![CDATA[Sprache, sprechen, Estland]]></keywords>
<keywords lang="es"><![CDATA[idiomas, Estonia]]></keywords>
<keywords lang="it"><![CDATA[lingua, Estonia]]></keywords>
<keywords lang="fr"><![CDATA[langues, Estonie]]></keywords>
<keywords lang="nl"><![CDATA[taal, gesproken, Estland]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
      { res:Estonia dbo:language ?uri . } 
      UNION 
      { ?uri dbo:spokenIn res:Estonia . }
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Estonian_language</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Swedish_language</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Erzya_language</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/V%C3%B5ro_language</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Modern_Swedish</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Seto_dialect</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Baltic_Romani</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Estonian_Sign_Language</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Laiuse_Romani_language</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Finnish_language</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Russian_Sign_Language</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="61" onlydbo="false">
<string lang="en"><![CDATA[Which mountains are higher than the Nanga Parbat?]]></string>
<string lang="de"><![CDATA[Welche Berge sind höher als der Nanga Parbat?]]></string>
<string lang="es"><![CDATA[¿Qué montañas son más altas que el Nanga Parbat?]]></string>
<string lang="it"><![CDATA[Quali montagne sono più alte del Nanga Parbat?]]></string>
<string lang="fr"><![CDATA[Quelles montagnes sont plus hautes que le Nanga Parbat?]]></string>
<string lang="nl"><![CDATA[Welke bergen zijn hoger dan de Nanga Parbat?]]></string>
<keywords lang="en"><![CDATA[mountain, higher, Nanga Parbat]]></keywords>
<keywords lang="de"><![CDATA[Berg, höher, Nanga Parbat]]></keywords>
<keywords lang="es"><![CDATA[montañas, más altas, Nanga Parbat]]></keywords>
<keywords lang="it"><![CDATA[montagna, più alta, Nanga Parbat]]></keywords>
<keywords lang="fr"><![CDATA[montagnes, plus hautes, Nanga Parbat]]></keywords>
<keywords lang="nl"><![CDATA[bergen, hoger, Nanga Parbat]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        res:Nanga_Parbat dbp:elevationM ?elevation .
	?uri rdf:type dbo:Mountain .
        ?uri dbp:elevationM ?otherelevation .
        FILTER (?otherelevation > ?elevation) .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Manaslu</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Dhaulagiri</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Cho_Oyu</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Makalu</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lhotse</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kangchenjunga</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/K2</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mount_Everest</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tschuggen</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ochsen</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="65" onlydbo="false">
<string lang="en"><![CDATA[Which companies work in the aerospace industry as well as on nuclear reactor technology?]]></string>
<string lang="de"><![CDATA[Welche Unternehmen sind sowohl in der Luft- und Raumfahrt als auch im Bereich der Reaktortechnologie tätig?]]></string>
<string lang="es"><![CDATA[¿Qué empresas aerospaciales trabajar también en en tecnología de reactores?]]></string>
<string lang="it"><![CDATA[Quali aziende lavorano sia nell'industria aerospaziale che sulle tecnologie dei reattori nucleari?]]></string>
<string lang="fr"><![CDATA[Quelles companies travaillent dans l'aérospatial et dans les réacteurs nucléaires?]]></string>
<string lang="nl"><![CDATA[Welke bedrijven zijn zowel actief in de ruimtevaartindustrie als in de nucleaire industrie?]]></string>
<keywords lang="en"><![CDATA[company, aerospace industry, nuclear reactor technology]]></keywords>
<keywords lang="de"><![CDATA[Unternehmen, Luft- und Raumfahrt, Reaktortechnologie]]></keywords>
<keywords lang="es"><![CDATA[empresas, areospaciales, tecnología de reactores]]></keywords>
<keywords lang="it"><![CDATA[azienda, industria aerospaziale, tecnologia dei reattori nucleari]]></keywords>
<keywords lang="fr"><![CDATA[companies, aérospatial, réacteurs nucléaires]]></keywords>
<keywords lang="nl"><![CDATA[bedrijf, ruimtevaartindustrie, nucleaire industrie]]></keywords>
<query><![CDATA[PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE { 
	?uri rdf:type dbo:Company  .
	?uri dbp:industry res:Aerospace .
        ?uri dbp:industry res:Nuclear_reactor_technology .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Curtiss-Wright</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="30" onlydbo="false">
<string lang="en"><![CDATA[Which state of the USA has the highest population density?]]></string>
<string lang="de"><![CDATA[Welcher Staat in den USA hat die höchste Bevölkerungsdichte?]]></string>
<string lang="es"><![CDATA[¿Que estado de los estados unidos de america tiene la mayor densidad de población?]]></string>
<string lang="it"><![CDATA[Quale stato appartenente agli Stati Uniti d'America ha la densità di popolazione maggiore?]]></string>
<string lang="fr"><![CDATA[Quel état des Etats-Unis a la plus haute densité de population?]]></string>
<string lang="nl"><![CDATA[Welke deelstaat van de Verenigde Staten heeft de hoogste bevolkingsdichtheid?]]></string>
<keywords lang="en"><![CDATA[state, USA, population density, highest]]></keywords>
<keywords lang="de"><![CDATA[Staat, USA, Bevölkerungsdichte, höchste]]></keywords>
<keywords lang="es"><![CDATA[estado, estados unidos de america, densidad de población]]></keywords>
<keywords lang="it"><![CDATA[stato, Stati Uniti d'America, maggiore densità di popolazione]]></keywords>
<keywords lang="fr"><![CDATA[densité de population, état des Etats-Unis]]></keywords>
<keywords lang="nl"><![CDATA[deelstaat van de Verenigde Staten, hoogste bevolkingsdichtheid]]></keywords>
<query><![CDATA[PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type yago:StatesOfTheUnitedStates .
        ?uri dbp:densityrank ?rank .
} 
ORDER BY ASC(?rank) LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/New_Jersey</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="92" onlydbo="true">
<string lang="en"><![CDATA[What is the highest mountain?]]></string>
<string lang="de"><![CDATA[Was ist der höchste Berg?]]></string>
<string lang="es"><![CDATA[¿Cuál es la montaña más alta?]]></string>
<string lang="it"><![CDATA[Qual è la montagna più alta?]]></string>
<string lang="fr"><![CDATA[Quelle est la montagne la plus haute?]]></string>
<string lang="nl"><![CDATA[Wat is de hoogste berg?]]></string>
<keywords lang="en"><![CDATA[mountain, highest]]></keywords>
<keywords lang="de"><![CDATA[höchster, Berg]]></keywords>
<keywords lang="es"><![CDATA[montaña, más alta]]></keywords>
<keywords lang="it"><![CDATA[montagna, più alta]]></keywords>
<keywords lang="fr"><![CDATA[montagne, la plus haute]]></keywords>
<keywords lang="nl"><![CDATA[hoogste berg]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
	?uri rdf:type dbo:Mountain  .
        ?uri dbo:elevation ?elevation .
} 
ORDER BY DESC(?elevation) LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Mount_Everest</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="78" onlydbo="true">
<string lang="en"><![CDATA[Give me all books written by Danielle Steel.]]></string>
<string lang="de"><![CDATA[Gib mir alle Bücher, die Danielle Steel geschrieben hat.]]></string>
<string lang="es"><![CDATA[Dame todos los libros escritos por Danielle Steel.]]></string>
<string lang="it"><![CDATA[Dammi tutti i libri scritti da Danielle Steel.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les livres écrits par Danielle Steel.]]></string>
<string lang="nl"><![CDATA[Noem alle boeken van Danielle Steel.]]></string>
<keywords lang="en"><![CDATA[book, written, Danielle Steel]]></keywords>
<keywords lang="de"><![CDATA[Buch, schreiben, Danielle Steel]]></keywords>
<keywords lang="es"><![CDATA[libors, escritos, Danielle Steel]]></keywords>
<keywords lang="it"><![CDATA[libri, scritti, Danielle Steel]]></keywords>
<keywords lang="fr"><![CDATA[livres, écrits, Danielle Steele]]></keywords>
<keywords lang="nl"><![CDATA[boek, Danielle Steel]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type dbo:Book .
        ?uri dbo:author res:Danielle_Steel .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/A_Perfect_Stranger</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Family_Album_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Wedding_(Steel_novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_Gift_(Steel_novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kaleidoscope_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Zoya_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Second_Chance_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Now_and_Forever_(Danielle_Steel_novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Season_of_Passion</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Thurston_House_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Fine_Things</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mixed_Blessings</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Message_from_Nam</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Wanderlust_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Silent_Honor</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sunset_in_St._Tropez</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Five_Days_in_Paris</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Daddy_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Accident_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Passion's_Promise</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jewels_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/One_Day_at_a_Time_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rogue_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Honor_Thyself</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/A_Good_Woman_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Amazing_Grace_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/H.R.H._(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Toxic_Bachelors_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ransom_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Coming_Out_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/The_House_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Family_Ties_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Impossible_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Echoes_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Safe_Harbour_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Matters_of_the_Heart_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Southern_Lights_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bungalow_2</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sisters_(Steel_novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Miracle_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Big_Girl_(novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Legacy_(2010_novel)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/No_Greater_Love_(novel)</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="73" onlydbo="true">
<string lang="en"><![CDATA[Who owns Aldi?]]></string>
<string lang="de"><![CDATA[Wem gehört Aldi?]]></string>
<string lang="es"><![CDATA[¿A quién pertenece Aldi?]]></string>
<string lang="it"><![CDATA[Chi possiede Aldi?]]></string>
<string lang="fr"><![CDATA[Qui possède Aldi?]]></string>
<string lang="nl"><![CDATA[Wie is de eigenaar van Aldi?]]></string>
<keywords lang="en"><![CDATA[own, Aldi]]></keywords>
<keywords lang="de"><![CDATA[gehören, Aldi]]></keywords>
<keywords lang="es"><![CDATA[pertenece, Aldi]]></keywords>
<keywords lang="it"><![CDATA[possedere, Aldi]]></keywords>
<keywords lang="fr"><![CDATA[possède, Aldi]]></keywords>
<keywords lang="nl"><![CDATA[eigenaar, Aldi]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri
WHERE {
	res:Aldi dbo:keyPerson ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Karl_Albrecht</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Theo_Albrecht</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="number" id="20" onlydbo="true">
<string lang="en"><![CDATA[How many employees does IBM have?]]></string>
<string lang="de"><![CDATA[Wieviele Angestellte hat IBM?]]></string>
<string lang="es"><![CDATA[¿Cuántos empleados tiene IBM?]]></string>
<string lang="it"><![CDATA[Quanti dipendenti ha IBM?]]></string>
<string lang="fr"><![CDATA[Combien d'employés a IBM?]]></string>
<string lang="nl"><![CDATA[Hoeveel medewerkers heeft IBM?]]></string>
<keywords lang="en"><![CDATA[IBM, employees]]></keywords>
<keywords lang="de"><![CDATA[IBM, Angestellte]]></keywords>
<keywords lang="es"><![CDATA[IBM, empleados]]></keywords>
<keywords lang="it"><![CDATA[IBM, dipendenti]]></keywords>
<keywords lang="fr"><![CDATA[employés, IBM]]></keywords>
<keywords lang="nl"><![CDATA[medewerkers, IBM]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?number 
WHERE {
	res:IBM dbo:numberOfEmployees ?number .
}]]></query>
<answers>
<answer>
<number>433362</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="42" onlydbo="true">
<string lang="en"><![CDATA[What are the official languages of the Philippines?]]></string>
<string lang="de"><![CDATA[Was sind die Amtssprachen der Philippinen?]]></string>
<string lang="es"><![CDATA[¿Cuáles son los idiomas oficiales de Las Philipinas?]]></string>
<string lang="it"><![CDATA[Quali sono le lingue ufficiali delle Filippine?]]></string>
<string lang="fr"><![CDATA[Quels sont les langues officielles des Philippines?]]></string>
<string lang="nl"><![CDATA[Wat zijn de  officiële talen van de Filippijnen?]]></string>
<keywords lang="en"><![CDATA[Philippines, official language]]></keywords>
<keywords lang="de"><![CDATA[Philippinen, Amtssprache]]></keywords>
<keywords lang="es"><![CDATA[Philipinas, idiomas oficiales]]></keywords>
<keywords lang="it"><![CDATA[Filippine, lingua ufficiale]]></keywords>
<keywords lang="fr"><![CDATA[langues officielles, Philippines]]></keywords>
<keywords lang="nl"><![CDATA[officiële talen, Filippijnen]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Philippines dbo:officialLanguage ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Filipino_language</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="boolean" id="46" onlydbo="true">
<string lang="en"><![CDATA[Is Frank Herbert still alive?]]></string>
<string lang="de"><![CDATA[Lebt Frank Herbert noch?]]></string>
<string lang="es"><![CDATA[¿Todavía vive Frank Herbert?]]></string>
<string lang="it"><![CDATA[Frank Herbert è ancora vivo?]]></string>
<string lang="fr"><![CDATA[Frank Herbert est-il encore en vie?]]></string>
<string lang="nl"><![CDATA[Leeft Frank Herbert nog?]]></string>
<keywords lang="en"><![CDATA[Frank Herbert, alive]]></keywords>
<keywords lang="de"><![CDATA[Frank Herbert, leben]]></keywords>
<keywords lang="es"><![CDATA[Frank Herbert, vive]]></keywords>
<keywords lang="it"><![CDATA[Frank Herbert, vivente]]></keywords>
<keywords lang="fr"><![CDATA[Frank Herbert, en vie]]></keywords>
<keywords lang="nl"><![CDATA[Frank Herbert, leeft]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
	OPTIONAL { res:Frank_Herbert dbo:deathDate ?date . }
        FILTER (!BOUND(?date))
}]]></query>
<answers>
<answer>
<boolean>False</boolean>
</answer>
</answers>
</question>
