<?xml version="1.0" ?>
<dataset id="dbpedia-train">
<question aggregation="false" answertype="string" id="56" onlydbo="false">
<string lang="en"><![CDATA[What is the official website of Tom Cruise?]]></string>
<string lang="de"><![CDATA[Was ist die offizielle Website von Tom Cruise?]]></string>
<string lang="es"><![CDATA[¿Cuál el la página de Web oficial de Tom Cruise?]]></string>
<string lang="it"><![CDATA[Qual è il sito internet ufficiale di Tom Cruise?]]></string>
<string lang="fr"><![CDATA[Quel est le site web officiel de Tom Cruise?]]></string>
<string lang="nl"><![CDATA[Wat is de officiële website van Tom Cruise?]]></string>
<keywords lang="en"><![CDATA[Tom Cruise, official website]]></keywords>
<keywords lang="de"><![CDATA[Tom Cruise, offizielle Website]]></keywords>
<keywords lang="es"><![CDATA[Tom Cruise, página de Web oficial]]></keywords>
<keywords lang="it"><![CDATA[Tom Cruise, sito internet ufficiale]]></keywords>
<keywords lang="fr"><![CDATA[site web officiel, Tom Cruise]]></keywords>
<keywords lang="nl"><![CDATA[officiële website, Tom Cruise]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?string 
WHERE { 
	res:Tom_Cruise foaf:homepage ?string .
}]]></query>
<answers>
<answer>
<uri>http://www.tomcruise.com/</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="76" onlydbo="true">
<string lang="en"><![CDATA[How many films did Hal Roach produce?]]></string>
<string lang="de"><![CDATA[Wieviele Filme hat Hal Roach produziert?]]></string>
<string lang="es"><![CDATA[¿Cuántas películas ha producido Hal Roach?]]></string>
<string lang="it"><![CDATA[Quanti film ha prodotto Hal Roach?]]></string>
<string lang="fr"><![CDATA[Combien de films ont été produit par Hal Roach?]]></string>
<string lang="nl"><![CDATA[Hoeveel films heeft Hal Roach geproduceerd?]]></string>
<keywords lang="en"><![CDATA[Hal Roach, produce, film]]></keywords>
<keywords lang="de"><![CDATA[Hal Roach, produzieren, Film]]></keywords>
<keywords lang="es"><![CDATA[películas, producido, Hal Roach]]></keywords>
<keywords lang="it"><![CDATA[film, prodotto, Hal Roach]]></keywords>
<keywords lang="fr"><![CDATA[combien, films, Hal Roach]]></keywords>
<keywords lang="nl"><![CDATA[Hal Roach, producent, film]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
SELECT COUNT(DISTINCT ?uri) 
WHERE {
      ?uri dbo:producer res:Hal_Roach .
}]]></query>
<answers>
<answer>
<number>509</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="10" onlydbo="true">
<string lang="en"><![CDATA[In which country does the Nile start?]]></string>
<string lang="de"><![CDATA[In welchem Land entspringt der Nil?]]></string>
<string lang="es"><![CDATA[¿En qué país nace el Nilo?]]></string>
<string lang="it"><![CDATA[In quale stato nasce il Nilo?]]></string>
<string lang="fr"><![CDATA[Dans quel pays commence le Nil?]]></string>
<string lang="nl"><![CDATA[In welk land ontspringt de Nijl?]]></string>
<keywords lang="en"><![CDATA[Nile, start, country]]></keywords>
<keywords lang="de"><![CDATA[Nil, entspringen, Land]]></keywords>
<keywords lang="es"><![CDATA[Nilo, país, orígen]]></keywords>
<keywords lang="it"><![CDATA[Nilo, stato, origine]]></keywords>
<keywords lang="fr"><![CDATA[pays, commence, Nil]]></keywords>
<keywords lang="nl"><![CDATA[ontspringt, Nijl]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {       
        res:Nile dbo:sourceCountry ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Ethiopia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rwanda</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="8" onlydbo="false">
<string lang="en"><![CDATA[Which states of Germany are governed by the Social Democratic Party?]]></string>
<string lang="de"><![CDATA[Welche Bundesländer in Deutschland werden von der SPD regiert?]]></string>
<string lang="es"><![CDATA[¿En qué estados federales de Alemania gobierna la SPD?]]></string>
<string lang="it"><![CDATA[In quali stati federati della Germania governa il Partito Socialista Democratico?]]></string>
<string lang="fr"><![CDATA[Quels sont les états d'Allemagne gouvernés par le parti social-démocrate d'Allemagne?]]></string>
<string lang="nl"><![CDATA[In welke Duitse deelstaten is de SPD aan de macht?]]></string>
<keywords lang="en"><![CDATA[state, Germany, govern, Social Democratic Party]]></keywords>
<keywords lang="de"><![CDATA[Deutschland, Bundesland, regieren, SPD]]></keywords>
<keywords lang="es"><![CDATA[estado federal, Alemania, gobierna, SPD]]></keywords>
<keywords lang="it"><![CDATA[stato federato, Germania, governo, Partito Socialista Democratico]]></keywords>
<keywords lang="fr"><![CDATA[états d'Allemagne, parti social-démocrate d'Allemagne, gouvernés]]></keywords>
<keywords lang="nl"><![CDATA[Duitse deelstaat, SPD, aan de macht]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type yago:StatesOfGermany .
        { ?uri dbp:rulingParty 'SPD'@en . } UNION { ?uri dbp:rulingParty res:Social_Democratic_Party_of_Germany . } 
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Brandenburg</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Hamburg</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Thuringia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/North_Rhine-Westphalia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Saxony-Anhalt</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mecklenburg-Vorpommern</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rhineland-Palatinate</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Baden-W%C3%BCrttemberg</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bremen_(state)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Berlin</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="47" onlydbo="true">
<string lang="en"><![CDATA[What is the highest place of Karakoram?]]></string>
<string lang="de"><![CDATA[Was ist die höhchste Stelle des Karakorum?]]></string>
<string lang="es"><![CDATA[¿Cuál es el punto más alto del Karakorum?]]></string>
<string lang="it"><![CDATA[Qual è il punto più alto del Karakoram?]]></string>
<string lang="fr"><![CDATA[Quel est l'endroit le plus haut du Karakoram?]]></string>
<string lang="nl"><![CDATA[Wat is het hoogste punt van de Karakoram?]]></string>
<keywords lang="en"><![CDATA[Karakoram, highest place]]></keywords>
<keywords lang="de"><![CDATA[Karakorum, höchste Stelle]]></keywords>
<keywords lang="es"><![CDATA[Karakorum, punto más alto]]></keywords>
<keywords lang="it"><![CDATA[Karakoram, punto più alto]]></keywords>
<keywords lang="fr"><![CDATA[Karakoram, endroit le plus haut]]></keywords>
<keywords lang="nl"><![CDATA[hoogste punt, Karakoram]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {       
        res:Karakoram dbo:highestPlace ?uri .  
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/K2</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="17" onlydbo="false">
<string lang="en"><![CDATA[Give me all cities in New Jersey with more than 100000 inhabitants.]]></string>
<string lang="de"><![CDATA[Gib mir alle Städte in New Jersey, die mehr als 100000 Einwohner haben.]]></string>
<string lang="es"><![CDATA[Dame todas las cuidades en New Jersey que tengan más de 100000 habitantes.]]></string>
<string lang="it"><![CDATA[Dammi tutte le città del New Jersey con più di 100000 abitanti.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les villes du New Jersey avec plus de 100000 habitants.]]></string>
<string lang="nl"><![CDATA[Geef alle steden in New Jersey met meer dan 100000 inwoners.]]></string>
<keywords lang="en"><![CDATA[New Jersey, city, inhabitants, more than 100000]]></keywords>
<keywords lang="de"><![CDATA[New Jersey, Stadt, Einwohner, mehr als 100000]]></keywords>
<keywords lang="es"><![CDATA[New Jersey, ciudad, habitantes, más de 100000]]></keywords>
<keywords lang="it"><![CDATA[New Jersey, città, abitanti, più di 100000]]></keywords>
<keywords lang="fr"><![CDATA[New Jersey, villes, habitants, plus de 100000]]></keywords>
<keywords lang="nl"><![CDATA[New Jersey, stad, inwoners, meer dan 100000]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type dbo:City .
        ?uri dbo:isPartOf res:New_Jersey .
        ?uri dbp:populationTotal ?inhabitants .
        FILTER (?inhabitants > 100000) .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Newark,_New_Jersey</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jersey_City,_New_Jersey</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Paterson,_New_Jersey</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Elizabeth,_New_Jersey</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="13" onlydbo="false">
<string lang="en"><![CDATA[Which classis do tree frogs belong to?]]></string>
<string lang="de"><![CDATA[Welcher Klasse gehören Laubfrösche an?]]></string>
<string lang="es"><![CDATA[¿A qué especie pertenece la rana verde?]]></string>
<string lang="it"><![CDATA[A quale specie appartiene la rana verde?]]></string>
<string lang="fr"><![CDATA[A quelle classe apartiennent les grenouilles arboricoles?]]></string>
<string lang="nl"><![CDATA[Tot welke klasse behoren boomkikkers?]]></string>
<keywords lang="en"><![CDATA[tree frog, classis]]></keywords>
<keywords lang="de"><![CDATA[Laubfrosch, Klasse]]></keywords>
<keywords lang="es"><![CDATA[rana verde, especie]]></keywords>
<keywords lang="it"><![CDATA[rana verde, specie]]></keywords>
<keywords lang="fr"><![CDATA[grenouilles arboricoles, classe]]></keywords>
<keywords lang="nl"><![CDATA[klasse, boomkikker]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
       res:Hylidae dbp:classis ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Amphibian</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Amphibia</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="15" onlydbo="true">
<string lang="en"><![CDATA[Who created Goofy?]]></string>
<string lang="de"><![CDATA[Wer hat Goofy erfunden?]]></string>
<string lang="es"><![CDATA[¿Quién es el creador de Goofy?]]></string>
<string lang="it"><![CDATA[Chi è il creatore di Goofy?]]></string>
<string lang="fr"><![CDATA[Qui est le créateur de Goofy?]]></string>
<string lang="nl"><![CDATA[Wie bedacht Goofy?]]></string>
<keywords lang="en"><![CDATA[created, Goofy]]></keywords>
<keywords lang="de"><![CDATA[erfinden, Goofy]]></keywords>
<keywords lang="es"><![CDATA[creador, Goofy]]></keywords>
<keywords lang="it"><![CDATA[creatore, Goofy]]></keywords>
<keywords lang="fr"><![CDATA[Goofy, créateur]]></keywords>
<keywords lang="nl"><![CDATA[bedenker, Goofy]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Goofy dbo:creator ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Art_Babbitt</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="43" onlydbo="true">
<string lang="en"><![CDATA[Who is the mayor of New York City?]]></string>
<string lang="de"><![CDATA[Wer ist der Bürgermeister von New York City?]]></string>
<string lang="es"><![CDATA[¿Quién es el alcalde de la cuidad de Nueva York?]]></string>
<string lang="it"><![CDATA[Chi è il sindaco della città di New York?]]></string>
<string lang="fr"><![CDATA[Qui est le maire de New York City?]]></string>
<string lang="nl"><![CDATA[Wie is de burgemeester van New York?]]></string>
<keywords lang="en"><![CDATA[New York City, mayor]]></keywords>
<keywords lang="de"><![CDATA[New York City, Bürgermeister]]></keywords>
<keywords lang="es"><![CDATA[cuidad de Nueva York, alcalde]]></keywords>
<keywords lang="it"><![CDATA[città di New York, sindaco]]></keywords>
<keywords lang="fr"><![CDATA[maire, New York City]]></keywords>
<keywords lang="nl"><![CDATA[burgemeester, New York]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:New_York_City dbo:leaderName ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Michael_Bloomberg</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="52" onlydbo="false">
<string lang="en"><![CDATA[Which presidents were born in 1945?]]></string>
<string lang="de"><![CDATA[Welche Präsidenten wurden 1945 geboren?]]></string>
<string lang="es"><![CDATA[¿Qué presidentes nacieron en 1945?]]></string>
<string lang="it"><![CDATA[Quali presidenti sono nati nel 1945?]]></string>
<string lang="fr"><![CDATA[Quels présidents sont nés en 1945?]]></string>
<string lang="nl"><![CDATA[Welke presidenten werden geboren in 1945?]]></string>
<keywords lang="en"><![CDATA[president, born, 1945]]></keywords>
<keywords lang="de"><![CDATA[Präsident, geboren, 1945]]></keywords>
<keywords lang="es"><![CDATA[presidentes nacidos 1945]]></keywords>
<keywords lang="it"><![CDATA[presidente, nato, 1945]]></keywords>
<keywords lang="fr"><![CDATA[présidents, nés, 1945]]></keywords>
<keywords lang="nl"><![CDATA[president, geboren, 1945]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	{ ?uri rdf:type dbo:President . }
	UNION
	{ ?uri rdf:type yago:Presidents . }
        ?uri dbo:birthDate ?date .
	FILTER regex(?date, '^1945') .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Igor_Ivanov</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Moshe_Katsav</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lee_Jong-wook</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Vladislav_Ardzinba</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Joe_Ghiz</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jorge_Serrano_El%C3%ADas</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/John_Olsen</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/John_Fahey_(politician)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Zlatko_Tom%C4%8Di%C4%87</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mom%C4%8Dilo_Kraji%C5%A1nik</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Akbar_Tanjung</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Charles_Margai</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Joe_Robert_Pemagbi</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Faruk_S%C3%BCren</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Radovan_Karad%C5%BEi%C4%87</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Abdirahman_Farole</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Yuriy_Meshkov</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="36" onlydbo="false">
<string lang="en"><![CDATA[Through which countries does the Yenisei river flow?]]></string>
<string lang="de"><![CDATA[Durch welche Länder fließt der Yenisei?]]></string>
<string lang="es"><![CDATA[¿Por qué países fluye el río Yenisei?]]></string>
<string lang="it"><![CDATA[Attraverso quali stati scorre il fiume Yenisei?]]></string>
<string lang="fr"><![CDATA[Quels sont les pays traversés par l'Ienisseï?]]></string>
<string lang="nl"><![CDATA[Door welke landen stroomt de Jenisej?]]></string>
<keywords lang="en"><![CDATA[Yenisei river, flow through, country]]></keywords>
<keywords lang="de"><![CDATA[Yenisei, fließen, Land]]></keywords>
<keywords lang="es"><![CDATA[países, fluye, río Yenisei]]></keywords>
<keywords lang="it"><![CDATA[fiume Yenisei, scorrere attraverso, stato]]></keywords>
<keywords lang="fr"><![CDATA[Ienisseï, pays traversés]]></keywords>
<keywords lang="nl"><![CDATA[Jenisej, land, stroomt door]]></keywords>
<query><![CDATA[PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri 
WHERE {
        res:Yenisei_River dbp:country ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Mongolia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Russia</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="18" onlydbo="false">
<string lang="en"><![CDATA[Which museum exhibits The Scream by Munch?]]></string>
<string lang="de"><![CDATA[In welchem Museum ist Der Schrei von Munch ausgestellt?]]></string>
<string lang="es"><![CDATA[¿En qué museo está expuesto el Grito de Munch?]]></string>
<string lang="it"><![CDATA[Quale museo è esposto l'Urlo di Munch?]]></string>
<string lang="fr"><![CDATA[Dans quel musée est exposé Le Cri de Munch?]]></string>
<string lang="nl"><![CDATA[In welk museum hangt De Schreeuw van Munch?]]></string>
<keywords lang="en"><![CDATA[museum, Scream, Munch]]></keywords>
<keywords lang="de"><![CDATA[Museum, Schrei, Munch]]></keywords>
<keywords lang="es"><![CDATA[museo, El Grito, Munch]]></keywords>
<keywords lang="it"><![CDATA[museo, l'Urlo, Munch]]></keywords>
<keywords lang="fr"><![CDATA[musée, le Cri, Munch]]></keywords>
<keywords lang="nl"><![CDATA[museum, De Schreeuw, Munch]]></keywords>
<query><![CDATA[PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
	res:The_Scream dbp:museum ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/National_Gallery_of_Norway</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/National_Gallery,_Oslo</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="16" onlydbo="false">
<string lang="en"><![CDATA[Give me the capitals of all countries in Africa.]]></string>
<string lang="de"><![CDATA[Gib mir die Haupstädte von allen Ländern in Afrika.]]></string>
<string lang="es"><![CDATA[Dame las capitales de todos los países africanos.]]></string>
<string lang="it"><![CDATA[Dammi le capitali di tutti gli stati dell'Africa.]]></string>
<string lang="fr"><![CDATA[Donnes-moi la capitale de chaque pays d'Afrique.]]></string>
<string lang="nl"><![CDATA[Noem de hoofdsteden van alle landen in Afrika.]]></string>
<keywords lang="en"><![CDATA[Africa, country, capital]]></keywords>
<keywords lang="de"><![CDATA[Afrika, Land, Hauptstadt]]></keywords>
<keywords lang="es"><![CDATA[países, africanos, capital]]></keywords>
<keywords lang="it"><![CDATA[Africa, stato, capitale]]></keywords>
<keywords lang="fr"><![CDATA[capitale, pays, Afrique]]></keywords>
<keywords lang="nl"><![CDATA[Africa, land, hoof]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE { 
	?states rdf:type yago:AfricanCountries .
        ?states dbo:capital ?uri .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Freetown</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gaborone</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bujumbura</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Port_Louis</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lilongwe</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bamako</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Rabat</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Antananarivo</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Windhoek</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Niamey</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Abuja</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Yaound%C3%A9</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Nairobi</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Asmara</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Addis_Ababa</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Djibouti_(city)</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mogadishu</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Dakar</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mbabane</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lobamba</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Cape_Town</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Pretoria</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bloemfontein</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Victoria,_Seychelles</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Harare</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lusaka</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Porto-Novo</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Nouakchott</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Luanda</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Algiers</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Dodoma</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tunis</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Lom%C3%A9</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Cairo</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Kigali</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Praia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Ouagadougou</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Libreville</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Bissau</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Banjul</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Accra</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Maseru</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Monrovia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Tripoli</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Yamoussoukro</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="11" onlydbo="true">
<string lang="en"><![CDATA[Which countries have places with more than two caves?]]></string>
<string lang="de"><![CDATA[In welchen Ländern gibt es Orte mit mehr als zwei Höhlen?]]></string>
<string lang="es"><![CDATA[¿Qué países tienen lugares con más de dos cuevas?]]></string>
<string lang="it"><![CDATA[Quali nazioni hanno luoghi con più di due grotte?]]></string>
<string lang="fr"><![CDATA[Quels pays ont des lieux avec plus de deux grottes?]]></string>
<string lang="nl"><![CDATA[Welke landen hebben plaatsen met meer dan twee grotten?]]></string>
<keywords lang="en"><![CDATA[country, place, cave, more than two]]></keywords>
<keywords lang="de"><![CDATA[Land, Ort, Höhle, mehr als zwei]]></keywords>
<keywords lang="es"><![CDATA[país, lugar, cuevas, más de dos]]></keywords>
<keywords lang="it"><![CDATA[nazione, luogo, grotta, più di due]]></keywords>
<keywords lang="fr"><![CDATA[pays, lieux, grottes, plus de deux]]></keywords>
<keywords lang="nl"><![CDATA[land, plaatsen, grotten, meer dan twee]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {       
        ?cave rdf:type dbo:Cave . 
        ?cave dbo:location ?uri .
        ?uri rdf:type dbo:Country .
} 
GROUP BY ?uri
HAVING (COUNT(?cave) > 2)]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/United_Kingdom</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Italy</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Scotland</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/England</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Wales</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Slovenia</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/United_States</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Republic_of_Ireland</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Mexico</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Greece</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Gibraltar</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Turkey</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Jamaica</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Brazil</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Germany</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Vietnam</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/China</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Venezuela</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="28" onlydbo="false">
<string lang="en"><![CDATA[Which European countries have a constitutional monarchy?]]></string>
<string lang="de"><![CDATA[Welche europäischen Länder haben eine konstitutionelle Monarchie?]]></string>
<string lang="es"><![CDATA[¿Qué países europeos tienen una monarquía constitucional?]]></string>
<string lang="it"><![CDATA[Quali nazioni europee hanno una monarchia costituzionale?]]></string>
<string lang="fr"><![CDATA[Quels pays d'Europe ont une monarchie constitutionnelle?]]></string>
<string lang="nl"><![CDATA[Welke Europese landen zijn een constitutionele monarchie?]]></string>
<keywords lang="en"><![CDATA[European country, constitutional monarchy]]></keywords>
<keywords lang="de"><![CDATA[euopäisches Land, konstitutionelle Monarchie]]></keywords>
<keywords lang="es"><![CDATA[países europeos, monarquía constitucional]]></keywords>
<keywords lang="it"><![CDATA[nazione europea, monarchia costituzionale]]></keywords>
<keywords lang="fr"><![CDATA[monarchie constitutionnelle, pays, Europe]]></keywords>
<keywords lang="nl"><![CDATA[Europees land, constitutionele monarchie]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type yago:EuropeanCountries .
        ?uri dbo:governmentType res:Constitutional_monarchy .
}]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Netherlands</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Sweden</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Monaco</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Andorra</uri>
</answer>
<answer>
<uri>http://dbpedia.org/resource/Luxembourg</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="40" onlydbo="true">
<string lang="en"><![CDATA[What is the highest mountain in Australia?]]></string>
<string lang="de"><![CDATA[Was ist der höchste Berg in Australien?]]></string>
<string lang="es"><![CDATA[¿Cuál es la montaña más alta de Australia?]]></string>
<string lang="it"><![CDATA[Qual è la montagna più alta d'Australia?]]></string>
<string lang="fr"><![CDATA[Quelle est la plus haute montagne d'Australie?]]></string>
<string lang="nl"><![CDATA[Wat is de hoogste berg van Australië?]]></string>
<keywords lang="en"><![CDATA[Australia, highest mountain]]></keywords>
<keywords lang="de"><![CDATA[Australien, höchster Berg]]></keywords>
<keywords lang="es"><![CDATA[Australia, montaña más alta]]></keywords>
<keywords lang="it"><![CDATA[Australia, montagna più alta]]></keywords>
<keywords lang="fr"><![CDATA[plus haute montagne, Australie]]></keywords>
<keywords lang="nl"><![CDATA[Australië, hoogste berg]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type dbo:Mountain .
        ?uri dbo:locatedInArea res:Australia .
        ?uri dbo:elevation ?elevation .
} 
ORDER BY DESC(?elevation) LIMIT 1]]></query>
<answers>
<answer>
<uri>http://dbpedia.org/resource/Mawson_Peak</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="66" onlydbo="true">
<string lang="en"><![CDATA[Is Christian Bale starring in Batman Begins?]]></string>
<string lang="de"><![CDATA[Spielt Christian Bale in Batman Begins mit?]]></string>
<string lang="es"><![CDATA[¿Actúa Christian Bale en Batman Begins?]]></string>
<string lang="it"><![CDATA[Christian Bale ha recitato in Batman Begins?]]></string>
<string lang="fr"><![CDATA[Christian Bale joue-t-il dans Batman Begins?]]></string>
<string lang="nl"><![CDATA[Speelt Christian Bale in Batman Begins?]]></string>
<keywords lang="en"><![CDATA[Christian Bale, starring, Batman Begins]]></keywords>
<keywords lang="de"><![CDATA[Christian Bale, mitspielen, Batman Begins]]></keywords>
<keywords lang="es"><![CDATA[Christian Bale, actúa, Batman Begins]]></keywords>
<keywords lang="it"><![CDATA[Christian Bale, recitare, Batman Begins]]></keywords>
<keywords lang="fr"><![CDATA[Christian Bale, joue, Batman Begins]]></keywords>
<keywords lang="nl"><![CDATA[Christian Bale, speelt in, Batman Begins]]></keywords>
<query><![CDATA[PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
	res:Batman_Begins dbo:starring res:Christian_Bale .
}]]></query>
<answers>
<answer>
<boolean>False</boolean>
</answer>
</answers>
</question>
