<?xml version="1.0" encoding="UTF-8"?>
<dataset id="dbpedia-train">

<question id="1" answertype="resource" aggregation="false" onlydbo="false">
<string lang="en"><![CDATA[
Give me all female Russian astronauts.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle russischen Astronautinnen.
]]></string>
<string lang="es"><![CDATA[
Dame todas las astronautas rusas.
]]></string>
<string lang="it"><![CDATA[
Dammi tutte le austronaute russe.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les astronautes féminins russes.
]]></string>
<string lang="nl"><![CDATA[
Geef alle vrouwelijke Russische astronauten.
]]></string>
<keywords lang="en"><![CDATA[ 
astronaut, female, Russian
]]></keywords>
<keywords lang="de"><![CDATA[ 
Astronautin, russisch
]]></keywords>
<keywords lang="es"><![CDATA[ 
astronautas rusas
]]></keywords>
<keywords lang="it"><![CDATA[ 
austronaute, russe
]]></keywords>
<keywords lang="fr"><![CDATA[ 
astronaute, russes, féminins
]]></keywords>
<keywords lang="nl"><![CDATA[ 
astronaut, vrouwelijk, Russisch
]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
	?uri rdf:type yago:RussianCosmonauts .
        ?uri rdf:type yago:FemaleAstronauts .
}
]]></query>
</question>

<question id="13" answertype="resource" aggregation="false" onlydbo="false">
<string lang="en"><![CDATA[
Which classis do tree frogs belong to?
]]></string>
<string lang="de"><![CDATA[
Welcher Klasse gehören Laubfrösche an?
]]></string>
<string lang="es"><![CDATA[
¿A qué especie pertenece la rana verde?
]]></string>
<string lang="it"><![CDATA[
A quale specie appartiene la rana verde?
]]></string>
<string lang="fr"><![CDATA[
A quelle classe apartiennent les grenouilles arboricoles?
]]></string>
<string lang="nl"><![CDATA[
Tot welke klasse behoren boomkikkers?
]]></string>
<keywords lang="en"><![CDATA[ 
tree frog, classis
]]></keywords>
<keywords lang="de"><![CDATA[ 
Laubfrosch, Klasse
]]></keywords>
<keywords lang="es"><![CDATA[ 
rana verde, especie
]]></keywords>
<keywords lang="it"><![CDATA[ 
rana verde, specie
]]></keywords>
<keywords lang="fr"><![CDATA[ 
grenouilles arboricoles, classe
]]></keywords>
<keywords lang="nl"><![CDATA[ 
klasse, boomkikker
]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
       res:Hylidae dbp:classis ?uri .
}
]]></query>
</question>

<question id="17" answertype="resource" aggregation="true" onlydbo="false">
<string lang="en"><![CDATA[
Give me all cities in New Jersey with more than 100000 inhabitants.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Städte in New Jersey, die mehr als 100000 Einwohner haben.
]]></string>
<string lang="es"><![CDATA[
Dame todas las cuidades en New Jersey que tengan más de 100000 habitantes.
]]></string>
<string lang="it"><![CDATA[
Dammi tutte le città del New Jersey con più di 100000 abitanti.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi toutes les villes du New Jersey avec plus de 100000 habitants.
]]></string>
<string lang="nl"><![CDATA[
Geef alle steden in New Jersey met meer dan 100000 inwoners.
]]></string>
<keywords lang="en"><![CDATA[ 
New Jersey, city, inhabitants, more than 100000
]]></keywords>
<keywords lang="de"><![CDATA[ 
New Jersey, Stadt, Einwohner, mehr als 100000
]]></keywords>
<keywords lang="es"><![CDATA[ 
New Jersey, ciudad, habitantes, más de 100000
]]></keywords>
<keywords lang="it"><![CDATA[ 
New Jersey, città, abitanti, più di 100000
]]></keywords>
<keywords lang="fr"><![CDATA[ 
New Jersey, villes, habitants, plus de 100000
]]></keywords>
<keywords lang="nl"><![CDATA[ 
New Jersey, stad, inwoners, meer dan 100000
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type dbo:City .
        ?uri dbo:isPartOf res:New_Jersey .
        ?uri dbp:populationTotal ?inhabitants .
        FILTER (?inhabitants > 100000) .
}
]]></query>
</question>

<question id="49" answertype="resource" aggregation="false" onlydbo="false">
<string lang="en"><![CDATA[
Give me all companies in the advertising industry.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Unternehmen, die in der Werbebranche tätig sind.
]]></string>
<string lang="es"><![CDATA[
Dame todas las empresas publicitarias.
]]></string>
<string lang="it"><![CDATA[
Dammi tutte le aziende pubblicitarie.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi toutes les agences de publicité.
]]></string>
<string lang="nl"><![CDATA[
Noem alle bedrijven die in de reclamebranche actief zijn.
]]></string>
<keywords lang="en"><![CDATA[ 
company, advertising industry
]]></keywords>
<keywords lang="de"><![CDATA[ 
Unternehmen, Werbebranche
]]></keywords>
<keywords lang="es"><![CDATA[ 
empresas publicitarias
]]></keywords>
<keywords lang="it"><![CDATA[ 
aziende pubblicitarie
]]></keywords>
<keywords lang="fr"><![CDATA[ 
agences de publicité
]]></keywords>
<keywords lang="nl"><![CDATA[ 
bedrijf, reclamebranche
]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE { 
	?uri rdf:type dbo:Company  .
        ?uri dbp:industry ?industry .
        FILTER regex(?industry,'advertising','i') .
}
]]></query>
</question>

<question id="51" answertype="resource" aggregation="false" onlydbo="false">
<string lang="en"><![CDATA[
Give me all school types.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Schultypen.
]]></string>
<string lang="es"><![CDATA[
Dame todos los tipos de escuela.
]]></string>
<string lang="it"><![CDATA[
Dammi tutti i tipi di scuola.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous ley types d'écoles.
]]></string>
<string lang="nl"><![CDATA[
Noem alle schooltypes.
]]></string>
<keywords lang="en"><![CDATA[ 
school type
]]></keywords>
<keywords lang="de"><![CDATA[ 
Schultyp
]]></keywords>
<keywords lang="es"><![CDATA[ 
tipos de escuela
]]></keywords>
<keywords lang="it"><![CDATA[ 
tipo di scuola
]]></keywords>
<keywords lang="fr"><![CDATA[ 
types d'écoles
]]></keywords>
<keywords lang="nl"><![CDATA[ 
schooltype
]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
	?uri rdf:type yago:SchoolTypes .
}
]]></query>
</question>

<question id="53" answertype="resource" aggregation="false" onlydbo="false">
<string lang="en"><![CDATA[
Give me all presidents of the United States.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Präsidenten der Vereinigten Staaten.
]]></string>
<string lang="es"><![CDATA[
Dame todos los presidentes de los estados unidos de américa.
]]></string>
<string lang="it"><![CDATA[
Dammi tutti i presidenti degli Stati Uniti.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les présidents des Etats-Unis.
]]></string>
<string lang="nl"><![CDATA[
Noem alle presidenten van de Verenigde Staten.
]]></string>
<keywords lang="en"><![CDATA[ 
United States, president
]]></keywords>
<keywords lang="de"><![CDATA[ 
Vereinigte Staaten, Präsident
]]></keywords>
<keywords lang="es"><![CDATA[ 
estados unidos, presidente
]]></keywords>
<keywords lang="it"><![CDATA[ 
Stati Uniti, presidente
]]></keywords>
<keywords lang="fr"><![CDATA[ 
Etats-Unis, présidents
]]></keywords>
<keywords lang="nl"><![CDATA[ 
president, Verenigde Staten
]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Person .
        { ?uri rdf:type yago:PresidentsOfTheUnitedStates. }
        UNION
        { ?uri rdf:type dbo:President.
          ?uri dbp:title res:President_of_the_United_States. }
}
]]></query>
</question>

<question id="63" answertype="resource" aggregation="false" onlydbo="false">
<string lang="en"><![CDATA[
Give me all actors starring in Last Action Hero.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.
]]></string>
<string lang="es"><![CDATA[
Dame todos los actores que hayan actuado en Last Action Hero.
]]></string>
<string lang="it"><![CDATA[
Dammi tutti gli attori che hanno recitato in Last Action Hero.
]]></string>
<string lang="fr"><![CDATA[
Noem alle acteurs uit de film Last Action Hero.
]]></string>
<string lang="nl"><![CDATA[
Noem alle acteurs uit de film Last Action Hero.
]]></string>
<keywords lang="en"><![CDATA[ 
actor, starring, Last Action Hero
]]></keywords>
<keywords lang="de"><![CDATA[ 
Schauspieler, mitspielen, Last Action Hero
]]></keywords>
<keywords lang="es"><![CDATA[ 
actores, Last Action Hero
]]></keywords>
<keywords lang="it"><![CDATA[ 
attori, Last Action Hero
]]></keywords>
<keywords lang="fr"><![CDATA[ 
acteurs, Last Action Hero
]]></keywords>
<keywords lang="nl"><![CDATA[ 
acteur, Last Action Hero
]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:Last_Action_Hero dbp:starring ?uri .
}
]]></query>
</question>

<question id="65" answertype="resource" aggregation="false" onlydbo="false">
<string lang="en"><![CDATA[
Which companies work in the aerospace industry as well as on nuclear reactor technology?
]]></string>
<string lang="de"><![CDATA[
Welche Unternehmen sind sowohl in der Luft- und Raumfahrt als auch im Bereich der Reaktortechnologie tätig?
]]></string>
<string lang="es"><![CDATA[
¿Qué empresas aerospaciales trabajar también en en tecnología de reactores?
]]></string>
<string lang="it"><![CDATA[
Quali aziende lavorano sia nell'industria aerospaziale che sulle tecnologie dei reattori nucleari?
]]></string>
<string lang="fr"><![CDATA[
Quelles companies travaillent dans l'aérospatial et dans les réacteurs nucléaires?
]]></string>
<string lang="nl"><![CDATA[
Welke bedrijven zijn zowel actief in de ruimtevaartindustrie als in de nucleaire industrie?
]]></string>
<keywords lang="en"><![CDATA[ 
company, aerospace industry, nuclear reactor technology
]]></keywords>
<keywords lang="de"><![CDATA[ 
Unternehmen, Luft- und Raumfahrt, Reaktortechnologie
]]></keywords>
<keywords lang="es"><![CDATA[ 
empresas, areospaciales, tecnología de reactores
]]></keywords>
<keywords lang="it"><![CDATA[ 
azienda, industria aerospaziale, tecnologia dei reattori nucleari
]]></keywords>
<keywords lang="fr"><![CDATA[ 
companies, aérospatial, réacteurs nucléaires
]]></keywords>
<keywords lang="nl"><![CDATA[ 
bedrijf, ruimtevaartindustrie, nucleaire industrie
]]></keywords>
<query><![CDATA[
PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE { 
	?uri rdf:type dbo:Company  .
	?uri dbp:industry res:Aerospace .
        ?uri dbp:industry res:Nuclear_reactor_technology .
}
]]></query>
</question>

<question id="67" answertype="string" aggregation="true" onlydbo="false">
<string lang="en"><![CDATA[
Give me the websites of companies with more than 500000 employees.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Webseiten von Unternehmen mit mehr als 500000 Angestellten.
]]></string>
<string lang="es"><![CDATA[
Dame todas las páginas de Web de empresas con más de 500000 empleados.
]]></string>
<string lang="it"><![CDATA[
Dammi tutti i siti internet di aziende con più di 500000 dipendenti.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi les sites webs de companies avec plus de 500000 employés.
]]></string>
<string lang="nl"><![CDATA[
Geef me de websites van alle ondernemingen met meer dan 500000 werknemers.
]]></string>
<keywords lang="en"><![CDATA[ 
website, company, employee, more than 500000
]]></keywords>
<keywords lang="de"><![CDATA[ 
Webseite, Unternehmen, Angestellte, mehr als 500000
]]></keywords>
<keywords lang="es"><![CDATA[ 
página de Web, empreasas, empleados, más de 500000
]]></keywords>
<keywords lang="it"><![CDATA[ 
sito internet, azienda, dipendenti, più di 500000
]]></keywords>
<keywords lang="fr"><![CDATA[ 
sites webs, companies, plus de 500000 employés
]]></keywords>
<keywords lang="nl"><![CDATA[ 
website, onderneming, werknemers, meer dan 500000
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
SELECT DISTINCT ?string 
WHERE {
	?subject rdf:type dbo:Company .
	?subject dbp:numEmployees ?employees .
	FILTER( xsd:integer(?employees) > 500000 ) .
	?subject foaf:homepage ?string .
}
]]></query>
</question>

<question id="71" answertype="resource" aggregation="false" onlydbo="false">
<string lang="en"><![CDATA[
Give me all video games published by Mean Hamster Software.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Videospiele von Mean Hamster Software.
]]></string>
<string lang="es"><![CDATA[
Dame todos los videojuegos de Mean Hamster Software.
]]></string>
<string lang="it"><![CDATA[
Dammi tutti i videogiochi di Mean Hamster Software.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les jeux vidéos publiés par Mean Hamster Software.
]]></string>
<string lang="nl"><![CDATA[
Geef me alle videogames van Mean Hamster Software.
]]></string>
<keywords lang="en"><![CDATA[ 
video game, publish, Mean Hamster Software
]]></keywords>
<keywords lang="de"><![CDATA[ 
Videospiel, Mean Hamster Software
]]></keywords>
<keywords lang="es"><![CDATA[ 
videojuego, Mean Hamster Software
]]></keywords>
<keywords lang="it"><![CDATA[ 
videogioco, prodotto, Mean Hamster Software
]]></keywords>
<keywords lang="fr"><![CDATA[ 
jeux vidéos, publiés, Mean Hamster Software
]]></keywords>
<keywords lang="nl"><![CDATA[ 
videogame, Mean Hamster Software
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res:  <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
      ?uri rdf:type dbo:VideoGame .
      { ?uri dbp:publisher 'Mean Hamster Software'@en . }
      UNION 
      { ?uri dbo:publisher res:Mean_Hamster_Software . }
}
]]></query>
</question>

<question id="75" answertype="resource" aggregation="false" onlydbo="true">
<string lang="en"><![CDATA[
Who has been the 5th president of the United States of America?
]]></string>
<string lang="de"><![CDATA[
Wer war der 5. Präsident der Vereinigten Staaten von Amerika?
]]></string>
<string lang="es"><![CDATA[
¿Quién fue el quinto presidente de los estados unidos de américa?
]]></string>
<string lang="it"><![CDATA[
Chi è stato il quinto presidente degli Stati Uniti d'America?
]]></string>
<string lang="fr"><![CDATA[
Qui fut le 5e président des Etats-Unis?
]]></string>
<string lang="nl"><![CDATA[
Wie was de vijfde president van de Verenigde Staten?
]]></string>
<keywords lang="en"><![CDATA[ 
United States of America, president, 5th
]]></keywords>
<keywords lang="de"><![CDATA[ 
Vereinigte Staaten von Amerika, Präsident, 5.
]]></keywords>
<keywords lang="es"><![CDATA[ 
estados unidos de américa, presidente, quinto
]]></keywords>
<keywords lang="it"><![CDATA[ 
Stati Uniti d'America, presidente, quinto
]]></keywords>
<keywords lang="fr"><![CDATA[ 
5e président, Etats-Unis
]]></keywords>
<keywords lang="nl"><![CDATA[ 
president, Verenigde Staten, vijfde
]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
	?uri dbo:orderInOffice '5th President of the United States'@en .
}
]]></query>
</question>

<question id="86" answertype="resource" aggregation="false" onlydbo="false">
<string lang="en"><![CDATA[
Give me all female German chancellors.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle deutschen Kanzlerinnen.
]]></string>
<string lang="es"><![CDATA[
Dame todas las cancilleres alemanas.
]]></string>
<string lang="it"><![CDATA[
Dammi tutte le cancelliere tedesche.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les chancelières allemandes.
]]></string>
<string lang="nl"><![CDATA[
Geef me alle vrouwelijke Duitse bondskanseliers.
]]></string>
<keywords lang="en"><![CDATA[ 
German chancellor, female
]]></keywords>
<keywords lang="de"><![CDATA[ 
deutsch, Kanzlerin
]]></keywords>
<keywords lang="es"><![CDATA[ 
canciller alemásn, mujer
]]></keywords>
<keywords lang="it"><![CDATA[ 
cancelliere tedesco, donna
]]></keywords>
<keywords lang="fr"><![CDATA[ 
chancelières, allemandes
]]></keywords>
<keywords lang="nl"><![CDATA[ 
vrouwelijk, Duits, bondskanselier
]]></keywords>
<query><![CDATA[
PREFIX yago: <http://dbpedia.org/class/yago/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type yago:FemaleHeadsOfGovernment.
        ?uri dbp:office res:Chancellor_of_Germany .
}
]]></query>
</question>

