<?xml version="1.0" ?>

<dataset id="esdbpedia-train">


<question aggregation="false" answertype="number" id="12" onlyesdbp="true">
<string lang="en"><![CDATA[How many employees does IBM have?]]></string>

<string lang="es"><![CDATA[¿Cuántos empleados tiene IBM?]]></string>

<query><![CDATA[
PREFIX esres: <http://es.dbpedia.org/resource/> 
PREFIX esdbp: <http://es.dbpedia.org/property/> 
SELECT DISTINCT ?empleados 
WHERE { 
   esres:IBM esdbp:empleados ?empleados .
}
]]></query>

<answers>

<answer>

<number>426751</number>

</answer>

</answers>

</question>


<question aggregation="false" answertype="resource" id="33" onlyesdbp="true">
<string lang="en"><![CDATA[Who created Wikipedia?]]></string>

<string lang="es"><![CDATA[¿Quién creó Wikipedia?]]></string>

<query><![CDATA[
PREFIX esdbp: <http://es.dbpedia.org/property/> 
PREFIX esres: <http://es.dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE {
  esres:Wikipedia esdbp:creador ?uri . 
}
]]></query>

<answers>

<answer>

<uri>http://es.dbpedia.org/resource/Larry_Sanger</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Jimmy_Wales</uri>

</answer>

</answers>

</question>


<question aggregation="false" answertype="boolean" id="35" onlyesdbp="true">
<string lang="en"><![CDATA[Is Christian Bale starring in Batman Begins?]]></string>

<string lang="es"><![CDATA[¿Actúa Christian Bale en Batman Begins?]]></string>

<query><![CDATA[
PREFIX esdbp: <http://es.dbpedia.org/property/> 
PREFIX esres: <http://es.dbpedia.org/resource/> 
ASK 
WHERE {
  esres:Batman_Begins esdbp:reparto esres:Christian_Bale . 
} 
]]></query>

<answers>

<answer>

<boolean>True</boolean>

</answer>

</answers>

</question>


<question aggregation="false" answertype="string" id="42" onlyesdbp="true">
<string lang="en"><![CDATA[In which programming language is GIMP written?]]></string>

<string lang="es"><![CDATA[¿En qué lenguaje de programación esta escrito GIMP?]]></string>

<query><![CDATA[
PREFIX esdbp: <http://es.dbpedia.org/property/>
PREFIX esres: <http://es.dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
	esres:GIMP esdbp:lenguajeProgramación ?uri .
}
]]></query>

<answers>

<answer>

<string><![CDATA[C y GTK+]]></string>

</answer>

</answers>

</question>


<question aggregation="false" answertype="resource" id="14" onlyesdbp="true">
<string lang="en"><![CDATA[Which characters were created by Walt Disney?]]></string>

<string lang="es"><![CDATA[¿Qué personajes ideó Walt Disney?]]></string>

<query><![CDATA[
PREFIX esdbp: <http://es.dbpedia.org/property/> 
PREFIX esres: <http://es.dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE {
  ?uri esdbp:creador esres:Walt_Disney . 
}
]]></query>

<answers>

<answer>

<uri>http://es.dbpedia.org/resource/Mickey_Mouse</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/José_Carioca</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Minnie_Mouse</uri>

</answer>

</answers>

</question>


<question aggregation="false" answertype="resource" id="4" onlyesdbp="true">
<string lang="en"><![CDATA[In which city did Eva Perón die?]]></string>

<string lang="es"><![CDATA[¿En qué ciudad murió Eva Perón?]]></string>

<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX esdbp: <http://es.dbpedia.org/property/> 
PREFIX esres: <http://es.dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
  esres:Eva_Perón esdbp:lugarmuerte ?uri .
  ?uri rdf:type dbo:PopulatedPlace .
}
]]></query>

<answers>

<answer>

<uri>http://es.dbpedia.org/resource/Buenos_Aires</uri>

</answer>

</answers>

</question>


<question aggregation="false" answertype="resource" id="9" onlyesdbp="true">
<string lang="en"><![CDATA[Who created Goofy?]]></string>

<string lang="es"><![CDATA[¿Quién es el creador de Goofy?]]></string>

<query><![CDATA[
PREFIX esdbp: <http://es.dbpedia.org/property/> 
PREFIX esres: <http://es.dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
  esres:Goofy esdbp:creador ?uri . 
}
]]></query>

<answers>

<answer>

<uri>http://es.dbpedia.org/resource/Art_Babbitt</uri>

</answer>

</answers>

</question>


<question aggregation="false" answertype="string" id="23" onlyesdbp="true">
<string lang="en"><![CDATA[When was the Battle of Gettysburg?]]></string>

<string lang="es"><![CDATA[¿Cuándo tuvo lugar la batalla de Gettysburg?]]></string>

<query><![CDATA[
PREFIX esdbp: <http://es.dbpedia.org/property/> 
PREFIX esres: <http://es.dbpedia.org/resource/> 
SELECT DISTINCT ?fecha 
WHERE { 
   esres:Batalla_de_Gettysburg esdbp:fecha ?fecha . 
}
]]></query>

<answers>

<answer>

<string><![CDATA[Del 1 al 3 de julio de 1863]]></string>

</answer>

</answers>

</question>


<question aggregation="true" answertype="resource" id="10" onlyesdbp="true">
<string lang="en"><![CDATA[Give me all cities in Germany with more than 500000 inhabitants.]]></string>

<string lang="es"><![CDATA[Dame todas las cuidades en Alemania que tengan más de 500000 habitantes.]]></string>

<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX esdbp: <http://es.dbpedia.org/property/> 
PREFIX esres: <http://es.dbpedia.org/resource/> 
SELECT DISTINCT ?uri WHERE { 
   ?uri esdbp:estado ?estado .
   ?estado dbo:country esres:Alemania .
   ?uri esdbp:población ?habitantes .
   FILTER (?habitantes > 500000) .
}
]]></query>

<answers>

<answer>

<uri>http://es.dbpedia.org/resource/Núremberg</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Hannover</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Dresde</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Leipzig</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Bremen</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Stuttgart</uri>

</answer>

</answers>

</question>


<question aggregation="false" answertype="resource" id="13" onlyesdbp="true">
<string lang="en"><![CDATA[In which province is the Lake of Banyoles?]]></string>

<string lang="es"><![CDATA[¿En qué provincia se encuentra el Lago de Bañolas?]]></string>

<query><![CDATA[
PREFIX esres: <http://es.dbpedia.org/resource/>
PREFIX esdbp: <http://es.dbpedia.org/property/>
SELECT DISTINCT ?uri
WHERE {
	esres:Lago_de_Bañolas esdbp:provincia ?uri .
}
]]></query>

<answers>

<answer>

<uri>http://es.dbpedia.org/resource/Provincia_de_Gerona</uri>

</answer>

</answers>

</question>


<question aggregation="false" answertype="resource" id="46" onlyesdbp="true">
<string lang="en"><![CDATA[Who wrote the book The pillars of the Earth?]]></string>

<string lang="es"><![CDATA[¿Quién escribió el libro Los pilares de la tierra?]]></string>

<query><![CDATA[
PREFIX esres: <http://es.dbpedia.org/resource/> 
PREFIX esdbp: <http://es.dbpedia.org/property/>
SELECT DISTINCT ?uri 
WHERE {
	esres:Los_pilares_de_la_Tierra esdbp:autor ?uri .
}
]]></query>

<answers>

<answer>

<string><![CDATA[Ken Follett]]></string>

</answer>

</answers>

</question>


<question aggregation="false" answertype="resource" id="47" onlyesdbp="true">
<string lang="en"><![CDATA[Give me all soccer clubs in the Premier League.]]></string>

<string lang="es"><![CDATA[Dame todos los equipos de futbol de la Premier League.]]></string>

<query><![CDATA[
PREFIX esres: <http://es.dbpedia.org/resource/>
PREFIX esdbp: <http://es.dbpedia.org/property/>
SELECT DISTINCT ?uri
WHERE { 
   ?uri esdbp:liga esres:Premier_League . 
}
]]></query>

<answers>

<answer>

<uri>http://es.dbpedia.org/resource/Arsenal_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Manchester_United_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Blackburn_Rovers_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Liverpool_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Aston_Villa_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Bolton_Wanderers_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Chelsea_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Fulham_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Manchester_City_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Newcastle_United_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Tottenham_Hotspur_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/West_Bromwich_Albion_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Wigan_Athletic_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Norwich_City_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Wolverhampton_Wanderers_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Queens_Park_Rangers_Football_Club</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Swansea_City_Association_Football_Club</uri>

</answer>

</answers>

</question>


<question aggregation="true" answertype="boolean" id="25" onlyesdbp="true">
<string lang="en"><![CDATA[Is Miguel González Avelar still alive?]]></string>

<string lang="es"><![CDATA[¿Todavía vive Miguel González Avelar?]]></string>

<query><![CDATA[
PREFIX esdbp: <http://es.dbpedia.org/property/>
PREFIX esres: <http://es.dbpedia.org/resource/>
ASK 
WHERE {
	OPTIONAL { esres:Miguel_González_Avelar esdbp:fechamuerte ?fecha . }
        FILTER (!BOUND(?fecha))
}
]]></query>

<answers>

<answer>

<boolean>False</boolean>

</answer>

</answers>

</question>


<question aggregation="false" answertype="resource" id="43" onlyesdbp="true">
<string lang="en"><![CDATA[Who produced films starring Buster Keaton?]]></string>

<string lang="es"><![CDATA[¿Quién produjo las películas en las que actua Buster Keaton?]]></string>

<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX esres: <http://es.dbpedia.org/resource/>
PREFIX esdbp: <http://es.dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
	?pelicula rdf:type dbo:Film .
        ?pelicula esdbp:reparto esres:Buster_Keaton .
        ?pelicula esdbp:producción ?uri .
}
]]></query>

<answers>

<answer>

<uri>http://es.dbpedia.org/resource/Charles_Brackett</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Charles_Chaplin</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Joseph_Schenck</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Buster_Keaton</uri>

</answer>

<answer>

<uri>http://es.dbpedia.org/resource/Joseph_M._Schenck</uri>

</answer>

</answers>

</question>

</dataset>
