<?xml version="1.0" ?>
<dataset id="musicbrainz-train">
<question aggregation="false" answertype="resource" id="65">
<string lang="en"><![CDATA[Give me all soundtracks composed by John Williams.]]></string>
<string lang="de"><![CDATA[Gib mir alle Soundtracks, die von John Williams komponiert wurden.]]></string>
<string lang="es"><![CDATA[Dame todas las bandas sonoras compuestas por John Williams]]></string>
<string lang="it"><![CDATA[Dammi tutte le colonne sonore composte da John Williams.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les bandes sons composées par John Williams.]]></string>
<string lang="nl"><![CDATA[Geef me alle soundtracks die werden gecomponeerd door John Williams.]]></string>
<keywords lang="en"><![CDATA[soundtrack, composer, John Williams]]></keywords>
<keywords lang="de"><![CDATA[Soundtrack, Komponist, John Williams]]></keywords>
<keywords lang="es"><![CDATA[bandas sonoras, compositor, John Williams]]></keywords>
<keywords lang="it"><![CDATA[colonne sonore, compositore, John Williams]]></keywords>
<keywords lang="fr"><![CDATA[bandes sons, composées, John Williams]]></keywords>
<keywords lang="nl"><![CDATA[soundtrack, componist, John Williams]]></keywords>
<query><![CDATA[PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?album
WHERE {
  ?album mo:release_type mo:soundtrack .
  ?album mo:composer ?artist .
  ?artist foaf:name 'John Williams' .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/0e9346b3-6d74-4126-acb4-67a0f68c1085</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/60eadc40-e7b4-4872-bbd8-f1b5203992b3</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/a6a132cc-5081-4026-bc9c-0f8f7046776c</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/4de98485-0a3b-4b7e-aa70-f1a3552aebeb</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/36c0182f-0345-457f-88d8-13cdf2ca9f69</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/cd4eb636-7124-4dda-9f52-1e26bb922ea9</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/64c91884-ab75-48e4-8e24-9cb88740cabc</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/a5c3ed2d-0a80-434b-b693-96645c30baea</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/69221d1c-0b23-440b-8e95-88fe6c4048fb</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/8942561e-4563-4f6d-946d-d948f9733700</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/fad46666-6756-4c4a-9d9e-1e8f4b550ff0</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="95">
<string lang="en"><![CDATA[How many jazz compilations are there?]]></string>
<string lang="de"><![CDATA[Wieviele Jazz-Kompilationen gibt es?]]></string>
<string lang="es"><![CDATA[Cuantas compilaciones de Jazz existen]]></string>
<string lang="it"><![CDATA[Quante raccolte jazz esistono?]]></string>
<string lang="fr"><![CDATA[Combien de compilations jazz existe-t-il?]]></string>
<string lang="nl"><![CDATA[Hoeveel compilaties met jazz-muziek zijn er?]]></string>
<keywords lang="en"><![CDATA[number of jazz compilations]]></keywords>
<keywords lang="de"><![CDATA[Anzahl Jazz-Kompilation]]></keywords>
<keywords lang="es"><![CDATA[numero de compilaciones jazz]]></keywords>
<keywords lang="it"><![CDATA[numero di raccolte jazz]]></keywords>
<keywords lang="fr"><![CDATA[nombre de compilations jazz]]></keywords>
<keywords lang="nl"><![CDATA[aantal compilaties, jazz-muziek]]></keywords>
<query><![CDATA[PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?album)
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:compilation .
  ?album dc:description 'jazz' .
}]]></query>
<answers>
<answer>
<number>716</number>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="34">
<string lang="en"><![CDATA[Is Liz Story a person or a group?]]></string>
<string lang="de"><![CDATA[Ist Liz Story eine Person oder eine Band?]]></string>
<string lang="es"><![CDATA[Es Liz Story una persona o un grupo]]></string>
<string lang="it"><![CDATA[Liz Story è una persona o un gruppo musicale?]]></string>
<string lang="fr"><![CDATA[Liz Story est-elle une personne ou un groupe?]]></string>
<string lang="nl"><![CDATA[Is Liz Story een persoon of een band?]]></string>
<keywords lang="en"><![CDATA[Liz Story, person or group]]></keywords>
<keywords lang="de"><![CDATA[Liz Story, Person oder Band]]></keywords>
<keywords lang="es"><![CDATA[Liz Story, persona, grupo]]></keywords>
<keywords lang="it"><![CDATA[Liz Story, persona o gruppo]]></keywords>
<keywords lang="fr"><![CDATA[Liz Story, personne, group]]></keywords>
<keywords lang="nl"><![CDATA[Liz Story, persoon of band]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artisttype
WHERE {
    ?artist foaf:name 'Liz Story'.
    ?artist rdf:type ?artisttype .
    FILTER (?artisttype != mo:MusicArtist)
}]]></query>
<answers>
<answer>
<uri>http://purl.org/ontology/mo/SoloMusicArtist</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="69">
<string lang="en"><![CDATA[Give me all Celldweller EPs.]]></string>
<string lang="de"><![CDATA[Gib mir alle Celldweller-EPs.]]></string>
<string lang="es"><![CDATA[Dame todos los EP de Celldweller]]></string>
<string lang="it"><![CDATA[Dammi tutti gli EP dei Celldweller.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les EP de Celldweller.]]></string>
<string lang="nl"><![CDATA[]]></string>
<keywords lang="en"><![CDATA[Celldweller, EP]]></keywords>
<keywords lang="de"><![CDATA[Celldweller, EP]]></keywords>
<keywords lang="es"><![CDATA[EP de Celldweller]]></keywords>
<keywords lang="it"><![CDATA[Celldweller, EP]]></keywords>
<keywords lang="fr"><![CDATA[EP, Celldweller]]></keywords>
<keywords lang="nl"><![CDATA[Celldweller, ep]]></keywords>
<query><![CDATA[PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?album
WHERE {
  ?album mo:release_type mo:ep .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Celldweller' .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/56630772-5bf2-4576-8370-d8b037e56324</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/3bc40518-4091-4605-a386-acbb1d68cf53</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/c565882a-10e7-4cd3-bc1f-a294e58d787b</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="9">
<string lang="en"><![CDATA[How many bands are called Nirvana?]]></string>
<string lang="de"><![CDATA[Wieviele Band heißen Nirvana?]]></string>
<string lang="es"><![CDATA[Cuantas bandas se llaman Nirvana?]]></string>
<string lang="it"><![CDATA[Quanti gruppi musicali si chiamano Nirvana?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Hoeveel bands heten Nirvana?]]></string>
<keywords lang="en"><![CDATA[number of bands, name, Nirvana]]></keywords>
<keywords lang="de"><![CDATA[Anzahl Bands, Name, Nirvana]]></keywords>
<keywords lang="es"><![CDATA[numero de bandas, nombre, Nirvana]]></keywords>
<keywords lang="it"><![CDATA[numero di gruppi musicali, nome, Nirvana]]></keywords>
<keywords lang="fr"><![CDATA[Nirvana, nombre de groupes]]></keywords>
<keywords lang="nl"><![CDATA[aantal bands, Nirvana]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?artist)
WHERE {
  ?artist rdf:type mo:MusicGroup .
  ?artist foaf:name 'Nirvana' .
}]]></query>
<answers>
<answer>
<number>3</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="73">
<string lang="en"><![CDATA[Give me the spouses of all members of The Beatles.]]></string>
<string lang="de"><![CDATA[Gib mir die Ehepartner aller Mitglieder der Beatles.]]></string>
<string lang="es"><![CDATA[Dame las esposas de todos los miembros de los Beatles]]></string>
<string lang="it"><![CDATA[Dammi le mogli di tutti i membri dei Beatles.]]></string>
<string lang="fr"><![CDATA[Donnes-moi les épouses de tous les membres des Beatles.]]></string>
<string lang="nl"><![CDATA[Noem de echtgenotes van alle leden van The Beatles.]]></string>
<keywords lang="en"><![CDATA[member, The Beatles, spouse]]></keywords>
<keywords lang="de"><![CDATA[Mitglieder, The Beatles, Ehepartner]]></keywords>
<keywords lang="es"><![CDATA[esposas, miembros, Beatles]]></keywords>
<keywords lang="it"><![CDATA[membro, The Beatles, moglie]]></keywords>
<keywords lang="fr"><![CDATA[épouses, membres, Beatles]]></keywords>
<keywords lang="nl"><![CDATA[echtgenote, lid, The Beatles]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?spouse 
WHERE {
  ?band foaf:name 'The Beatles' .
  ?artist mo:member_of ?band .
  ?artist rel:spouseOf ?spouse .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/b0b33754-a664-43b7-ba00-be0dc4ec2396</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/10b860bf-f225-4ee0-8c28-e32f1759b4a2</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/d53fc0b4-351c-49ed-b532-297082d40a36</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/80a4ee1b-e3e0-46c4-be17-af62c8755af7</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/96a008c8-63e0-48ee-92dd-d25beed4f0e5</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="12">
<string lang="en"><![CDATA[When is the birthday of Tom Waits?]]></string>
<string lang="de"><![CDATA[Wann hat Tom Waits Geburtstag?]]></string>
<string lang="es"><![CDATA[Cuando es el cumpleaños de Tom Waits?]]></string>
<string lang="it"><![CDATA[Quand è il compleanno di Tom Waits?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Wat is de verjaardag van Tom Waits?]]></string>
<keywords lang="en"><![CDATA[Tom Waits, birthday]]></keywords>
<keywords lang="de"><![CDATA[Tom Waits, Geburtstag]]></keywords>
<keywords lang="es"><![CDATA[cumpleaños, Tom Waits]]></keywords>
<keywords lang="it"><![CDATA[Tom Waits, compleanno]]></keywords>
<keywords lang="fr"><![CDATA[anniversaire, Tom Waits]]></keywords>
<keywords lang="nl"><![CDATA[Tom Waits, verjaardag]]></keywords>
<query><![CDATA[PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Tom Waits'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}]]></query>
<answers>
<answer>
<date>1949-12-07</date>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="64">
<string lang="en"><![CDATA[How many audiobooks by Tolkien are there?]]></string>
<string lang="de"><![CDATA[Wieviele Hörbücher von Tolkien gibt es?]]></string>
<string lang="es"><![CDATA[Cuantos audiolibros existen de Tolkien]]></string>
<string lang="it"><![CDATA[Quanti audiolibri di Tolkien esistono?]]></string>
<string lang="fr"><![CDATA[Combien de livres audios de Tolkien existe-t-il?]]></string>
<string lang="nl"><![CDATA[Hoeveel luisterboeken van Tolkien zijn er?]]></string>
<keywords lang="en"><![CDATA[number of audiobooks, Tolkien]]></keywords>
<keywords lang="de"><![CDATA[Anzahl Hörbücher, Tolkien]]></keywords>
<keywords lang="es"><![CDATA[audiolibros, Tolkien]]></keywords>
<keywords lang="it"><![CDATA[numero di audiolibri, Tolkien]]></keywords>
<keywords lang="fr"><![CDATA[nombre de livres audios, Tolkien]]></keywords>
<keywords lang="nl"><![CDATA[aantal luisterboeken, Tolkien]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT COUNT(DISTINCT ?album)
WHERE {
  ?album mo:release_type mo:audiobook .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'J.R.R. Tolkien' .
}]]></query>
<answers>
<answer>
<number>256</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="28">
<string lang="en"><![CDATA[Since when is Tom Araya a member of Slayer?]]></string>
<string lang="de"><![CDATA[Seit wann ist Tom Araya bei Slayer?]]></string>
<string lang="es"><![CDATA[Desde cuando es Tom Araya un miembro de Slayer?]]></string>
<string lang="it"><![CDATA[Da quando Tom Araya è uno dei membri degli Slayer?]]></string>
<string lang="fr"><![CDATA[Depuis quand Tom Araya est-il un membre de Slayer?]]></string>
<string lang="nl"><![CDATA[Sinds wanneer is Tom Araya lid van Slayer?]]></string>
<keywords lang="en"><![CDATA[Tom Araya, member, Slayer, begin date]]></keywords>
<keywords lang="de"><![CDATA[Tom Araya, Mitglied, Slayer, Startdatum]]></keywords>
<keywords lang="es"><![CDATA[Tom Araya, fecha de inicio, Slayer]]></keywords>
<keywords lang="it"><![CDATA[Tom Araya, membro, Slayer, data inizio]]></keywords>
<keywords lang="fr"><![CDATA[Tom Araya, membre, Slayer, date]]></keywords>
<keywords lang="nl"><![CDATA[Tom Araya, lid, Slayer, toetredingsdatum]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX event: <http://purl.org/NET/c4dm/event.owl#>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?beginDate
WHERE {
  ?artist foaf:name 'Tom Araya' .
  ?band foaf:name 'Slayer' .
  ?event rdf:type mo:membership .
  ?event event:agent ?artist .
  ?event mo:group ?band .
  ?event event:time ?eventtime .
  ?eventtime tl:start ?beginDate .
}]]></query>
<answers>
<answer>
<date>1981-01-01</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="81">
<string lang="en"><![CDATA[Is there a group called Michael Jackson?]]></string>
<string lang="de"><![CDATA[Gibt es eine Band, die Michael Jackson heißt?]]></string>
<string lang="es"><![CDATA[Existe un grupo llamado Michael Jackson?]]></string>
<string lang="it"><![CDATA[Esiste un gruppo che si chiama Michael Jackson?]]></string>
<string lang="fr"><![CDATA[Existe-t-il un groupe appelé Michael Jackson?]]></string>
<string lang="nl"><![CDATA[Bestaat er een band met de naam Michael Jackson?]]></string>
<keywords lang="en"><![CDATA[group, name, Michael Jackson]]></keywords>
<keywords lang="de"><![CDATA[Band, Name, Michael Jackson]]></keywords>
<keywords lang="es"><![CDATA[grupo, llamado, Michael Jackson]]></keywords>
<keywords lang="it"><![CDATA[gruppo, nome, Michael Jackson]]></keywords>
<keywords lang="fr"><![CDATA[groupe, appelé, Michael Jackson]]></keywords>
<keywords lang="nl"><![CDATA[band, naam, Michael Jackson]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK
WHERE {
  ?artist rdf:type mo:MusicGroup .
  ?artist foaf:name 'Michael Jackson' .
}]]></query>
<answers>
<answer>
<boolean>false</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="67">
<string lang="en"><![CDATA[When was Ludwig van Beethoven born?]]></string>
<string lang="de"><![CDATA[Wann wurde Ludwig van Beethoven geboren?]]></string>
<string lang="es"><![CDATA[Donde nació Ludwig van Beethoven?]]></string>
<string lang="it"><![CDATA[Quando nacque Ludwig van Beethoven?]]></string>
<string lang="fr"><![CDATA[Quand est né Ludwig van Beethoven?]]></string>
<string lang="nl"><![CDATA[Wanneer werd Ludwig von Beethoven geboren?]]></string>
<keywords lang="en"><![CDATA[Ludwig van Beethoven, birth date]]></keywords>
<keywords lang="de"><![CDATA[Ludwig van Beethoven, Geburtstag]]></keywords>
<keywords lang="es"><![CDATA[lugar de nacimiento, Ludwig van Beethoven.]]></keywords>
<keywords lang="it"><![CDATA[Ludwig van Beethoven, data di nascita]]></keywords>
<keywords lang="fr"><![CDATA[date de naissance, Ludwig van Beethoven]]></keywords>
<keywords lang="nl"><![CDATA[geboortedatum, Ludwig van Beethoven]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Ludwig van Beethoven'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}]]></query>
<answers>
<answer>
<date>1770-12-17</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="18">
<string lang="en"><![CDATA[Give me all live albums by Michael Jackson.]]></string>
<string lang="de"><![CDATA[Gib mir alle Live-Alben von Michael Jackson.]]></string>
<string lang="es"><![CDATA[Dame todos los  álbumes en directo de Michael Jackson.]]></string>
<string lang="it"><![CDATA[Dammi tutti gli album live di Michael Jackson.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les albums live de Michael Jackson.]]></string>
<string lang="nl"><![CDATA[Noem alle live-albums van Michael Jackson.]]></string>
<keywords lang="en"><![CDATA[Michael Jackson, live album]]></keywords>
<keywords lang="de"><![CDATA[Michael Jackson, Live-Album]]></keywords>
<keywords lang="es"><![CDATA[álbumes en directo, Michael Jackson]]></keywords>
<keywords lang="it"><![CDATA[Michael Jackson, album live]]></keywords>
<keywords lang="fr"><![CDATA[albums live, Michael Jackson]]></keywords>
<keywords lang="nl"><![CDATA[live-album, Michael Jackson]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album
WHERE {
  ?album rdf:type mo:Record . 
  ?album mo:release_type mo:live .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Michael Jackson' .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/90092a8c-899d-47af-aebc-a7806dd2bd67</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/3691c708-504e-4035-b987-f78c89c3294d</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/c995c23e-83f4-4364-a13d-7ab17e6ab6f1</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/5c7cd653-5cab-43cf-9969-a823c619048a</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/90663c57-b44d-4558-ba3d-b37673d54822</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/2d332333-5ccb-4560-a47d-3e605d2728d8</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/36b9f2f1-1ba8-4e36-a97e-739ae02a6c56</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/011dd451-1910-4ab5-b83f-63f65f6c9dcc</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="35">
<string lang="en"><![CDATA[Who was Frank Sinatra married to?]]></string>
<string lang="de"><![CDATA[Mit wem war Frank Sinatra verheiratet?]]></string>
<string lang="es"><![CDATA[Con quien se caso Frank Sinatra?]]></string>
<string lang="it"><![CDATA[Con chi era sposato Frank Sinatra?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Met wie was Frank Sinatra getrouwd?]]></string>
<keywords lang="en"><![CDATA[Frank Sinatra, spouse]]></keywords>
<keywords lang="de"><![CDATA[Frank Sinatra, Ehepartner]]></keywords>
<keywords lang="es"><![CDATA[esposa, Frank Sinatra]]></keywords>
<keywords lang="it"><![CDATA[Frank Sinatra, moglie]]></keywords>
<keywords lang="fr"><![CDATA[épouse, Frank Sinatra]]></keywords>
<keywords lang="nl"><![CDATA[Frank Sinatra, echtgenote]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?spouse
WHERE {
  ?spouse rel:spouseOf ?artist .
  ?artist foaf:name 'Frank Sinatra' .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/04bac187-160c-4b72-9ba1-cd6fd07ca6be</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="86">
<string lang="en"><![CDATA[How many live albums did The Rolling Stones release?]]></string>
<string lang="de"><![CDATA[Wieviele Live-Alben haben die Rolling Stones herausgebracht?]]></string>
<string lang="es"><![CDATA[Cuantos álbumes en directo tienen los Rolling Stones?]]></string>
<string lang="it"><![CDATA[Quanti album live hanno rilasciato i Rolling Stones?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Hoeveel live-albums hebben The Rolling Stones uitgebracht?]]></string>
<keywords lang="en"><![CDATA[number of live albums, The Rolling Stones]]></keywords>
<keywords lang="de"><![CDATA[Anzahl Live-Alben, The Rolling Stones]]></keywords>
<keywords lang="es"><![CDATA[álbumes en directo, Rolling Stones]]></keywords>
<keywords lang="it"><![CDATA[numero di album live, The Rolling Stones]]></keywords>
<keywords lang="fr"><![CDATA[]]></keywords>
<keywords lang="nl"><![CDATA[aantal live-albums, The Rolling Stones]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?album)
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:live .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'The Rolling Stones' .
}]]></query>
<answers>
<answer>
<number>107</number>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="78">
<string lang="en"><![CDATA[How many EPs did Muse release?]]></string>
<string lang="de"><![CDATA[Wieviele EPs hat Muse herausgebracht?]]></string>
<string lang="es"><![CDATA[Cuantos EPs ha estrenado Muse?]]></string>
<string lang="it"><![CDATA[Quanti EP hanno rilasciato i Muse?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Hoeveel EPs heeft Muse uitgebracht?]]></string>
<keywords lang="en"><![CDATA[Muse, number of EPs]]></keywords>
<keywords lang="de"><![CDATA[Muse, Anzahl EPs]]></keywords>
<keywords lang="es"><![CDATA[Muse, numero de EPs]]></keywords>
<keywords lang="it"><![CDATA[Muse, numero di EP]]></keywords>
<keywords lang="fr"><![CDATA[]]></keywords>
<keywords lang="nl"><![CDATA[aantal EPs, Muse]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT COUNT(DISTINCT ?album)
WHERE {
  ?album mo:release_type mo:ep .
  ?artist foaf:name 'Muse' .
  ?album foaf:maker ?artist .
}]]></query>
<answers>
<answer>
<number>13</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="1">
<string lang="en"><![CDATA[Which singles did Slayer release?]]></string>
<string lang="de"><![CDATA[Welche Singles hat Slayer herausgebracht?]]></string>
<string lang="es"><![CDATA[Que Singles fueron estrenados por Slayer?]]></string>
<string lang="it"><![CDATA[Quali singoli ha rilasciato Slayer?]]></string>
<string lang="fr"><![CDATA[Quels singles ont été sortis par Slayer?]]></string>
<string lang="nl"><![CDATA[Welke singles bracht Slayer uit?]]></string>
<keywords lang="en"><![CDATA[Slayer, single]]></keywords>
<keywords lang="de"><![CDATA[Slayer, Single]]></keywords>
<keywords lang="es"><![CDATA[Singles, Slayer]]></keywords>
<keywords lang="it"><![CDATA[Slayer, singolo]]></keywords>
<keywords lang="fr"><![CDATA[Slayer, singles]]></keywords>
<keywords lang="nl"><![CDATA[single, Slayer]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?album
WHERE {
    ?album foaf:maker ?artist .
    ?artist foaf:name 'Slayer'.
    ?album mo:release_type mo:single .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/6e978721-86a5-41dc-acfe-dd8b472322c8</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/f196101b-48b9-4e9b-a447-757185d6e5c0</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/1b1c3d04-ff0e-40e0-b755-5cd42f24c687</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/7adddf64-0b9a-47ba-b45f-081b871e61ba</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/561ce388-7848-424d-9cb5-61ac7bb286c5</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/e2320c78-0840-481f-80fd-1a9da7019ba7</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/3185baf5-78f9-4a59-b463-114ff88307bb</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/8fe8c7fe-80c4-4f3a-a360-ea231cd10e9e</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/d272dbc2-ff1f-47da-823a-87719d31bb6b</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/6cd45627-74ac-44ea-87eb-e223e490940a</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="5">
<string lang="en"><![CDATA[Who composed the Star Wars soundtrack?]]></string>
<string lang="de"><![CDATA[Wer hat den Soundtrack zu Star Wars komponiert?]]></string>
<string lang="es"><![CDATA[Quien compuso la banda sonora de Star Wars?]]></string>
<string lang="it"><![CDATA[Chi ha composto la colonna sonora di Guerre Stellari?]]></string>
<string lang="fr"><![CDATA[Qui a composé la bande son de la Guerre des étoiles?]]></string>
<string lang="nl"><![CDATA[Wie was de componist van de soundtrack van Star Wars?]]></string>
<keywords lang="en"><![CDATA[Star Wars, soundtrack, composer]]></keywords>
<keywords lang="de"><![CDATA[Star Wars, Soundtrack, Komponist]]></keywords>
<keywords lang="es"><![CDATA[compositor, banda sonora, Star Wars]]></keywords>
<keywords lang="it"><![CDATA[Guerre Stellari, colonna sonora, compositore]]></keywords>
<keywords lang="fr"><![CDATA[bande son, composé, Guerre des étoiles]]></keywords>
<keywords lang="nl"><![CDATA[componist, Star Wars, soundtrack]]></keywords>
<query><![CDATA[PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?composer
WHERE {
    ?album mo:release_type mo:soundtrack .
    ?album dc:title ?title .
    ?album mo:composer ?composer . 
FILTER regex(str(?title),Star Wars)
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/53b106e7-0cc6-42cc-ac95-ed8d30a3a98e</uri>
</answer>
</answers>
</question>
