<?xml version="1.0" ?>
<dataset id="musicbrainz-train">
<question aggregation="false" answertype="resource" id="57">
<string lang="en"><![CDATA[What is the third song on the album In the Wee Small Hours?]]></string>
<string lang="de"><![CDATA[Was ist das dritte Lied auf dem Album In the Wee Small Hours?]]></string>
<string lang="es"><![CDATA[Cual es la tercera canción del álbum In the Wee Small Hours?]]></string>
<string lang="it"><![CDATA[]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Wat is het derde nummer op het album In the Wee Small Hours?]]></string>
<keywords lang="en"><![CDATA[third song, album, In the Wee Small Hours]]></keywords>
<keywords lang="de"><![CDATA[drittes Lied, Album, In the Wee Small Hours]]></keywords>
<keywords lang="es"><![CDATA[tercera canción, álbum In the Wee Small Hours]]></keywords>
<keywords lang="it"><![CDATA[terza canzone, album, In the Wee Small Hours]]></keywords>
<keywords lang="fr"><![CDATA[troisième morceau, album, In the Wee Small Hours]]></keywords>
<keywords lang="nl"><![CDATA[In the Wee Small Hours, album, derde nummer]]></keywords>
<query><![CDATA[PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?track
WHERE {
  ?album dc:title 'In the Wee Small Hours' .
  ?album mo:track ?track .
  ?track mo:trackNum '1' .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/track/69ebc4ab-2eb3-4bbd-9c2f-4437d40d4868</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="10">
<string lang="en"><![CDATA[When did the Sex Pistols break up?]]></string>
<string lang="de"><![CDATA[Wann haben sich die Sex Pistols aufgelöst?]]></string>
<string lang="es"><![CDATA[Cuando rompieron los Sex Pistols?]]></string>
<string lang="it"><![CDATA[Quando si sono separati i Sex Pistols?]]></string>
<string lang="fr"><![CDATA[Quand ont été dissous les Sex Pistols?]]></string>
<string lang="nl"><![CDATA[Wanneer hielden de Sex Pistols op te bestaan?]]></string>
<keywords lang="en"><![CDATA[Sex Pistols, end date]]></keywords>
<keywords lang="de"><![CDATA[Sex Pistols, Enddatum]]></keywords>
<keywords lang="es"><![CDATA[Sex pistols, roptura]]></keywords>
<keywords lang="it"><![CDATA[Sex Pistols, separazione]]></keywords>
<keywords lang="fr"><![CDATA[dissous, Sex Pistols]]></keywords>
<keywords lang="nl"><![CDATA[Sex Pistols, einddatum]]></keywords>
<query><![CDATA[PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Sex Pistols'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Death .
  ?event bio:date ?date .
}]]></query>
<answers>
<answer>
<date>1978-01-14</date>
</answer>
</answers>
</question>
<question aggregation="true" answertype="boolean" id="25">
<string lang="en"><![CDATA[Are there members of the Ramones that are not called Ramone?]]></string>
<string lang="de"><![CDATA[Gibt es Mitglieder der Ramones, die nicht Ramone heißen?]]></string>
<string lang="es"><![CDATA[Hay algún miembro de los Ramones que no se llame Ramon?]]></string>
<string lang="it"><![CDATA[Ci sono membri dei Ramones che non si chiamano Ramone?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Zijn er bandleden van The Ramones die niet Ramone heten?]]></string>
<keywords lang="en"><![CDATA[Ramones, member, not, name, Ramone]]></keywords>
<keywords lang="de"><![CDATA[Ramones, Mitglied, nicht, Name, Ramone]]></keywords>
<keywords lang="es"><![CDATA[Ramones, miembros, no llamado Ramone]]></keywords>
<keywords lang="it"><![CDATA[Ramones, membro, nome diverso da, Ramone]]></keywords>
<keywords lang="fr"><![CDATA[]]></keywords>
<keywords lang="nl"><![CDATA[The Ramones, bandlid, niet, naam, Ramone]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
ASK 
WHERE {
	?band foaf:name 'Ramones' .
	?artist foaf:name ?artistname .
	?artist mo:member_of ?band .
        FILTER (NOT regex(?artistname,Ramone))
}]]></query>
<answers>
<answer>
<boolean>false</boolean>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="99">
<string lang="en"><![CDATA[Who was born on the same day as Frank Sinatra?]]></string>
<string lang="de"><![CDATA[Wer wurde am selben Tag wie Frank Sinatra geboren?]]></string>
<string lang="es"><![CDATA[Quien nació el mismo día que Frank Sinatra?]]></string>
<string lang="it"><![CDATA[Chi è nato lo stesso giorno di Frank Sinatra?]]></string>
<string lang="fr"><![CDATA[Qui est né le même jour que Frank Sinatra?]]></string>
<string lang="nl"><![CDATA[Wie werd op dezelfde dag geboren als Frank Sinatra?]]></string>
<keywords lang="en"><![CDATA[birth date, same as, Frank Sinatra, birth date]]></keywords>
<keywords lang="de"><![CDATA[Geburtstag, gleich, Frank Sinatra, Geburtstag]]></keywords>
<keywords lang="es"><![CDATA[fecha nacimiento, igual, Frank Sinatra]]></keywords>
<keywords lang="it"><![CDATA[data di nascita, uguale, Frank Sinatra, data di nascita]]></keywords>
<keywords lang="fr"><![CDATA[date de naissance, même que, Frank Sinatra]]></keywords>
<keywords lang="nl"><![CDATA[geboortedatum, identiek, Frank Sinatra]]></keywords>
<query><![CDATA[PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist
WHERE {
  ?sinatra foaf:name 'Frank Sinatra' .
  ?sinatra bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
  ?artist bio:event ?event_2 .
  ?event_2 rdf:type bio:Birth .
  ?event_2 bio:date ?date .
  FILTER (!sameTerm(?artist,?sinatra))
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/ec0e3197-e392-4039-97f0-9bebd4b2d4d4</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="16">
<string lang="en"><![CDATA[Give me all bands that Michael Stipe is a member of.]]></string>
<string lang="de"><![CDATA[Gib mir alle Bands, in denen Michael Stipe Mitglied ist.]]></string>
<string lang="es"><![CDATA[Dame todas las bandas en las cuales Michael Stipe es un miembro?]]></string>
<string lang="it"><![CDATA[Dammi tutti i gruppi musicali di cui Michael Stipe è membro.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les groupes dont Michael Stipe a été un membre.]]></string>
<string lang="nl"><![CDATA[Geef me alle bands waarin Michael Stipe zat.]]></string>
<keywords lang="en"><![CDATA[Michael Stipe, member, band]]></keywords>
<keywords lang="de"><![CDATA[Michael Stipe, Mitglied, Band]]></keywords>
<keywords lang="es"><![CDATA[bandas, Michael Stipe]]></keywords>
<keywords lang="it"><![CDATA[Michael Stipe, membro, gruppo musicale]]></keywords>
<keywords lang="fr"><![CDATA[groupes, Michael Stipe, membre]]></keywords>
<keywords lang="nl"><![CDATA[band, Michael Stipe, lid]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?band
WHERE { 
 ?artist foaf:name 'Michael Stipe' .
 ?artist mo:member_of ?band .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/907981c8-f6be-4d8d-9210-01a0c4843b59</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/ea4dfa26-f633-4da6-a52a-f49ea4897b58</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/44e9e832-3f85-4094-a332-7d0548224cb2</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="51">
<string lang="en"><![CDATA[Which soundtrack albums did Clannad record?]]></string>
<string lang="de"><![CDATA[Welche Soundtrack-Alben hat Clannad aufgenommen?]]></string>
<string lang="es"><![CDATA[Que álbumes de bandas sonoras ha grabado Clannad?]]></string>
<string lang="it"><![CDATA[Quali album di colonne sonore ha inciso Clannad?]]></string>
<string lang="fr"><![CDATA[Quels albums de bandes sons ont été enregistrés par Clannad?]]></string>
<string lang="nl"><![CDATA[Welke soundtrack-albums heeft Clannad opgenomen?]]></string>
<keywords lang="en"><![CDATA[sountrack, Clannad]]></keywords>
<keywords lang="de"><![CDATA[Soundtrack, Clannad]]></keywords>
<keywords lang="es"><![CDATA[álbumes banda sonora, Clannad]]></keywords>
<keywords lang="it"><![CDATA[colonna sonora, Clannad]]></keywords>
<keywords lang="fr"><![CDATA[albums de bandes sons, Clannad]]></keywords>
<keywords lang="nl"><![CDATA[soundtrack, album, Clannad]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?album
WHERE {
  ?album mo:release_type mo:soundtrack .
  ?artist foaf:name 'Clannad' .
  ?album foaf:maker ?artist .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/0b622596-c102-4021-8464-0521a9117e45</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/cb510bbc-8b1d-4d58-b54e-1aac95ffb70d</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/a8c597bd-434f-4067-b2cb-0824f4707f04</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/17b6081f-cc8e-4dbd-b8da-ff89b6957e1a</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="8">
<string lang="en"><![CDATA[Give me all Kraftwerk albums.]]></string>
<string lang="de"><![CDATA[Gib mir alle Kraftwerk-Alben.]]></string>
<string lang="es"><![CDATA[Dame todos los álbumes de Kraftwerk]]></string>
<string lang="it"><![CDATA[Dammi tutti gli album dei Kraftwerk.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les albums de Kraftwerk.]]></string>
<string lang="nl"><![CDATA[Geef alle albums van Kraftwerk.]]></string>
<keywords lang="en"><![CDATA[Kraftwerk, album]]></keywords>
<keywords lang="de"><![CDATA[Kraftwerk, Album]]></keywords>
<keywords lang="es"><![CDATA[álbumes, Kraftwerk]]></keywords>
<keywords lang="it"><![CDATA[Kraftwerk, album]]></keywords>
<keywords lang="fr"><![CDATA[albums, Kraftwerk]]></keywords>
<keywords lang="nl"><![CDATA[album, Kraftwerk]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:album .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Kraftwerk' .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/8cb01654-34b5-409c-9217-33e1782bd433</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/c60b47f1-fa8e-4571-9785-7212f9249287</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/995bf9d0-2994-44de-a211-c67294801ea0</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/b9dfda8b-620e-4bb7-b9c7-e893727de4ff</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/c68f7169-4414-4570-aeb9-11ed1df32187</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/6aaa509e-f4c7-4687-a611-9d5488a363c2</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/d3036b19-ae67-4ac4-872f-01547f674dbc</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/35d33139-e1b1-4ecf-bfaa-b46e0350beae</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/30a6aaf1-1186-4251-8a63-b41cdf5c3641</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/e4d727d2-e71a-47ee-8203-3ba14c1df659</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/57ceaa04-f3b1-445c-a7b3-154319f6a3ab</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/1e8b4073-29ca-42b7-9249-ee16ea96625f</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/4e56c217-9ad6-4a72-948a-f862ed48ce29</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/388829e1-c5b3-4611-bef4-5f12d096e01d</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/40be1219-13c3-4d0d-a7d7-1d593e2161d8</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/cd6c0c29-5db7-439f-bb76-9a93fa8ff78d</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/07fcd2b3-e8e8-471c-bc4c-03d2a5346221</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/aa7d78f0-6f79-44ac-ad97-cf6926a4a33c</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/eda8951e-d79c-4d7d-8a98-039af2a587ea</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/0ec7f213-457a-46db-bc8b-549b0b5e419e</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/dba7690f-3dd3-41ce-8cad-e40cddd35d66</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/d6a0b101-1763-429c-9043-7d4a1ff3a653</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/453a9328-4ae4-4559-9fbb-4c4d30008c03</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/8cc90cc5-3c36-4f09-9ee1-05f0b7ff1c46</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/7b32b5ab-ab40-4b57-9860-947fbfe42e28</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/8327a929-e283-4307-8219-50a9166ef335</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/8479dc49-82d3-440e-9ca6-444fcead5d74</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/f31bf32e-d1de-4784-8d46-f5c9e9d579f3</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/8c6c3f4b-6bdd-4920-a5a7-113727b191f3</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/394fa39c-231c-49de-845a-1e3d2a99266e</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/80203d4b-7b5d-449e-9dca-a62b959d937b</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/9c038eb1-6ec7-4732-8c66-54e4b085bd3d</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/31089f3c-5c1b-45b2-a4de-93fb3566b3e1</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/7675941f-4a11-463c-8a05-924eb103a483</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/3b2598b8-f0f7-4d39-a637-87d692899911</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="38">
<string lang="en"><![CDATA[Was Keith Richards a member of The Rolling Stones?]]></string>
<string lang="de"><![CDATA[War Keith Richards bei den Rolling Stones?]]></string>
<string lang="es"><![CDATA[Fue Keith Richards un miembro de los Rolling Stones?]]></string>
<string lang="it"><![CDATA[Keith Richards era un componente dei Rolling Stones?]]></string>
<string lang="fr"><![CDATA[Keith Richards a-t-il été un membre des Rolling Stones?]]></string>
<string lang="nl"><![CDATA[Was Keith Richards lid van The Rolling Stones?]]></string>
<keywords lang="en"><![CDATA[Keith Richards, member, The Rolling Stones]]></keywords>
<keywords lang="de"><![CDATA[Keith Richards, Mitglied, The Rolling Stones]]></keywords>
<keywords lang="es"><![CDATA[Keith Richard, miembro, Rolling Stones]]></keywords>
<keywords lang="it"><![CDATA[Keith Richards, componente, The Rolling Stones]]></keywords>
<keywords lang="fr"><![CDATA[Keith Richards, membre, Rolling Stones]]></keywords>
<keywords lang="nl"><![CDATA[lid, Keith Richards, The Rolling Stones]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
ASK 
WHERE { 
  ?artist foaf:name 'Keith Richards' .
  ?artist mo:member_of ?band . 
  ?band foaf:name 'The Rolling Stones' .
}]]></query>
<answers>
<answer>
<boolean>true</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="56">
<string lang="en"><![CDATA[Give me all songs on the album Abbey Road.]]></string>
<string lang="de"><![CDATA[Gib mir alle Lieder von dem Album Abbey Road.]]></string>
<string lang="es"><![CDATA[Dame todas las canciones del álbum Abbey Road]]></string>
<string lang="it"><![CDATA[]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Geef alle nummers van het album Abbey Road.]]></string>
<keywords lang="en"><![CDATA[Abbey Road, song]]></keywords>
<keywords lang="de"><![CDATA[Abbey Road, Lied]]></keywords>
<keywords lang="es"><![CDATA[canciones ,  álbum Abbey Road]]></keywords>
<keywords lang="it"><![CDATA[Abbey Road, canzoni]]></keywords>
<keywords lang="fr"><![CDATA[morceaux, Abbey Road]]></keywords>
<keywords lang="nl"><![CDATA[Abbey Road, nummer]]></keywords>
<query><![CDATA[PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?track 
WHERE {
  ?album mo:release_type mo:album .
  ?album dc:title 'Abbey Road' .
  ?album mo:track ?track .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/track/e113c56f-c4d4-4bfb-b9f0-6f90a172b5a9</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/fdae8b76-f5b8-4458-bf32-81885000980b</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/0a6f3cf0-8323-46cf-9cc5-82f8f15b1717</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/26457540-e3ce-46b4-a56f-3229bbac45f0</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/a0a8de0d-ddac-4623-a006-d290cbc8f969</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/52929a64-6a7f-4c1e-9f2a-30782665fbb9</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/5ddd279b-2279-47b5-a6b1-dc9985df0f43</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/551b3432-2080-488c-a283-e768e79d281b</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/482fe397-3509-411c-b5aa-4e1589087bd7</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/cc0b4fca-6f76-47f3-a5bd-99494fdbae95</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/86e7b87d-6242-41fc-bdf8-7b3b0a082673</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/f3c9792f-c6aa-4b1e-9feb-ce75a30b1f34</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/dbbe983f-83cf-4b59-87ac-9250047665ae</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/608a270c-eac0-4675-ac6e-780312ffdf98</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/e8c9907d-ff64-463c-8eff-fc78fd38884d</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/8956ecf8-1ad3-469a-a04f-a7ba47516739</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/track/021499f4-4fdd-4260-a8e6-ab11daa349e1</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="14">
<string lang="en"><![CDATA[How many bands broke up in 2010?]]></string>
<string lang="de"><![CDATA[Wieviele Bands haben sich 2010 aufgelöst?]]></string>
<string lang="es"><![CDATA[Cuantas bandas se rompieron en el 2010?]]></string>
<string lang="it"><![CDATA[Quanti gruppi musicali si sono separati nel 2010?]]></string>
<string lang="fr"><![CDATA[Quels groupes ont été dissous en 2010?]]></string>
<string lang="nl"><![CDATA[Hoeveel bands zijn gestopt in 2010?]]></string>
<keywords lang="en"><![CDATA[number of bands, end date, 2010]]></keywords>
<keywords lang="de"><![CDATA[Anzahl Bands, Enddatum, 2010]]></keywords>
<keywords lang="es"><![CDATA[bandas, fecha de ruptura, 2010]]></keywords>
<keywords lang="it"><![CDATA[numero di gruppi musicali, data di separazione, 2010]]></keywords>
<keywords lang="fr"><![CDATA[groupes, dissous, 2010?]]></keywords>
<keywords lang="nl"><![CDATA[aantal bands, gestopt, 2010]]></keywords>
<query><![CDATA[PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?artist)
WHERE {
  ?artist rdf:type mo:MusicGroup .
  ?artist bio:event ?event .
  ?event rdf:type bio:Death .
  { ?event bio:date ?date .
    FILTER ( ?date <= 2010-12-31^^xsd:date && ?date >= 2010-01-01^^xsd:date ) 
  }
  UNION 
  { ?event bio:date ?date .
    FILTER regex (?date,2010)
  }
}]]></query>
<answers>
<answer>
<number>81</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="19">
<string lang="en"><![CDATA[Who produced the album In Utero?]]></string>
<string lang="de"><![CDATA[Wer hat das Album In Utero produziert?]]></string>
<string lang="es"><![CDATA[Quien produjo el álbum In Utero?]]></string>
<string lang="it"><![CDATA[]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Wie produceerde het album In Utero?]]></string>
<keywords lang="en"><![CDATA[album, In Utero, producer]]></keywords>
<keywords lang="de"><![CDATA[Album, In Utero, Produzent]]></keywords>
<keywords lang="es"><![CDATA[autor, álbum, In Utero]]></keywords>
<keywords lang="it"><![CDATA[album, In Utero, produttore]]></keywords>
<keywords lang="fr"><![CDATA[produit, album, In Utero]]></keywords>
<keywords lang="nl"><![CDATA[producent, In Utero]]></keywords>
<query><![CDATA[PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?producer
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:album .
  ?album dc:title 'In Utero' .
  ?album mo:producer ?producer .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/a4d486bd-6020-4a36-9c7d-bf5ce174bcd1</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="37">
<string lang="en"><![CDATA[Which members of the Beatles are already dead?]]></string>
<string lang="de"><![CDATA[Welche Mitglieder der Beatles sind bereits tot?]]></string>
<string lang="es"><![CDATA[Que miembros de los Beatles están muertos?]]></string>
<string lang="it"><![CDATA[Quali membri dei Beatles sono già morti?]]></string>
<string lang="fr"><![CDATA[Quels membres des Beatles sont déjà morts?]]></string>
<string lang="nl"><![CDATA[Welke leden van The Beatles zijn overleden?]]></string>
<keywords lang="en"><![CDATA[member, The Beatles, dead]]></keywords>
<keywords lang="de"><![CDATA[Mitglied, The Beatles, tot]]></keywords>
<keywords lang="es"><![CDATA[miembros, Beatles, muertos]]></keywords>
<keywords lang="it"><![CDATA[membro, Beatles, morto]]></keywords>
<keywords lang="fr"><![CDATA[membres, Beatles, morts]]></keywords>
<keywords lang="nl"><![CDATA[lid, The Beatles, overleden]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Beatles' .
  ?artist bio:event ?event .
  ?event rdf:type bio:Death .
  FILTER (bound(?event))
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/4d5447d7-c61c-4120-ba1b-d7f471d385b9</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/42a8f507-8412-4611-854f-926571049fa0</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/49a51491-650e-44b3-8085-2f07ac2986dd</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="23">
<string lang="en"><![CDATA[Since when does Millencolin exist?]]></string>
<string lang="de"><![CDATA[Seit wann gibt es Millencolin?]]></string>
<string lang="es"><![CDATA[Desde cuando existe el Millencolin?]]></string>
<string lang="it"><![CDATA[Da quando esistono i Millencolin?]]></string>
<string lang="fr"><![CDATA[Depuis quand existe Millencolin?]]></string>
<string lang="nl"><![CDATA[Sinds wanneer bestaat Millencolin?]]></string>
<keywords lang="en"><![CDATA[Millencolin, begin date]]></keywords>
<keywords lang="de"><![CDATA[Millencolin, Startdatum]]></keywords>
<keywords lang="es"><![CDATA[Millencolin, fecha de inicio]]></keywords>
<keywords lang="it"><![CDATA[]]></keywords>
<keywords lang="fr"><![CDATA[]]></keywords>
<keywords lang="nl"><![CDATA[Millencolin, datum, oprichting]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Millencolin'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}]]></query>
<answers>
<answer>
<date>1992-10-12</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="59">
<string lang="en"><![CDATA[Did Elvis Presley record jazz albums?]]></string>
<string lang="de"><![CDATA[Hat Elvis Presley Jazz-Alben aufgenommen?]]></string>
<string lang="es"><![CDATA[Ha grabado Elvis Presley álbumes de jazz?]]></string>
<string lang="it"><![CDATA[Elvis Presley ha inciso album jazz?]]></string>
<string lang="fr"><![CDATA[Elvis Presley a-t-il enregistré des albums de jazz?]]></string>
<string lang="nl"><![CDATA[Heeft Elvis Presley jazz-albums opgenomen?]]></string>
<keywords lang="en"><![CDATA[jazz album, Elvis Presley]]></keywords>
<keywords lang="de"><![CDATA[Jazz-Album, Elvis Presley]]></keywords>
<keywords lang="es"><![CDATA[jazz álbumes, Elvis Presley]]></keywords>
<keywords lang="it"><![CDATA[album jazz, Elvis Presley]]></keywords>
<keywords lang="fr"><![CDATA[Elvis Presley, albums de jazz]]></keywords>
<keywords lang="nl"><![CDATA[jazz-album, Elvis Presley]]></keywords>
<query><![CDATA[PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK
WHERE {
  ?album rdf:type mo:Record .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Elvis Presley' .
  ?album dc:description 'jazz' .
}]]></query>
<answers>
<answer>
<boolean>true</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="45">
<string lang="en"><![CDATA[Is there a group called The Notwist?]]></string>
<string lang="de"><![CDATA[Gibt es eine Gruppe, die The Notwist heißt?]]></string>
<string lang="es"><![CDATA[Existe un grupo que se llama The Notwist?]]></string>
<string lang="it"><![CDATA[Esiste un gruppo che si chiama The Notwist?]]></string>
<string lang="fr"><![CDATA[Existe-t-il un groupe appelé The Notwist?]]></string>
<string lang="nl"><![CDATA[Bestaat er een band met de naam The Notwist?]]></string>
<keywords lang="en"><![CDATA[group, name, The Notwist]]></keywords>
<keywords lang="de"><![CDATA[Gruppe, Name, The Notwist]]></keywords>
<keywords lang="es"><![CDATA[grupo, llamado, Notwist]]></keywords>
<keywords lang="it"><![CDATA[gruppo, nome, The Notwist]]></keywords>
<keywords lang="fr"><![CDATA[groupe, appelé, The Notwist]]></keywords>
<keywords lang="nl"><![CDATA[band, naam, The Notwist]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK 
WHERE {
  ?artist rdf:type mo:MusicGroup .
  ?artist foaf:name 'The Notwist' .
}]]></query>
<answers>
<answer>
<boolean>true</boolean>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="88">
<string lang="en"><![CDATA[How many soundtracks did Hans Zimmer compose?]]></string>
<string lang="de"><![CDATA[Wieviele Soundtracks hat Hans Zimmer komponiert?]]></string>
<string lang="es"><![CDATA[Cuantas bandas sonoras ha compuesto Hans Zimmer?]]></string>
<string lang="it"><![CDATA[Quante colonne sonore sono state composte da Hans Zimmer?]]></string>
<string lang="fr"><![CDATA[Combien de bandes sons a composé Hans Zimmer?]]></string>
<string lang="nl"><![CDATA[Hoeveel soundtracks heeft Hans Zimmer gecomponeerd?]]></string>
<keywords lang="en"><![CDATA[number of soundtracks, composer, Hans Zimmer]]></keywords>
<keywords lang="de"><![CDATA[Anzahl Soundtracks, Komponist, Hans Zimmer]]></keywords>
<keywords lang="es"><![CDATA[bandas sonoras, compositor, Hans Zimmer]]></keywords>
<keywords lang="it"><![CDATA[numero di colonne sonore, compositore, Hans Zimmer]]></keywords>
<keywords lang="fr"><![CDATA[nombre de bandes sons, composé, Hans Zimmer]]></keywords>
<keywords lang="nl"><![CDATA[aantal soundtracks, Hans Zimmer]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?album)
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:soundtrack .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Hans Zimmer' .
}]]></query>
<answers>
<answer>
<number>99</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="string" id="50">
<string lang="en"><![CDATA[Give me the names of the children of John Lennon.]]></string>
<string lang="de"><![CDATA[Gib mir die Namen der Kinder von John Lennon.]]></string>
<string lang="es"><![CDATA[Dame los nombres de todos los hijos de John Lennon]]></string>
<string lang="it"><![CDATA[Dammi i nomi dei figli di John Lennon.]]></string>
<string lang="fr"><![CDATA[Donnes-moi les noms des enfants de John Lennon.]]></string>
<string lang="nl"><![CDATA[Geef de namen van de kinderen van John Lennon.]]></string>
<keywords lang="en"><![CDATA[name, child, John Lennon]]></keywords>
<keywords lang="de"><![CDATA[Name, Kind, John Lennon]]></keywords>
<keywords lang="es"><![CDATA[nombre, hijos, John Lennon]]></keywords>
<keywords lang="it"><![CDATA[nome, figlio, John Lennon]]></keywords>
<keywords lang="fr"><![CDATA[noms, enfants, John Lennon]]></keywords>
<keywords lang="nl"><![CDATA[naam, kind, John Lennon]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?name
WHERE {
  ?artist foaf:name 'John Lennon' .
  ?artist rel:parentOf ?child .
  ?child foaf:name ?name .
}]]></query>
<answers>
<answer>
<string><![CDATA[Julian Lennon]]></string>
</answer>
<answer>
<string><![CDATA[Sean Lennon]]></string>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="36">
<string lang="en"><![CDATA[In which band did Frank Sinatra sing?]]></string>
<string lang="de"><![CDATA[In welcher Band hat Frank Sinatra gesungen?]]></string>
<string lang="es"><![CDATA[En que banda ha cantado Frank Sinatra?]]></string>
<string lang="it"><![CDATA[In quale gruppo musicale cantava Frank Sinatra?]]></string>
<string lang="fr"><![CDATA[Dans quel groupe chanta Frank Sinatra?]]></string>
<string lang="nl"><![CDATA[In welke band heeft Frank Sinatra gezongen?]]></string>
<keywords lang="en"><![CDATA[Frank Sinatra, band]]></keywords>
<keywords lang="de"><![CDATA[Frank Sinatra, Band]]></keywords>
<keywords lang="es"><![CDATA[Frank Sinatra, banda]]></keywords>
<keywords lang="it"><![CDATA[Frank Sinatra, gruppo musicale]]></keywords>
<keywords lang="fr"><![CDATA[groupe, Frank Sinatra]]></keywords>
<keywords lang="nl"><![CDATA[Frank Sinatra, band]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?band
WHERE {
  ?artist foaf:name 'Frank Sinatra' .
  ?artist mo:member_of ?band .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/35e227e5-f724-4699-91b2-d5184cdc7411</uri>
</answer>
</answers>
</question>
