<?xml version="1.0" ?>
<dataset id="musicbrainz-train">
<question aggregation="false" answertype="resource" id="79">
<string lang="en"><![CDATA[Who did the vocals on the album Sabotage?]]></string>
<string lang="de"><![CDATA[Wer ist der Sänger auf dem Album Sabotage?]]></string>
<string lang="es"><![CDATA[Quienes son los vocales en el álbum de Sabotage?]]></string>
<string lang="it"><![CDATA[]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Wie is de zanger op het album Sabotage?]]></string>
<keywords lang="en"><![CDATA[album, Sabotage, vocals]]></keywords>
<keywords lang="de"><![CDATA[Album, Sabotage, Sänger]]></keywords>
<keywords lang="es"><![CDATA[vocales, álbum Sabotage]]></keywords>
<keywords lang="it"><![CDATA[album, Sabotage, cantante]]></keywords>
<keywords lang="fr"><![CDATA[chante, album, Sabotage]]></keywords>
<keywords lang="nl"><![CDATA[zanger, album, Sabotage]]></keywords>
<query><![CDATA[PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?singer
WHERE {
  ?album mo:release_type mo:album . 
  ?album dc:title 'Sabotage' .
  ?album mo:singer ?singer .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/8aa5b65a-5b3c-4029-92bf-47a544356934</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="62">
<string lang="en"><![CDATA[Give me all siblings of Michael Jackson.]]></string>
<string lang="de"><![CDATA[Gib mir alle Geschwister von Michael Jackson.]]></string>
<string lang="es"><![CDATA[Dame todos los hermanos de Michael Jackson]]></string>
<string lang="it"><![CDATA[Dammi tutti i fratelli e le sorelle di Michael Jackson.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les frères et soeurs de Michael Jackson.]]></string>
<string lang="nl"><![CDATA[Geef alle broers en zusters van Michael Jackson.]]></string>
<keywords lang="en"><![CDATA[Michael Jackson, sibling]]></keywords>
<keywords lang="de"><![CDATA[Michael Jackson, Geschwister]]></keywords>
<keywords lang="es"><![CDATA[hermanos, Michael Jackson]]></keywords>
<keywords lang="it"><![CDATA[Michael Jackson, fratelli e sorelle]]></keywords>
<keywords lang="fr"><![CDATA[frères et soeurs, Michael Jackson]]></keywords>
<keywords lang="nl"><![CDATA[broer of zuster, Michael Jackson]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist
WHERE {
  ?mj foaf:name 'Michael Jackson' .
  ?artist rel:siblingOf ?mj .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/ccbdc2ab-1055-44d5-8417-a6b4898bf91b</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/6be2828f-6c0d-4059-99d4-fa18acf1a296</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/7a0a724b-6c98-4a7a-9991-2faf659d3f8b</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/78bb7e34-0e7f-4103-b180-5274d11e50da</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/593abf14-4292-4d62-b365-79c7674cd1a5</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/d06f65d2-26e0-4d40-95e5-22592917eb52</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/19a3943b-19fb-4781-a585-afe9f46fd6d1</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/dfa29df0-2f21-409c-8509-a75e72205e1d</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="58">
<string lang="en"><![CDATA[How many bands are called Air?]]></string>
<string lang="de"><![CDATA[Wieviele Bands heißen Air?]]></string>
<string lang="es"><![CDATA[Cuantas bandas se llaman Air?]]></string>
<string lang="it"><![CDATA[Quanti gruppi musicali si chiamano Air?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Hoeveel bands heten Air?]]></string>
<keywords lang="en"><![CDATA[number of bands, name, Air]]></keywords>
<keywords lang="de"><![CDATA[Anzahl Bands, Name, Air]]></keywords>
<keywords lang="es"><![CDATA[bandas, llamadas Air]]></keywords>
<keywords lang="it"><![CDATA[numero di gruppi musicali, nome, Air]]></keywords>
<keywords lang="fr"><![CDATA[nombre de groupes, appellent, Air]]></keywords>
<keywords lang="nl"><![CDATA[aantal bands, naam, Air]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?artist)
WHERE {
  ?artist rdf:type mo:MusicGroup .
  ?artist foaf:name 'Air' .
}]]></query>
<answers>
<answer>
<number>3</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="11">
<string lang="en"><![CDATA[Was Quee MacArthur a member of Queen?]]></string>
<string lang="de"><![CDATA[War Quee MacArthur Mitglied bei Queen?]]></string>
<string lang="es"><![CDATA[Fue Quee MacArthur un miembro de Queen?]]></string>
<string lang="it"><![CDATA[Quee MacArthur era un membro dei Queen?]]></string>
<string lang="fr"><![CDATA[Quee MacArthur est-il un membre de Queen?]]></string>
<string lang="nl"><![CDATA[Was Quee MacArthur lid van Queen?]]></string>
<keywords lang="en"><![CDATA[Quee MacArthur, member, Queen]]></keywords>
<keywords lang="de"><![CDATA[Quee MacArthur, Mitglied, Queen]]></keywords>
<keywords lang="es"><![CDATA[Quee MacArthur, miembro, Queen]]></keywords>
<keywords lang="it"><![CDATA[Quee MacArthur, membro, Queen]]></keywords>
<keywords lang="fr"><![CDATA[MacArthur, membre, Queen]]></keywords>
<keywords lang="nl"><![CDATA[Quee MacArthur, lid, Queen]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
ASK 
WHERE {
 ?artist foaf:name 'Quee MacArthur' .
 ?artist mo:member_of ?band .
 ?band foaf:name 'Queen' .
}]]></query>
<answers>
<answer>
<boolean>false</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="84">
<string lang="en"><![CDATA[In which bands did Kurt Cobain play?]]></string>
<string lang="de"><![CDATA[In welchen Bands hat Kurt Cobain gespielt?]]></string>
<string lang="es"><![CDATA[En que bandas toco Kurt Cobain?]]></string>
<string lang="it"><![CDATA[In quali gruppi musicali suonava Kurt Cobain?]]></string>
<string lang="fr"><![CDATA[Dans quels groupes a joué Kurt Cobain?]]></string>
<string lang="nl"><![CDATA[In welke bands heeft Kurt Cobain gespeeld?]]></string>
<keywords lang="en"><![CDATA[Kurt Cobain, band]]></keywords>
<keywords lang="de"><![CDATA[Kurt Cobain, Band]]></keywords>
<keywords lang="es"><![CDATA[Kurt Cobain, bandas]]></keywords>
<keywords lang="it"><![CDATA[Kurt Cobain, gruppo musicale]]></keywords>
<keywords lang="fr"><![CDATA[groupes, Kurt Cobain]]></keywords>
<keywords lang="nl"><![CDATA[band, lid, Kurt Cobain]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?band
WHERE {
  ?artist foaf:name 'Kurt Cobain' . 
  ?artist mo:member_of ?band .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/5b11f4ce-a62d-471e-81fc-a69a8278c7da</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/b12602a1-77c4-4d5f-8c5e-9e4b2fa2e812</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/0f8e6822-3672-400c-a87c-792c7a293544</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/33abc5cd-1e91-417d-9c8f-8296be818df9</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/8d36fd9a-ccd2-4902-a3cb-128ed4a07773</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/b6d94c23-7046-477d-bbea-07bcd247e99d</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/408779b7-3512-4269-ac76-3068c5fcbe52</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/552f7965-a23a-4e2f-9ef2-ac2989dea9f0</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/a599c70e-1bea-4fcc-a110-446c38427b1f</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/6d797b95-2011-4859-91ab-9284d1e1f472</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="70">
<string lang="en"><![CDATA[What is the longest song by John Cage?]]></string>
<string lang="de"><![CDATA[Was ist das längste Lied von John Cage?]]></string>
<string lang="es"><![CDATA[Cual es la canción mas larga de John Cage?]]></string>
<string lang="it"><![CDATA[Qual è la canzone più lunga di John Cage?]]></string>
<string lang="fr"><![CDATA[Quel est le plus long morceau de John Cage?]]></string>
<string lang="nl"><![CDATA[Wat is het langste nummer van John Cage?]]></string>
<keywords lang="en"><![CDATA[John Cage, song, length, maximum]]></keywords>
<keywords lang="de"><![CDATA[John Cage, Lied, Länge, Maximum]]></keywords>
<keywords lang="es"><![CDATA[canción, mas larga, John Cage]]></keywords>
<keywords lang="it"><![CDATA[John Cage, canzone, lunghezza massima]]></keywords>
<keywords lang="fr"><![CDATA[morceau, John Cage, longueur maximale]]></keywords>
<keywords lang="nl"><![CDATA[John Cage, lengte, nummer, maximum]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
SELECT ?song
WHERE {
  ?song tl:duration ?duration .
  ?song foaf:maker ?artist .
  ?artist foaf:name 'John Cage' .
}
ORDER BY DESC(?duration)
LIMIT 1]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/track/50a270c5-4bc3-496c-94f1-96b547db9195</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="97">
<string lang="en"><![CDATA[Which Beatles were married more than once?]]></string>
<string lang="de"><![CDATA[Welche Beatles waren mehr als einmal verheiratet?]]></string>
<string lang="es"><![CDATA[Que Beatles se han casado más de una vez?]]></string>
<string lang="it"><![CDATA[Quali Beatles sono stati sposati più di una volta?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Welke Beatles waren meer dan één keer getrouwd?]]></string>
<keywords lang="en"><![CDATA[The Beatles, member, number of spouses, greater than 1]]></keywords>
<keywords lang="de"><![CDATA[The Beatles, Mitglied, Anzahl Ehepartner, größer als 1]]></keywords>
<keywords lang="es"><![CDATA[Beatles, casado, más una vez]]></keywords>
<keywords lang="it"><![CDATA[Beatles, membro, numero di mogli, maggiore di 1]]></keywords>
<keywords lang="fr"><![CDATA[]]></keywords>
<keywords lang="nl"><![CDATA[The Beatles, lid, aantal echtgenotes, meer dan 1]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist
WHERE {
  ?band foaf:name 'The Beatles' .
  ?artist mo:member_of ?band .
  ?artist rel:spouseOf ?spouse .
} 
GROUP BY ?artist
HAVING (COUNT(?spouse) > 1)]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/300c4c73-33ac-4255-9d57-4e32627f5e13</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="71">
<string lang="en"><![CDATA[Which compilations does the song Waterloo by ABBA appear on?]]></string>
<string lang="de"><![CDATA[Auf welchen Kompilationen ist das Lied Waterloo von ABBA?]]></string>
<string lang="es"><![CDATA[En que compilaciones aparece la canción de Waterloo de ABBA?]]></string>
<string lang="it"><![CDATA[In quale raccolta compare la canzone Waterloo degli ABBA?]]></string>
<string lang="fr"><![CDATA[Sur quelles compilations se trouve le morceau Waterloo de ABBA?]]></string>
<string lang="nl"><![CDATA[Op welke verzamelalbums staat het nummer Waterloo van ABBA?]]></string>
<keywords lang="en"><![CDATA[compilation, song, Waterloo, ABBA]]></keywords>
<keywords lang="de"><![CDATA[Kompilation, Lied, Waterloo, ABBA]]></keywords>
<keywords lang="es"><![CDATA[compilaciones, canción de Waterloo, ABBA]]></keywords>
<keywords lang="it"><![CDATA[raccolta, canzone, Waterloo, ABBA]]></keywords>
<keywords lang="fr"><![CDATA[compilations, morceau, Waterloo, ABBA]]></keywords>
<keywords lang="nl"><![CDATA[verzamelalbum, Waterloo, ABBA]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?album
WHERE {
  ?album mo:release_type mo:compilation .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'ABBA' .
  ?track dc:title 'Waterloo' .
  ?album mo:track ?track .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/09cc6e86-9901-40f0-a53e-a638e95744ba</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/7c360f0a-1378-4a72-a823-9b5005bb25d8</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/871273e8-a54c-41a1-9f6c-5457956a7ed7</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/7594668c-4c43-491e-b0a7-2ef7e6f34b71</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/39eb12c2-02a2-415a-a74c-e9c52b0d0170</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/957a3841-afa9-48f6-b21d-d78558438fde</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/2439dff2-c5f6-420e-a0ba-961dc23f2cb0</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/ed3318f1-fe4a-460a-9ab7-ae7175848928</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/48cf6a4e-4c61-4214-afe3-ed4e11d902c9</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/6db223dd-814b-4075-88f8-49eb2021f712</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/89234824-1072-4997-b0f7-babf502441d1</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/803d405f-b7bc-4a76-be27-93fbc45b03d5</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="44">
<string lang="en"><![CDATA[How many versions of the song Smells Like Teen Spirit are there?]]></string>
<string lang="de"><![CDATA[Wieviele Versionen des Liedes Smells Like Teen Spirit gibt es?]]></string>
<string lang="es"><![CDATA[Cuantas versiones existen de la canción Smells like Teen Spirit?]]></string>
<string lang="it"><![CDATA[Quante versioni esistono della canzone Smells Like Teen Spirit?]]></string>
<string lang="fr"><![CDATA[Combien de versions du morceau Smells Like Teen Spirit existe-t-il?]]></string>
<string lang="nl"><![CDATA[Hoeveel versies van het nummer Smells Like Teen Spirit zijn er?]]></string>
<keywords lang="en"><![CDATA[number of versions, song, Smells Like Teen Spirit]]></keywords>
<keywords lang="de"><![CDATA[Anzahl Versionen, Lied, Smells Like Teen Spirit]]></keywords>
<keywords lang="es"><![CDATA[versiones, canción Smells like Teen Spirit]]></keywords>
<keywords lang="it"><![CDATA[numero di versioni, canzone, Smells Like Teen Spirit]]></keywords>
<keywords lang="fr"><![CDATA[nombre de versions, morceau, Smells Like Teen Spirit]]></keywords>
<keywords lang="nl"><![CDATA[aantal versies, nummer, Smells Like Teen Spirit]]></keywords>
<query><![CDATA[PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?track)
WHERE { 
  ?track rdf:type mo:Track .
  ?track dc:title 'Smells Like Teen Spirit' .
}]]></query>
<answers>
<answer>
<number>53</number>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="85">
<string lang="en"><![CDATA[Which bands released more than 100 singles?]]></string>
<string lang="de"><![CDATA[Welche Bands haben mehr als 100 Singles herausgebracht?]]></string>
<string lang="es"><![CDATA[Que bandas tienen más de 100 singles]]></string>
<string lang="it"><![CDATA[Quale gruppo musicale ha rilasciato più di 100 singoli?]]></string>
<string lang="fr"><![CDATA[Quels groupes ont publié plus de 100 singles?]]></string>
<string lang="nl"><![CDATA[Welke bands hebben meer dan 100 singles uitgebracht?]]></string>
<keywords lang="en"><![CDATA[band, number of singles, greater than 100]]></keywords>
<keywords lang="de"><![CDATA[Band, Anzahl Singles, größer als 100]]></keywords>
<keywords lang="es"><![CDATA[bandas, más 100 singles]]></keywords>
<keywords lang="it"><![CDATA[gruppo musicale, numero di singoli, maggiore di 100]]></keywords>
<keywords lang="fr"><![CDATA[groupes, nombre de singles, plus de 100]]></keywords>
<keywords lang="nl"><![CDATA[band, aantal singles, meer dan 100]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?band
WHERE {
  ?band rdf:type mo:MusicGroup .
  ?album mo:release_type mo:single .
  ?album foaf:maker ?band .
} 
GROUP BY ?band
HAVING (COUNT(?album) > 100)]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/ba853904-ae25-4ebb-89d6-c44cfbd71bd2</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/be540c02-7898-4b79-9acc-c8122c7d9e83</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/f1106b17-dcbb-45f6-b938-199ccfab50cc</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/9bffb20c-dd17-4895-9fd1-4e73e888d799</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/a3cb23fc-acd3-4ce0-8f36-1e5aa6a18432</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/8538e728-ca0b-4321-b7e5-cff6565dd4c0</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/ea4dfa26-f633-4da6-a52a-f49ea4897b58</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/0383dadf-2a4e-4d10-a46a-e9e041da8eb3</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/f4857fb9-e255-4dc6-bd01-e4ca7cc68544</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/43b58c98-3779-4b04-9a23-1c95cca3a145</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/82cabc8e-312e-42ea-8b9a-5fb03f28e635</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/8baeebf2-1579-4806-a019-c18260491e06</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/29542149-a818-4167-aa91-439adc9d61f5</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="42">
<string lang="en"><![CDATA[Who composed the soundtrack of The Virgin Suicides?]]></string>
<string lang="de"><![CDATA[Wer hat den Soundtrack zu The Virgin Suicides komponiert?]]></string>
<string lang="es"><![CDATA[Quien compuso la banda sonora de Virgin Suicides?]]></string>
<string lang="it"><![CDATA[Chi ha composto la colonna sonora de Il giardino delle vergini suicide?]]></string>
<string lang="fr"><![CDATA[Qui a composé la bande son de Virgin Suicides?]]></string>
<string lang="nl"><![CDATA[Wie heeft de soundtrack van The Virgin Suicides gecomponeerd?]]></string>
<keywords lang="en"><![CDATA[soundtrack, The Virgin Suicides, composer]]></keywords>
<keywords lang="de"><![CDATA[Soundtrackm The Virgin Suicides, Komponist]]></keywords>
<keywords lang="es"><![CDATA[compositor, banda sonora, Virgin Suicides]]></keywords>
<keywords lang="it"><![CDATA[colonna sonora, Il giardino delle vergini suicide, compositore]]></keywords>
<keywords lang="fr"><![CDATA[composé, bande son, Virgin Suicides]]></keywords>
<keywords lang="nl"><![CDATA[componist, soundtrack, The Virgin Suicides]]></keywords>
<query><![CDATA[PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?composer
WHERE {
    ?album mo:release_type mo:soundtrack .
    ?album dc:title 'The Virgin Suicides' .
    ?album mo:composer ?composer . 
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/cb67438a-7f50-4f2b-a6f1-2bb2729fd538</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="13">
<string lang="en"><![CDATA[Which solo artists were born on the 29th of December 1960?]]></string>
<string lang="de"><![CDATA[Welche Solokünstler wurden am 29. Dezember 1960 geboren?]]></string>
<string lang="es"><![CDATA[Que solistas han nacido en el 29 de Diciembre de 1960?]]></string>
<string lang="it"><![CDATA[Quali solisti sono nati il 29 Dicembre 1960?]]></string>
<string lang="fr"><![CDATA[Quels artistes solos sont nés le 29 Décembre 1960?]]></string>
<string lang="nl"><![CDATA[Welke solo-artiesten werden op 29 december 1960 geboren?]]></string>
<keywords lang="en"><![CDATA[solo artist, birth date, 1960-12-29]]></keywords>
<keywords lang="de"><![CDATA[Solokünstler, Geburtstag, 1960-12-29]]></keywords>
<keywords lang="es"><![CDATA[solistas, fecha de nacimiento, 1960-12-29]]></keywords>
<keywords lang="it"><![CDATA[solista, data di nascita, 1960-12-29]]></keywords>
<keywords lang="fr"><![CDATA[artistes solos, nés, 29 Décembre 1960]]></keywords>
<keywords lang="nl"><![CDATA[solo-artiest, geboren, 1960-12-29]]></keywords>
<query><![CDATA[PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist
WHERE {
  ?artist rdf:type mo:SoloMusicArtist .
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date 1960-12-29^^xsd:dateTime .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/bda0b10d-09d4-4e49-bd89-7255c34da7bc</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/1c609c5b-d3f3-4b84-90eb-9ad01220b68b</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="96">
<string lang="en"><![CDATA[How many children did John Lennon have?]]></string>
<string lang="de"><![CDATA[Wieviele Kinder hatte John Lennon?]]></string>
<string lang="es"><![CDATA[Cuantos hijos tiene John Lennon]]></string>
<string lang="it"><![CDATA[Quanti figli ha avuto John Lennon?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Hoeveel kinderen had John Lennon?]]></string>
<keywords lang="en"><![CDATA[John Lennon, number of children]]></keywords>
<keywords lang="de"><![CDATA[John Lennon, Anzahl Kinder]]></keywords>
<keywords lang="es"><![CDATA[John Lennon, numero de hijos]]></keywords>
<keywords lang="it"><![CDATA[John Lennon, numero di figli]]></keywords>
<keywords lang="fr"><![CDATA[]]></keywords>
<keywords lang="nl"><![CDATA[John Lennon, aantal kinderen]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT COUNT(DISTINCT ?child)
WHERE {
  ?artist foaf:name 'John Lennon' .
  ?artist rel:parentOf ?child .
}]]></query>
<answers>
<answer>
<number>2</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="82">
<string lang="en"><![CDATA[Which bands was Robbie Williams a member of?]]></string>
<string lang="de"><![CDATA[In welchen Bands war Robbie Williams?]]></string>
<string lang="es"><![CDATA[En que bandas era miembro Robbie Williams]]></string>
<string lang="it"><![CDATA[Di quale gruppo musicale Robbie Williams era membro?]]></string>
<string lang="fr"><![CDATA[De quels groupes était Robie Williams un membre?]]></string>
<string lang="nl"><![CDATA[Van welke bands was Robbie Williams lid?]]></string>
<keywords lang="en"><![CDATA[band, member, Robbie Williams]]></keywords>
<keywords lang="de"><![CDATA[Band, Mitglied, Robbie Williams]]></keywords>
<keywords lang="es"><![CDATA[bandas, miembro, Robbie Williams]]></keywords>
<keywords lang="it"><![CDATA[gruppo musicale, membro, Robbie Williams]]></keywords>
<keywords lang="fr"><![CDATA[groupes, Robie Williams, membre]]></keywords>
<keywords lang="nl"><![CDATA[band, lid, Robbie Williams]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?band
WHERE {
  ?artist foaf:name 'Robbie Williams' .
  ?artist mo:member_of ?band .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/24d2505b-388c-46cc-8a64-48223ea6d78d</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="100">
<string lang="en"><![CDATA[Since when does Scattered Earth exist?]]></string>
<string lang="de"><![CDATA[Seit wann gibt es Scattered Earth?]]></string>
<string lang="es"><![CDATA[Desde cuando existe Scattered Earth?]]></string>
<string lang="it"><![CDATA[Da quando esistono gli Scattered Earth?]]></string>
<string lang="fr"><![CDATA[Depuis quand existe Scattered Earth?]]></string>
<string lang="nl"><![CDATA[Sinds wanneer bestaat Scattered Earth?]]></string>
<keywords lang="en"><![CDATA[Scattered Earth, start date]]></keywords>
<keywords lang="de"><![CDATA[Scattered Earth, Startdatum]]></keywords>
<keywords lang="es"><![CDATA[fecha de inicio, Scattered Earth]]></keywords>
<keywords lang="it"><![CDATA[Scattered Earth, data di inizio]]></keywords>
<keywords lang="fr"><![CDATA[Scattered Earth, date de création]]></keywords>
<keywords lang="nl"><![CDATA[Scattered Earth, oprichting, datum]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Scattered Earth'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}]]></query>
<answers>
<answer>
<date>2007-10-25</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="89">
<string lang="en"><![CDATA[When were The Vertigos founded?]]></string>
<string lang="de"><![CDATA[Wann wurden The Vertigos gegründet?]]></string>
<string lang="es"><![CDATA[Cuando se fundaron los Vertigos?]]></string>
<string lang="it"><![CDATA[Quando sono stati fondati i Vertigos?]]></string>
<string lang="fr"><![CDATA[Quand a été fondé The Vertigos?]]></string>
<string lang="nl"><![CDATA[Wanneer werden The Vertigos opgericht?]]></string>
<keywords lang="en"><![CDATA[The Vertigos, start date]]></keywords>
<keywords lang="de"><![CDATA[The Vertigos, Startdatum]]></keywords>
<keywords lang="es"><![CDATA[fundaron, Vertigos]]></keywords>
<keywords lang="it"><![CDATA[The Vertigos, data di inizio]]></keywords>
<keywords lang="fr"><![CDATA[date de fondations, The Vertigos]]></keywords>
<keywords lang="nl"><![CDATA[The Vertigos, opgericht, datum]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'The Vertigos'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}]]></query>
<answers>
<answer>
<date>2010-02-01</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="number" id="20">
<string lang="en"><![CDATA[How long is the song Hardcore Kids?]]></string>
<string lang="de"><![CDATA[Wie lang ist das Lied Hardcore Kids?]]></string>
<string lang="es"><![CDATA[Cual es la duración de la canción Hardcore Kids?]]></string>
<string lang="it"><![CDATA[Quanto dura la canzone Hardcore Kids?]]></string>
<string lang="fr"><![CDATA[Quelle est la durée du morceau Hardcore Kids?]]></string>
<string lang="nl"><![CDATA[Hoe lang duurt het nummer Hardcore Kids?]]></string>
<keywords lang="en"><![CDATA[song, Hardcore Kids, length]]></keywords>
<keywords lang="de"><![CDATA[Lied, Hardcore Kids, Länge]]></keywords>
<keywords lang="es"><![CDATA[duración, canción Hardcore Kids]]></keywords>
<keywords lang="it"><![CDATA[canzone, Hardcore Kids, durata]]></keywords>
<keywords lang="fr"><![CDATA[durée, morceau, Hardcore Kids]]></keywords>
<keywords lang="nl"><![CDATA[lengte, nummer, Hardcore Kids]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?duration
WHERE {
  ?track rdf:type mo:Track . 
  ?track dc:title 'Hardcore Kids' .
  ?track tl:duration ?duration .
}]]></query>
<answers>
<answer>
<number>5.733</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="33">
<string lang="en"><![CDATA[Which singles did the Dead Kennedys release?]]></string>
<string lang="de"><![CDATA[Welche Singles haben die Dead Kennedys herausgebracht?]]></string>
<string lang="es"><![CDATA[Cuantos Singles ha estrenado Dead Kennedys?]]></string>
<string lang="it"><![CDATA[Quali singoli ha rilasciato Dead Kennedys?]]></string>
<string lang="fr"><![CDATA[Quels singles ont chanté les Dead Kennedys?]]></string>
<string lang="nl"><![CDATA[Welke singles hebben Dead Kennedys uitgebracht?]]></string>
<keywords lang="en"><![CDATA[Dead Kennedys, single]]></keywords>
<keywords lang="de"><![CDATA[Dead Kennedys, Single]]></keywords>
<keywords lang="es"><![CDATA[numero de single, Dead Kennedys]]></keywords>
<keywords lang="it"><![CDATA[Dead Kennedys, singolo]]></keywords>
<keywords lang="fr"><![CDATA[singles, Dead Kennedys]]></keywords>
<keywords lang="nl"><![CDATA[single, Dead Kennedys]]></keywords>
<query><![CDATA[PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?single
WHERE {
  ?artist rdf:type mo:MusicArtist .
  ?artist foaf:name 'Dead Kennedys' .
  ?single mo:release_type mo:single .
  ?single foaf:maker ?artist .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/1ac9bffe-b8cc-419d-acab-c4c8b5481447</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/3529d969-f67a-43f4-946a-4febde04bcdb</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/ae51a412-c123-4659-922c-7fdeb195595f</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/d7222b51-7f3e-4e31-a015-7259753c52a3</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/51622cd0-2b15-4272-ab81-4c9221bbc833</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/437af265-b907-492b-8565-797ca7d0fdf9</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/75db269a-64f1-410d-9e07-06d9aa8ff6d8</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/15cf0aa5-9087-483b-9770-0a9f8abaf6c6</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="30">
<string lang="en"><![CDATA[Give me the birthdays of all members of The Beatles.]]></string>
<string lang="de"><![CDATA[Gib mir die Geburtstage von allen Mitgliedern der Beatles.]]></string>
<string lang="es"><![CDATA[Dame los cumpleaños de todos los miembros de los Beathes]]></string>
<string lang="it"><![CDATA[Dammi i compleanni di tutti i membri dei Beatles.]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Noem de geboortedata van alle leden van The Beatles.]]></string>
<keywords lang="en"><![CDATA[member, The Beatles, birthday]]></keywords>
<keywords lang="de"><![CDATA[Mitglied, The Beatles, Geburtstag]]></keywords>
<keywords lang="es"><![CDATA[cumpleaños, miembros, Beatles]]></keywords>
<keywords lang="it"><![CDATA[membri, Beatles, compleanno]]></keywords>
<keywords lang="fr"><![CDATA[]]></keywords>
<keywords lang="nl"><![CDATA[geboortedatum, lid, The Beatles]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Beatles' .
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}]]></query>
<answers>
<answer>
<date>1940-10-09</date>
</answer>
<answer>
<date>1942-06-18</date>
</answer>
<answer>
<date>1943-02-24</date>
</answer>
<answer>
<date>1941-11-24</date>
</answer>
<answer>
<date>1940-06-23</date>
</answer>
<answer>
<date>1940-07-07</date>
</answer>
</answers>
</question>
