<?xml version="1.0" encoding="UTF-8"?>
<dataset id="musicbrainz-train">

<question id="25" answertype="boolean" aggregation="true">
<string lang="en"><![CDATA[
Are there members of the Ramones that are not called Ramone?
]]></string>
<string lang="de"><![CDATA[
Gibt es Mitglieder der Ramones, die nicht Ramone heißen?
]]></string>
<string lang="es"><![CDATA[
Hay algún miembro de los Ramones que no se llame Ramon?
]]></string>
<string lang="it"><![CDATA[
Ci sono membri dei Ramones che non si chiamano Ramone?
]]></string>
<string lang="fr"><![CDATA[
Y a-t-il des membres des Ramones qui ne s'appellent pas Ramone?
]]></string>
<string lang="nl"><![CDATA[
Zijn er bandleden van The Ramones die niet Ramone heten?
]]></string>
<keywords lang="en"><![CDATA[ 
Ramones, member, not, name, Ramone
]]></keywords>
<keywords lang="de"><![CDATA[
Ramones, Mitglied, nicht, Name, Ramone
]]></keywords>
<keywords lang="es"><![CDATA[ 
Ramones, miembros, no llamado Ramone
]]></keywords>
<keywords lang="it"><![CDATA[ 
Ramones, membro, nome diverso da, Ramone
]]></keywords>
<keywords lang="fr"><![CDATA[ 
membres des Ramones, s'appellent pas, Ramone
]]></keywords>
<keywords lang="nl"><![CDATA[ 
The Ramones, bandlid, niet, naam, Ramone
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
ASK 
WHERE {
	?band foaf:name 'Ramones' .
	?artist foaf:name ?artistname .
	?artist mo:member_of ?band .
        FILTER (NOT regex(?artistname,"Ramone"))
}
]]></query>
</question>

<question id="26" answertype="date" aggregation="false">
<string lang="en"><![CDATA[
When was Elvis Presley born?
]]></string>
<string lang="de"><![CDATA[
Wann wurde Elvis Presley geboren?
]]></string>
<string lang="es"><![CDATA[
Cuando nació Elvis Presley?
]]></string>
<string lang="it"><![CDATA[
Quando è nato Elvis Presley?
]]></string>
<string lang="fr"><![CDATA[
Quand est né Elvis Presley?
]]></string>
<string lang="nl"><![CDATA[
Wat is de geboortedatum van Elvis Presley?
]]></string>
<keywords lang="en"><![CDATA[ 
Elvis Presley, birth date
]]></keywords>
<keywords lang="de"><![CDATA[
Elvis Presley, Geburtstag
]]></keywords>
<keywords lang="es"><![CDATA[ 
fecha de nacimiento, Elvis Presley
]]></keywords>
<keywords lang="it"><![CDATA[ 
Elvis Presley, data di nascita
]]></keywords>
<keywords lang="fr"><![CDATA[ 
date de naissance, Elvis Presley
]]></keywords>
<keywords lang="nl"><![CDATA[ 
geboortedatum, Elvis Presley
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Elvis Presley'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}
]]></query>
</question>

<question id="27" answertype="number" aggregation="true">
<string lang="en"><![CDATA[
How many artists are called John Williams?
]]></string>
<string lang="de"><![CDATA[
Wieviele Künstler heißen John Williams?
]]></string>
<string lang="es"><![CDATA[
Cuantos artistas se llaman John Williams?
]]></string>
<string lang="it"><![CDATA[
Quanti artisti si chiamano John Williams?
]]></string>
<string lang="fr"><![CDATA[
Combien d'artistes s'appellent John Williams?
]]></string>
<string lang="nl"><![CDATA[
Hoeveel artiesten met de naam John Williams zijn er?
]]></string>
<keywords lang="en"><![CDATA[ 
number of artists, name, John Williams
]]></keywords>
<keywords lang="de"><![CDATA[
Anzahl Künstler, Name, John Williams
]]></keywords>
<keywords lang="es"><![CDATA[ 
numero artistas, nombre, John Williams
]]></keywords>
<keywords lang="it"><![CDATA[ 
numero di artisti, nome, John Williams
]]></keywords>
<keywords lang="fr"><![CDATA[ 
nombre d'artistes, appellent, John Williams
]]></keywords>
<keywords lang="nl"><![CDATA[ 
aantal artiesten, naam, John Williams
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?artist)
WHERE {
  ?artist rdf:type mo:SoloMusicArtist .
  ?artist foaf:name 'John Williams' .
}
]]></query>
</question>

<question id="28" answertype="date" aggregation="false">
<string lang="en"><![CDATA[
Since when is Tom Araya a member of Slayer?
]]></string>
<string lang="de"><![CDATA[
Seit wann ist Tom Araya bei Slayer?
]]></string>
<string lang="es"><![CDATA[
Desde cuando es Tom Araya un miembro de Slayer?
]]></string>
<string lang="it"><![CDATA[
Da quando Tom Araya è uno dei membri degli Slayer?
]]></string>
<string lang="fr"><![CDATA[
Depuis quand Tom Araya est-il un membre de Slayer?
]]></string>
<string lang="nl"><![CDATA[
Sinds wanneer is Tom Araya lid van Slayer?
]]></string>
<keywords lang="en"><![CDATA[ 
Tom Araya, member, Slayer, begin date
]]></keywords>
<keywords lang="de"><![CDATA[
Tom Araya, Mitglied, Slayer, Startdatum
]]></keywords>
<keywords lang="es"><![CDATA[ 
Tom Araya, fecha de inicio, Slayer
]]></keywords>
<keywords lang="it"><![CDATA[ 
Tom Araya, membro, Slayer, data inizio
]]></keywords>
<keywords lang="fr"><![CDATA[ 
Tom Araya, membre, Slayer, date
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Tom Araya, lid, Slayer, toetredingsdatum
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX event: <http://purl.org/NET/c4dm/event.owl#>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?beginDate
WHERE {
  ?artist foaf:name 'Tom Araya' .
  ?band foaf:name 'Slayer' .
  ?event rdf:type mo:membership .
  ?event event:agent ?artist .
  ?event mo:group ?band .
  ?event event:time ?eventtime .
  ?eventtime tl:start ?beginDate .
}
]]></query>
</question>

<question id="29" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me all people who were members of The Beatles.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Personen, die jemals bei den Beatles waren.
]]></string>
<string lang="es"><![CDATA[
Dame todos los miembros de los Beatles
]]></string>
<string lang="it"><![CDATA[
Dammi tutte le persone che sono state membri dei Beatles.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les personnes qui ont été membres des Beatles.
]]></string>
<string lang="nl"><![CDATA[
Noem alle personen die ooit lid van The Beatles waren.
]]></string>
<keywords lang="en"><![CDATA[ 
member, The Beatles
]]></keywords>
<keywords lang="de"><![CDATA[
Mitglied, The Beatles
]]></keywords>
<keywords lang="es"><![CDATA[ 
miembros, Beatles
]]></keywords>
<keywords lang="it"><![CDATA[ 
membro, Beatles
]]></keywords>
<keywords lang="fr"><![CDATA[ 
membres, Beatles
]]></keywords>
<keywords lang="nl"><![CDATA[ 
lid, The Beatles
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?artist
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Beatles' .
}
]]></query>
</question>

<question id="30" answertype="date" aggregation="false">
<string lang="en"><![CDATA[
Give me the birthdays of all members of The Beatles.
]]></string>
<string lang="de"><![CDATA[
Gib mir die Geburtstage von allen Mitgliedern der Beatles.
]]></string>
<string lang="es"><![CDATA[
Dame los cumpleaños de todos los miembros de los Beathes
]]></string>
<string lang="it"><![CDATA[
Dammi i compleanni di tutti i membri dei Beatles.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi les dates d'anniversaire des membres des Beatles.
]]></string>
<string lang="nl"><![CDATA[
Noem de geboortedata van alle leden van The Beatles.
]]></string>
<keywords lang="en"><![CDATA[ 
member, The Beatles, birthday
]]></keywords>
<keywords lang="de"><![CDATA[
Mitglied, The Beatles, Geburtstag
]]></keywords>
<keywords lang="es"><![CDATA[ 
cumpleaños, miembros, Beatles
]]></keywords>
<keywords lang="it"><![CDATA[ 
membri, Beatles, compleanno
]]></keywords>
<keywords lang="fr"><![CDATA[ 
dates d'anniversaire, membres, Beatles
]]></keywords>
<keywords lang="nl"><![CDATA[ 
geboortedatum, lid, The Beatles
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Beatles' .
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}
]]></query>
</question>

<question id="31" answertype="date" aggregation="false">
<string lang="en"><![CDATA[
When did Pete Best leave The Beatles?
]]></string>
<string lang="de"><![CDATA[
Wann hat Pete Best die Beatles verlassen?
]]></string>
<string lang="es"><![CDATA[
Cuando dejo Pete Best los Beatles?
]]></string>
<string lang="it"><![CDATA[
Quando Pete Best ha lasciato i Beatles?
]]></string>
<string lang="fr"><![CDATA[
Quand a Pete Best quitté les Beatles?
]]></string>
<string lang="nl"><![CDATA[
Wanneer verliet Pete Best The Beatles?
]]></string>
<keywords lang="en"><![CDATA[ 
Pete Best, The Beatles, end date
]]></keywords>
<keywords lang="de"><![CDATA[
Pete Best, The Beatles, Enddatum
]]></keywords>
<keywords lang="es"><![CDATA[ 
Pete Best, Beatles, dejo
]]></keywords>
<keywords lang="it"><![CDATA[ 
Pete Best, Beatles, data di fine
]]></keywords>
<keywords lang="fr"><![CDATA[ 
Pete Best, quitté, Beatles
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Pete Best, The Beatles, verliet, datum
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX event: <http://purl.org/NET/c4dm/event.owl#>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Pete Best' .
  ?event rdf:type mo:membership .
  ?event event:agent ?artist .
  ?event mo:group ?band .
  ?band foaf:name 'The Beatles' .
  ?event event:time ?time .
  ?time tl:end ?date .
}
]]></query>
</question>

<question id="32" answertype="resource" aggregation="true">
<string lang="en"><![CDATA[
Which solo artists died on the same day as Elvis?
]]></string>
<string lang="de"><![CDATA[
Welche Solokünstler starben am selben Tag wie Elvis?
]]></string>
<string lang="es"><![CDATA[
Que solistas murieron en el mismo día que Elvis?
]]></string>
<string lang="it"><![CDATA[
Quale solista mori lo stesso giorni di Elvis?
]]></string>
<string lang="fr"><![CDATA[
Quels artistes solos sont morts le même jour qu'Elvis Presley?
]]></string>
<string lang="nl"><![CDATA[
Welke solo-artiesten stierven op dezelfde dag als Elvis?
]]></string>
<keywords lang="en"><![CDATA[ 
solo artist, death date, same as, Elvis, death date
]]></keywords>
<keywords lang="de"><![CDATA[
Solokünstler, Todesdatum, gleich, Elvis, Todesdatum
]]></keywords>
<keywords lang="es"><![CDATA[ 
solistas, fecha de defunción, igual , Elvis
]]></keywords>
<keywords lang="it"><![CDATA[ 
solista, data di morte, uguale a, Elvis, data di morte
]]></keywords>
<keywords lang="fr"><![CDATA[ 
artistes solos, date décès, même, Elvis Presley
]]></keywords>
<keywords lang="nl"><![CDATA[ 
solo-artiest, sterfdatum, identiek, Elvis
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist
WHERE {
  ?elvis foaf:name 'Elvis Presley' .
  ?elvis bio:event ?event .
  ?event rdf:type bio:Death .
  ?event bio:date ?date . 
  ?artist rdf:type mo:SoloMusicArtist .
  ?artist bio:event ?event_2 .
  ?event_2 rdf:type bio:Death .
  ?event_2 bio:date ?date .
  FILTER (!sameTerm(?artist,?elvis))
}
]]></query>
</question>

<question id="33" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Which singles did the Dead Kennedys release?
]]></string>
<string lang="de"><![CDATA[
Welche Singles haben die Dead Kennedys herausgebracht?
]]></string>
<string lang="es"><![CDATA[
Cuantos Singles ha estrenado Dead Kennedys?
]]></string>
<string lang="it"><![CDATA[
Quali singoli ha rilasciato Dead Kennedys?
]]></string>
<string lang="fr"><![CDATA[
Quels singles ont chanté les Dead Kennedys?
]]></string>
<string lang="nl"><![CDATA[
Welke singles hebben Dead Kennedys uitgebracht?
]]></string>
<keywords lang="en"><![CDATA[ 
Dead Kennedys, single
]]></keywords>
<keywords lang="de"><![CDATA[
Dead Kennedys, Single
]]></keywords>
<keywords lang="es"><![CDATA[ 
numero de single, Dead Kennedys
]]></keywords>
<keywords lang="it"><![CDATA[ 
Dead Kennedys, singolo
]]></keywords>
<keywords lang="fr"><![CDATA[ 
singles, Dead Kennedys
]]></keywords>
<keywords lang="nl"><![CDATA[ 
single, Dead Kennedys
]]></keywords>
<query><![CDATA[
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?single
WHERE {
  ?artist rdf:type mo:MusicArtist .
  ?artist foaf:name 'Dead Kennedys' .
  ?single mo:release_type mo:single .
  ?single foaf:maker ?artist .
}
]]></query>
</question>

<question id="34" answertype="resource" aggregation="true">
<string lang="en"><![CDATA[
Is Liz Story a person or a group?
]]></string>
<string lang="de"><![CDATA[
Ist Liz Story eine Person oder eine Band?
]]></string>
<string lang="es"><![CDATA[
Es Liz Story una persona o un grupo
]]></string>
<string lang="it"><![CDATA[
Liz Story è una persona o un gruppo musicale?
]]></string>
<string lang="fr"><![CDATA[
Liz Story est-elle une personne ou un groupe?
]]></string>
<string lang="nl"><![CDATA[
Is Liz Story een persoon of een band?
]]></string>
<keywords lang="en"><![CDATA[ 
Liz Story, person or group
]]></keywords>
<keywords lang="de"><![CDATA[
Liz Story, Person oder Band
]]></keywords>
<keywords lang="es"><![CDATA[ 
Liz Story, persona, grupo
]]></keywords>
<keywords lang="it"><![CDATA[ 
Liz Story, persona o gruppo
]]></keywords>
<keywords lang="fr"><![CDATA[ 
Liz Story, personne, group
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Liz Story, persoon of band
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artisttype
WHERE {
    ?artist foaf:name 'Liz Story'.
    ?artist rdf:type ?artisttype .
    FILTER (?artisttype != mo:MusicArtist)
}
]]></query>
</question>

<question id="35" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Who was Frank Sinatra married to?
]]></string>
<string lang="de"><![CDATA[
Mit wem war Frank Sinatra verheiratet?
]]></string>
<string lang="es"><![CDATA[
Con quien se caso Frank Sinatra?
]]></string>
<string lang="it"><![CDATA[
Con chi era sposato Frank Sinatra?
]]></string>
<string lang="fr"><![CDATA[
Qui était l'épouse de Frank Sinatra?
]]></string>
<string lang="nl"><![CDATA[
Met wie was Frank Sinatra getrouwd?
]]></string>
<keywords lang="en"><![CDATA[ 
Frank Sinatra, spouse
]]></keywords>
<keywords lang="de"><![CDATA[
Frank Sinatra, Ehepartner
]]></keywords>
<keywords lang="es"><![CDATA[ 
esposa, Frank Sinatra
]]></keywords>
<keywords lang="it"><![CDATA[ 
Frank Sinatra, moglie
]]></keywords>
<keywords lang="fr"><![CDATA[ 
épouse, Frank Sinatra
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Frank Sinatra, echtgenote
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?spouse
WHERE {
  ?spouse rel:spouseOf ?artist .
  ?artist foaf:name 'Frank Sinatra' .
}
]]></query>
</question>

<question id="36" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
In which band did Frank Sinatra sing?
]]></string>
<string lang="de"><![CDATA[
In welcher Band hat Frank Sinatra gesungen?
]]></string>
<string lang="es"><![CDATA[
En que banda ha cantado Frank Sinatra? 
]]></string>
<string lang="it"><![CDATA[
In quale gruppo musicale cantava Frank Sinatra?
]]></string>
<string lang="fr"><![CDATA[
Dans quel groupe chanta Frank Sinatra?
]]></string>
<string lang="nl"><![CDATA[
In welke band heeft Frank Sinatra gezongen?
]]></string>
<keywords lang="en"><![CDATA[ 
Frank Sinatra, band
]]></keywords>
<keywords lang="de"><![CDATA[
Frank Sinatra, Band
]]></keywords>
<keywords lang="es"><![CDATA[ 
Frank Sinatra, banda
]]></keywords>
<keywords lang="it"><![CDATA[ 
Frank Sinatra, gruppo musicale
]]></keywords>
<keywords lang="fr"><![CDATA[ 
groupe, Frank Sinatra
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Frank Sinatra, band
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?band
WHERE {
  ?artist foaf:name 'Frank Sinatra' .
  ?artist mo:member_of ?band .
}
]]></query>
</question>

<question id="37" answertype="resource" aggregation="true">
<string lang="en"><![CDATA[
Which members of the Beatles are already dead?
]]></string>
<string lang="de"><![CDATA[
Welche Mitglieder der Beatles sind bereits tot?
]]></string>
<string lang="es"><![CDATA[
Que miembros de los Beatles están muertos?
]]></string>
<string lang="it"><![CDATA[
Quali membri dei Beatles sono già morti?
]]></string>
<string lang="fr"><![CDATA[
Quels membres des Beatles sont déjà morts?
]]></string>
<string lang="nl"><![CDATA[
Welke leden van The Beatles zijn overleden?
]]></string>
<keywords lang="en"><![CDATA[ 
member, The Beatles, dead
]]></keywords>
<keywords lang="de"><![CDATA[
Mitglied, The Beatles, tot
]]></keywords>
<keywords lang="es"><![CDATA[ 
miembros, Beatles, muertos
]]></keywords>
<keywords lang="it"><![CDATA[ 
membro, Beatles, morto
]]></keywords>
<keywords lang="fr"><![CDATA[ 
membres, Beatles, morts
]]></keywords>
<keywords lang="nl"><![CDATA[ 
lid, The Beatles, overleden
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Beatles' .
  ?artist bio:event ?event .
  ?event rdf:type bio:Death .
  FILTER (bound(?event))
}
]]></query>
</question>

<question id="38" answertype="boolean" aggregation="false">
<string lang="en"><![CDATA[
Was Keith Richards a member of The Rolling Stones?
]]></string>
<string lang="de"><![CDATA[
War Keith Richards bei den Rolling Stones?
]]></string>
<string lang="es"><![CDATA[
Fue Keith Richards un miembro de los Rolling Stones?
]]></string>
<string lang="it"><![CDATA[
Keith Richards era un componente dei Rolling Stones?
]]></string>
<string lang="fr"><![CDATA[
Keith Richards a-t-il été un membre des Rolling Stones?
]]></string>
<string lang="nl"><![CDATA[
Was Keith Richards lid van The Rolling Stones?
]]></string>
<keywords lang="en"><![CDATA[ 
Keith Richards, member, The Rolling Stones
]]></keywords>
<keywords lang="de"><![CDATA[
Keith Richards, Mitglied, The Rolling Stones
]]></keywords>
<keywords lang="es"><![CDATA[ 
Keith Richard, miembro, Rolling Stones
]]></keywords>
<keywords lang="it"><![CDATA[ 
Keith Richards, componente, The Rolling Stones
]]></keywords>
<keywords lang="fr"><![CDATA[ 
Keith Richards, membre, Rolling Stones
]]></keywords>
<keywords lang="nl"><![CDATA[ 
lid, Keith Richards, The Rolling Stones
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
ASK 
WHERE { 
  ?artist foaf:name 'Keith Richards' .
  ?artist mo:member_of ?band . 
  ?band foaf:name 'The Rolling Stones' .
}
]]></query>
</question>

<question id="40" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Who created the song Freeway of Love?
]]></string>
<string lang="de"><![CDATA[
Wer hat das Lied Freeway of Love geschrieben?
]]></string>
<string lang="es"><![CDATA[
Quien creo la canción Freeway of Love
]]></string>
<string lang="it"><![CDATA[
Chi ha scritto la canzone Freeway of Love?
]]></string>
<string lang="fr"><![CDATA[
Qui a composé le morceau Freeway of Love?
]]></string>
<string lang="nl"><![CDATA[
Wie schreef het nummer Freeway of Love?
]]></string>
<keywords lang="en"><![CDATA[ 
song, Freeway of Love, creator
]]></keywords>
<keywords lang="de"><![CDATA[
Lied, Freeway of Love, Urheber
]]></keywords>
<keywords lang="es"><![CDATA[ 
autor, canción, Freeway of Love
]]></keywords>
<keywords lang="it"><![CDATA[ 
canzone, Freeway of Love, scrittore
]]></keywords>
<keywords lang="fr"><![CDATA[ 
composé, morceau, Freeway of Love
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Freeway of Love, componist
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist
WHERE {
  ?track rdf:type mo:Track .
  ?track dc:title 'Freeway of Love' .
  ?track foaf:maker ?artist .
}
]]></query>
</question>

<question id="41" answertype="date" aggregation="false">
<string lang="en"><![CDATA[
When did Kurt Cobain die?
]]></string>
<string lang="de"><![CDATA[
Wann ist Kurt Cobain gestorben?
]]></string>
<string lang="es"><![CDATA[
Cuando murió Kurt Cobain
]]></string>
<string lang="it"><![CDATA[
Quando mori Kurt Cobain?
]]></string>
<string lang="fr"><![CDATA[
Quand est mort Kurt Cobain?
]]></string>
<string lang="nl"><![CDATA[
Wanneer overleed Kurt Cobain?
]]></string>
<keywords lang="en"><![CDATA[ 
Kurt Cobain, death date
]]></keywords>
<keywords lang="de"><![CDATA[
Kurt Cobain, Todesdatum
]]></keywords>
<keywords lang="es"><![CDATA[ 
fecha de defunción, Kurt Cobain
]]></keywords>
<keywords lang="it"><![CDATA[ 
Kurt Cobain, data di morte
]]></keywords>
<keywords lang="fr"><![CDATA[ 
data de décès, Kurt Cobain
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Kurt Cobain, sterfdatum
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Kurt Cobain'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Death .
  ?event bio:date ?date .
}
]]></query>
</question>

<question id="42" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Who composed the soundtrack of The Virgin Suicides?
]]></string>
<string lang="de"><![CDATA[
Wer hat den Soundtrack zu The Virgin Suicides komponiert?
]]></string>
<string lang="es"><![CDATA[
Quien compuso la banda sonora de Virgin Suicides?
]]></string>
<string lang="it"><![CDATA[
Chi ha composto la colonna sonora de Il giardino delle vergini suicide?
]]></string>
<string lang="fr"><![CDATA[
Qui a composé la bande son de Virgin Suicides?
]]></string>
<string lang="nl"><![CDATA[
Wie heeft de soundtrack van The Virgin Suicides gecomponeerd?
]]></string>
<keywords lang="en"><![CDATA[ 
soundtrack, The Virgin Suicides, composer
]]></keywords>
<keywords lang="de"><![CDATA[
Soundtrackm The Virgin Suicides, Komponist
]]></keywords>
<keywords lang="es"><![CDATA[ 
compositor, banda sonora, Virgin Suicides
]]></keywords>
<keywords lang="it"><![CDATA[ 
colonna sonora, Il giardino delle vergini suicide, compositore
]]></keywords>
<keywords lang="fr"><![CDATA[ 
composé, bande son, Virgin Suicides
]]></keywords>
<keywords lang="nl"><![CDATA[ 
componist, soundtrack, The Virgin Suicides
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?composer
WHERE {
    ?album mo:release_type mo:soundtrack .
    ?album dc:title 'The Virgin Suicides' .
    ?album mo:composer ?composer . 
}
]]></query>
</question>

<question id="43" answertype="resource" aggregation="true">
<string lang="en"><![CDATA[
Give me all Thrash Metal albums.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Thrash-Metal-Alben.
]]></string>
<string lang="es"><![CDATA[
Dame todos los álbumes de Thrash Metal
]]></string>
<string lang="it"><![CDATA[
Dammi tutti gli album dei Thrash Metal.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les albums de Trash Metal.
]]></string>
<string lang="nl"><![CDATA[
Noem alle Thrash Metal albums.
]]></string>
<keywords lang="en"><![CDATA[ 
album, Thrash Metal
]]></keywords>
<keywords lang="de"><![CDATA[
Album, Thrash Metal
]]></keywords>
<keywords lang="es"><![CDATA[ 
álbumes, Thrash Metal
]]></keywords>
<keywords lang="it"><![CDATA[ 
album, Thrash Metal
]]></keywords>
<keywords lang="fr"><![CDATA[ 
albums, Trash Metal
]]></keywords>
<keywords lang="nl"><![CDATA[ 
album, Thrash Metal
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album
WHERE {
    ?album rdf:type mo:Record .
    ?album dc:description ?tag .
    FILTER regex(?tag,"thrash metal","i")
}
]]></query>
</question>

<question id="44" answertype="number" aggregation="true">
<string lang="en"><![CDATA[
How many versions of the song Smells Like Teen Spirit are there?
]]></string>
<string lang="de"><![CDATA[
Wieviele Versionen des Liedes Smells Like Teen Spirit gibt es?
]]></string>
<string lang="es"><![CDATA[
Cuantas versiones existen de la canción Smells like Teen Spirit?
]]></string>
<string lang="it"><![CDATA[
Quante versioni esistono della canzone Smells Like Teen Spirit?
]]></string>
<string lang="fr"><![CDATA[
Combien de versions du morceau Smells Like Teen Spirit existe-t-il?
]]></string>
<string lang="nl"><![CDATA[
Hoeveel versies van het nummer Smells Like Teen Spirit zijn er?
]]></string>
<keywords lang="en"><![CDATA[ 
number of versions, song, Smells Like Teen Spirit
]]></keywords>
<keywords lang="de"><![CDATA[
Anzahl Versionen, Lied, Smells Like Teen Spirit
]]></keywords>
<keywords lang="es"><![CDATA[ 
versiones, canción Smells like Teen Spirit
]]></keywords>
<keywords lang="it"><![CDATA[ 
numero di versioni, canzone, Smells Like Teen Spirit
]]></keywords>
<keywords lang="fr"><![CDATA[ 
nombre de versions, morceau, Smells Like Teen Spirit 
]]></keywords>
<keywords lang="nl"><![CDATA[ 
aantal versies, nummer, Smells Like Teen Spirit
]]></keywords>
<query><![CDATA[
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?track)
WHERE { 
  ?track rdf:type mo:Track .
  ?track dc:title 'Smells Like Teen Spirit' .
}
]]></query>
</question>

<question id="45" answertype="boolean" aggregation="false">
<string lang="en"><![CDATA[
Is there a group called The Notwist?
]]></string>
<string lang="de"><![CDATA[
Gibt es eine Gruppe, die The Notwist heißt?
]]></string>
<string lang="es"><![CDATA[
Existe un grupo que se llama The Notwist?
]]></string>
<string lang="it"><![CDATA[
Esiste un gruppo che si chiama The Notwist?
]]></string>
<string lang="fr"><![CDATA[
Existe-t-il un groupe appelé The Notwist?
]]></string>
<string lang="nl"><![CDATA[
Bestaat er een band met de naam The Notwist?
]]></string>
<keywords lang="en"><![CDATA[ 
group, name, The Notwist
]]></keywords>
<keywords lang="de"><![CDATA[
Gruppe, Name, The Notwist
]]></keywords>
<keywords lang="es"><![CDATA[ 
grupo, llamado, Notwist
]]></keywords>
<keywords lang="it"><![CDATA[ 
gruppo, nome, The Notwist
]]></keywords>
<keywords lang="fr"><![CDATA[ 
groupe, appelé, The Notwist
]]></keywords>
<keywords lang="nl"><![CDATA[ 
band, naam, The Notwist
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK 
WHERE {
  ?artist rdf:type mo:MusicGroup .
  ?artist foaf:name 'The Notwist' .
}
]]></query>
</question>

<question id="46" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
List all members of The Notwist.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Mitglieder von The Notwist.
]]></string>
<string lang="es"><![CDATA[
Dame todos los miembros de Notwist
]]></string>
<string lang="it"><![CDATA[
Elenca tutti i membri dei The Notwist
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les membres de The Notwist.
]]></string>
<string lang="nl"><![CDATA[
Noem alle leden van de band The Notwist.
]]></string>
<keywords lang="en"><![CDATA[ 
The Notwist, member
]]></keywords>
<keywords lang="de"><![CDATA[
The Notwist, Mitglieder
]]></keywords>
<keywords lang="es"><![CDATA[ 
miembros, Notwist
]]></keywords>
<keywords lang="it"><![CDATA[ 
The Notwist, membri
]]></keywords>
<keywords lang="fr"><![CDATA[ 
membres, The Notwist
]]></keywords>
<keywords lang="nl"><![CDATA[ 
The Notwist, band, leden
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?artist
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Notwist' .
}
]]></query>
</question>

<question id="47" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Who collaborated on Tocotronic vs. Console?
]]></string>
<string lang="de"><![CDATA[
Wer arbeitete bei Tocotronic vs. Console zusammen?
]]></string>
<string lang="es"><![CDATA[
Quien ha colaborado en Tocotronic vvs. Console?
]]></string>
<string lang="it"><![CDATA[
Chi ha collaborato a Tocotronic vs. Console?
]]></string>
<string lang="fr"><![CDATA[
Qui a collaboré sur Tocotronic vs. Console?
]]></string>
<string lang="nl"><![CDATA[
Wie werkten samen op Tocotronic vs. Console?
]]></string>
<keywords lang="en"><![CDATA[ 
collaborate, Tocotronic vs. Console
]]></keywords>
<keywords lang="de"><![CDATA[
Zusammenarbeit, Tocotronic vs. Console
]]></keywords>
<keywords lang="es"><![CDATA[ 
colaboraciones, Tocotronic vs. Console
]]></keywords>
<keywords lang="it"><![CDATA[ 
collaborazione, Tocotronic vs. Console
]]></keywords>
<keywords lang="fr"><![CDATA[ 
collaboré, Tocotronic vs. Console
]]></keywords>
<keywords lang="nl"><![CDATA[ 
samenwerking, Tocotronic vs. Console
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist
WHERE {
  ?t_vs_c foaf:name 'Tocotronic vs. Console' .
  ?artist rel:collaboratesWith ?t_vs_c .
}
]]></query>
</question>

<question id="48" answertype="boolean" aggregation="true">
<string lang="en"><![CDATA[
Did the Sex Pistols already break up?
]]></string>
<string lang="de"><![CDATA[
Haben sich die Sex Pistols schon aufgelöst?
]]></string>
<string lang="es"><![CDATA[
Se han separado los Sex Pistols?
]]></string>
<string lang="it"><![CDATA[
I Sex Pistols si sono già separati?
]]></string>
<string lang="fr"><![CDATA[
Les Sex Pistols sont-ils dissous?
]]></string>
<string lang="nl"><![CDATA[
Zijn de Sex Pistols al uit elkaar?
]]></string>
<keywords lang="en"><![CDATA[ 
Sex Pistols, exists, end date
]]></keywords>
<keywords lang="de"><![CDATA[
Sex Pistols, existiert, Enddatum
]]></keywords>
<keywords lang="es"><![CDATA[ 
Sex Pistols, existe fecha de separación
]]></keywords>
<keywords lang="it"><![CDATA[ 
Sex Pistols, eistere, data di fine
]]></keywords>
<keywords lang="fr"><![CDATA[ 
Sex Pistols, existe, date de dissolution
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Sex Pistols, bestaat, einde
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK 
WHERE {
  ?artist foaf:name 'Sex Pistols'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Death .
  FILTER (bound(?event))
}
]]></query>
</question>

