<?xml version="1.0" encoding="UTF-8"?>
<dataset id="musicbrainz-train">

<question id="1" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Which singles did Slayer release?
]]></string>
<string lang="de"><![CDATA[
Welche Singles hat Slayer herausgebracht?
]]></string>
<string lang="es"><![CDATA[
Que Singles fueron estrenados por Slayer?
]]></string>
<string lang="it"><![CDATA[
Quali singoli ha rilasciato Slayer?
]]></string>
<string lang="fr"><![CDATA[
Quels singles ont été sortis par Slayer?
]]></string>
<string lang="nl"><![CDATA[
Welke singles bracht Slayer uit?
]]></string>
<keywords lang="en"><![CDATA[ 
Slayer, single
]]></keywords>
<keywords lang="de"><![CDATA[
Slayer, Single
]]></keywords>
<keywords lang="es"><![CDATA[ 
Singles, Slayer
]]></keywords>
<keywords lang="it"><![CDATA[ 
Slayer, singolo
]]></keywords>
<keywords lang="fr"><![CDATA[ 
Slayer, singles
]]></keywords>
<keywords lang="nl"><![CDATA[ 
single, Slayer
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?album
WHERE {
    ?album foaf:maker ?artist .
    ?artist foaf:name 'Slayer'.
    ?album mo:release_type mo:single .
}
]]></query>
</question>

<question id="2" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Which groups was David Bowie a member of?
]]></string>
<string lang="de"><![CDATA[
In welchen Bands war David Bowie?
]]></string>
<string lang="es"><![CDATA[
En que grupos fue miembro David Bownie?
]]></string>
<string lang="it"><![CDATA[
Di quali gruppi David Bowie è stato membro?
]]></string>
<string lang="fr"><![CDATA[
De quel groupe David Bowie était-il un membre?
]]></string>
<string lang="nl"><![CDATA[
Van welke bands was David Bowie lid?
]]></string>
<keywords lang="en"><![CDATA[ 
David Bowie, member, group
]]></keywords>
<keywords lang="de"><![CDATA[
David Bowie, Band
]]></keywords>
<keywords lang="es"><![CDATA[ 
grupos, David Bowie
]]></keywords>
<keywords lang="it"><![CDATA[ 
David Bowie, membro, gruppo
]]></keywords>
<keywords lang="fr"><![CDATA[ 
groupe, David Bowie, membre
]]></keywords>
<keywords lang="nl"><![CDATA[ 
band, David Bowie
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?band
WHERE {
  ?artist foaf:name 'David Bowie' .
  ?artist mo:member_of ?band .
}
]]></query>
</question>

<question id="3" answertype="date" aggregation="false">
<string lang="en"><![CDATA[
When was the band Dover founded?
]]></string>
<string lang="de"><![CDATA[
Wann wurde die Band Dover gegründet?
]]></string>
<string lang="es"><![CDATA[
Cuando fue fundada la banda Dover?
]]></string>
<string lang="it"><![CDATA[
Quando è stata creata la band Dover?
]]></string>
<string lang="fr"><![CDATA[
Quand a été fondé le groupe Dover?
]]></string>
<string lang="nl"><![CDATA[
Wanneer is de band Dover opgericht?
]]></string>
<keywords lang="en"><![CDATA[ 
Dover, band, founded
]]></keywords>
<keywords lang="de"><![CDATA[
Dover, Band, gegründet
]]></keywords>
<keywords lang="es"><![CDATA[ 
Dover, fecha inicio
]]></keywords>
<keywords lang="it"><![CDATA[ 
Dover, band, creare
]]></keywords>
<keywords lang="fr"><![CDATA[ 
fondé, groupe, Dover?
]]></keywords>
<keywords lang="nl"><![CDATA[ 
band, Dover, opgericht
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date 
WHERE {
    ?artist rdf:type mo:MusicGroup .
    ?artist foaf:name 'Dover'.
    ?artist bio:event ?event .
    ?event rdf:type bio:Birth .
    ?event bio:date ?date .
}
]]></query>
</question>

<question id="4" answertype="number" aggregation="true">
<string lang="en"><![CDATA[
How many albums did Michael Jackson record?
]]></string>
<string lang="de"><![CDATA[
Wieviele Alben hat Michael Jackson aufgenommen?
]]></string>
<string lang="es"><![CDATA[
Cuantos álbumes ha grabado Michael Jackson?
]]></string>
<string lang="it"><![CDATA[
Quanti album ha inciso Michael Jackson?
]]></string>
<string lang="fr"><![CDATA[
Combien d'albums ont été enregistrés par Michael Jackson?
]]></string>
<string lang="nl"><![CDATA[
Hoeveel albums heeft Michael Jackson opgenomen?
]]></string>
<keywords lang="en"><![CDATA[ 
Michael Jackson, number of albums
]]></keywords>
<keywords lang="de"><![CDATA[
Michael Jackson, Anzahl Alben
]]></keywords>
<keywords lang="es"><![CDATA[ 
Michael Jackson, numero de  álbumes
]]></keywords>
<keywords lang="it"><![CDATA[ 
Michael Jackson, numero di album
]]></keywords>
<keywords lang="fr"><![CDATA[ 
Michael Jackson, nombres d'albums
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Michael Jackson, albums
]]></keywords>
<query><![CDATA[
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT COUNT(DISTINCT ?album)
WHERE {
	?album rdf:type mo:Record .
	?album foaf:maker ?artist .
	?artist foaf:name 'Michael Jackson' .
}
]]></query>
</question>

<question id="5" answertype="resource" aggregation="true">
<string lang="en"><![CDATA[
Who composed the Star Wars soundtrack?
]]></string>
<string lang="de"><![CDATA[
Wer hat den Soundtrack zu Star Wars komponiert?
]]></string>
<string lang="es"><![CDATA[
Quien compuso la banda sonora de Star Wars?
]]></string>
<string lang="it"><![CDATA[
Chi ha composto la colonna sonora di Guerre Stellari?
]]></string>
<string lang="fr"><![CDATA[
Qui a composé la bande son de la Guerre des étoiles?
]]></string>
<string lang="nl"><![CDATA[
Wie was de componist van de soundtrack van Star Wars?
]]></string>
<keywords lang="en"><![CDATA[ 
Star Wars, soundtrack, composer
]]></keywords>
<keywords lang="de"><![CDATA[
Star Wars, Soundtrack, Komponist
]]></keywords>
<keywords lang="es"><![CDATA[ 
compositor, banda sonora, Star Wars
]]></keywords>
<keywords lang="it"><![CDATA[ 
Guerre Stellari, colonna sonora, compositore
]]></keywords>
<keywords lang="fr"><![CDATA[ 
bande son, composé, Guerre des étoiles
]]></keywords>
<keywords lang="nl"><![CDATA[ 
componist, Star Wars, soundtrack
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?composer
WHERE {
    ?album mo:release_type mo:soundtrack .
    ?album dc:title ?title .
    ?album mo:composer ?composer . 
FILTER regex(str(?title),"Star Wars")
}
]]></query>
</question>

<question id="6" answertype="resource" aggregation="true">
<string lang="en"><![CDATA[
Which solo artists had their 50th birthday on May 30, 2012?
]]></string>
<string lang="de"><![CDATA[
Welche Solokünstler hatten am 30. Mai 2012 ihren 50. Geburtstag?
]]></string>
<string lang="es"><![CDATA[
Que solitas cumplen su 50 cumpleaños en el 30 de Mayo del 2012?
]]></string>
<string lang="it"><![CDATA[
Quale solista ebbe in suo cinquantesimo compleanno il 30 maggio 2012?
]]></string>
<string lang="fr"><![CDATA[
Quels artistes solos ont eu 50 ans le 30 Mai 2012?
]]></string>
<string lang="nl"><![CDATA[
Welke solo-artiesten werden op 30 mei 2012 50?
]]></string>
<keywords lang="en"><![CDATA[ 
solo artist, 50th birthday, 2012-05-30
]]></keywords>
<keywords lang="de"><![CDATA[
Solokünstler, 50. Geburtstag, 2012-05-30
]]></keywords>
<keywords lang="es"><![CDATA[ 
solitas, 50 cumpleaños, 2012-05-30                        
]]></keywords>
<keywords lang="it"><![CDATA[ 
solista, cinquantesimo compleanno, 2012-05-30
]]></keywords>
<keywords lang="fr"><![CDATA[ 
artistes solos, 50 ans, 30 Mai 2012
]]></keywords>
<keywords lang="nl"><![CDATA[ 
solo-artiest, 50 jaar, 2012-05-30
]]></keywords>
<query><![CDATA[
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist
WHERE {
  ?artist rdf:type mo:SoloMusicArtist .
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date "1962-05-30"^^xsd:dateTime .
}
]]></query>
</question>

<question id="8" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me all Kraftwerk albums.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Kraftwerk-Alben.
]]></string>
<string lang="es"><![CDATA[
Dame todos los álbumes de Kraftwerk
]]></string>
<string lang="it"><![CDATA[
Dammi tutti gli album dei Kraftwerk.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les albums de Kraftwerk.
]]></string>
<string lang="nl"><![CDATA[
Geef alle albums van Kraftwerk.
]]></string>
<keywords lang="en"><![CDATA[ 
Kraftwerk, album
]]></keywords>
<keywords lang="de"><![CDATA[
Kraftwerk, Album
]]></keywords>
<keywords lang="es"><![CDATA[ 
álbumes, Kraftwerk
]]></keywords>
<keywords lang="it"><![CDATA[ 
Kraftwerk, album
]]></keywords>
<keywords lang="fr"><![CDATA[ 
albums, Kraftwerk
]]></keywords>
<keywords lang="nl"><![CDATA[ 
album, Kraftwerk
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:album .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Kraftwerk' .
}
]]></query>
</question>

<question id="9" answertype="number" aggregation="true">
<string lang="en"><![CDATA[
How many bands are called Nirvana? 
]]></string>
<string lang="de"><![CDATA[
Wieviele Band heißen Nirvana?
]]></string>
<string lang="es"><![CDATA[
Cuantas bandas se llaman Nirvana?
]]></string>
<string lang="it"><![CDATA[
Quanti gruppi musicali si chiamano Nirvana?
]]></string>
<string lang="fr"><![CDATA[
Combien de groupes s'appellent Nirvana?
]]></string>
<string lang="nl"><![CDATA[
Hoeveel bands heten Nirvana?
]]></string>
<keywords lang="en"><![CDATA[ 
number of bands, name, Nirvana
]]></keywords>
<keywords lang="de"><![CDATA[
Anzahl Bands, Name, Nirvana
]]></keywords>
<keywords lang="es"><![CDATA[ 
numero de bandas, nombre, Nirvana
]]></keywords>
<keywords lang="it"><![CDATA[ 
numero di gruppi musicali, nome, Nirvana
]]></keywords>
<keywords lang="fr"><![CDATA[ 
Nirvana, nombre de groupes
]]></keywords>
<keywords lang="nl"><![CDATA[ 
aantal bands, Nirvana
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?artist)
WHERE {
  ?artist rdf:type mo:MusicGroup .
  ?artist foaf:name 'Nirvana' .
}
]]></query>
</question>

<question id="10" answertype="date" aggregation="false">
<string lang="en"><![CDATA[
When did the Sex Pistols break up?
]]></string>
<string lang="de"><![CDATA[
Wann haben sich die Sex Pistols aufgelöst?
]]></string>
<string lang="es"><![CDATA[
Cuando rompieron los Sex Pistols?
]]></string>
<string lang="it"><![CDATA[
Quando si sono separati i Sex Pistols?
]]></string>
<string lang="fr"><![CDATA[
Quand ont été dissous les Sex Pistols?
]]></string>
<string lang="nl"><![CDATA[
Wanneer hielden de Sex Pistols op te bestaan?
]]></string>
<keywords lang="en"><![CDATA[ 
Sex Pistols, end date
]]></keywords>
<keywords lang="de"><![CDATA[
Sex Pistols, Enddatum
]]></keywords>
<keywords lang="es"><![CDATA[ 
Sex pistols, roptura 
]]></keywords>
<keywords lang="it"><![CDATA[ 
Sex Pistols, separazione
]]></keywords>
<keywords lang="fr"><![CDATA[ 
dissous, Sex Pistols
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Sex Pistols, einddatum
]]></keywords>
<query><![CDATA[
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Sex Pistols'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Death .
  ?event bio:date ?date .
}
]]></query>
</question>

<question id="11" answertype="boolean" aggregation="false">
<string lang="en"><![CDATA[
Was Quee MacArthur a member of Queen?
]]></string>
<string lang="de"><![CDATA[
War Quee MacArthur Mitglied bei Queen?
]]></string>
<string lang="es"><![CDATA[
Fue Quee MacArthur un miembro de Queen?
]]></string>
<string lang="it"><![CDATA[
Quee MacArthur era un membro dei Queen?
]]></string>
<string lang="fr"><![CDATA[
Quee MacArthur est-il un membre de Queen?
]]></string>
<string lang="nl"><![CDATA[
Was Quee MacArthur lid van Queen?
]]></string>
<keywords lang="en"><![CDATA[ 
Quee MacArthur, member, Queen
]]></keywords>
<keywords lang="de"><![CDATA[
Quee MacArthur, Mitglied, Queen
]]></keywords>
<keywords lang="es"><![CDATA[ 
Quee MacArthur, miembro, Queen
]]></keywords>
<keywords lang="it"><![CDATA[ 
Quee MacArthur, membro, Queen
]]></keywords>
<keywords lang="fr"><![CDATA[ 
 MacArthur, membre, Queen
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Quee MacArthur, lid, Queen
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
ASK 
WHERE {
 ?artist foaf:name 'Quee MacArthur' .
 ?artist mo:member_of ?band .
 ?band foaf:name 'Queen' .
}
]]></query>
</question>

<question id="12" answertype="date" aggregation="false">
<string lang="en"><![CDATA[
When is the birthday of Tom Waits?
]]></string>
<string lang="de"><![CDATA[
Wann hat Tom Waits Geburtstag?
]]></string>
<string lang="es"><![CDATA[
Cuando es el cumpleaños de Tom Waits?
]]></string>
<string lang="it"><![CDATA[
Quand è il compleanno di Tom Waits?
]]></string>
<string lang="fr"><![CDATA[
Quand est l'anniversaire de Tom Waits?
]]></string>
<string lang="nl"><![CDATA[
Wat is de verjaardag van Tom Waits?
]]></string>
<keywords lang="en"><![CDATA[ 
Tom Waits, birthday
]]></keywords>
<keywords lang="de"><![CDATA[
Tom Waits, Geburtstag
]]></keywords>
<keywords lang="es"><![CDATA[ 
cumpleaños, Tom Waits
]]></keywords>
<keywords lang="it"><![CDATA[ 
Tom Waits, compleanno
]]></keywords>
<keywords lang="fr"><![CDATA[ 
anniversaire, Tom Waits
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Tom Waits, verjaardag
]]></keywords>
<query><![CDATA[
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Tom Waits'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}
]]></query>
</question>

<question id="13" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Which solo artists were born on the 29th of December 1960?
]]></string>
<string lang="de"><![CDATA[
Welche Solokünstler wurden am 29. Dezember 1960 geboren?
]]></string>
<string lang="es"><![CDATA[
Que solistas han nacido en el 29 de Diciembre de 1960?
]]></string>
<string lang="it"><![CDATA[
Quali solisti sono nati il 29 Dicembre 1960?
]]></string>
<string lang="fr"><![CDATA[
Quels artistes solos sont nés le 29 Décembre 1960?
]]></string>
<string lang="nl"><![CDATA[
Welke solo-artiesten werden op 29 december 1960 geboren?
]]></string>
<keywords lang="en"><![CDATA[ 
solo artist, birth date, 1960-12-29
]]></keywords>
<keywords lang="de"><![CDATA[
Solokünstler, Geburtstag, 1960-12-29
]]></keywords>
<keywords lang="es"><![CDATA[ 
solistas, fecha de nacimiento, 1960-12-29
]]></keywords>
<keywords lang="it"><![CDATA[ 
solista, data di nascita, 1960-12-29
]]></keywords>
<keywords lang="fr"><![CDATA[ 
artistes solos, nés, 29 Décembre 1960
]]></keywords>
<keywords lang="nl"><![CDATA[ 
solo-artiest, geboren, 1960-12-29
]]></keywords>
<query><![CDATA[
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist
WHERE {
  ?artist rdf:type mo:SoloMusicArtist .
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date "1960-12-29"^^xsd:dateTime .
}
]]></query>
</question>

<question id="14" answertype="resource" aggregation="true">
<string lang="en"><![CDATA[
How many bands broke up in 2010?
]]></string>
<string lang="de"><![CDATA[
Wieviele Bands haben sich 2010 aufgelöst?
]]></string>
<string lang="es"><![CDATA[
Cuantas bandas se rompieron en el 2010?
]]></string>
<string lang="it"><![CDATA[
Quanti gruppi musicali si sono separati nel 2010?
]]></string>
<string lang="fr"><![CDATA[
Quels groupes ont été dissous en 2010?
]]></string>
<string lang="nl"><![CDATA[
Hoeveel bands zijn gestopt in 2010?
]]></string>
<keywords lang="en"><![CDATA[ 
number of bands, end date, 2010
]]></keywords>
<keywords lang="de"><![CDATA[
Anzahl Bands, Enddatum, 2010
]]></keywords>
<keywords lang="es"><![CDATA[ 
bandas, fecha de ruptura, 2010
]]></keywords>
<keywords lang="it"><![CDATA[ 
numero di gruppi musicali, data di separazione, 2010
]]></keywords>
<keywords lang="fr"><![CDATA[ 
groupes, dissous, 2010?
]]></keywords>
<keywords lang="nl"><![CDATA[ 
aantal bands, gestopt, 2010
]]></keywords>
<query><![CDATA[
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?artist)
WHERE {
  ?artist rdf:type mo:MusicGroup .
  ?artist bio:event ?event .
  ?event rdf:type bio:Death .
  { ?event bio:date ?date .
    FILTER ( ?date <= "2010-12-31"^^xsd:date && ?date >= "2010-01-01"^^xsd:date ) 
  }
  UNION 
  { ?event bio:date ?date .
    FILTER regex (?date,"2010")
  }
}
]]></query>
</question>

<question id="15" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me all albums with the BBC Symphony Orchestra.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Alben mit dem BBC Symphony Orchestra.
]]></string>
<string lang="es"><![CDATA[
Dame todos los álbumes con la BBC Symphony Orchestra
]]></string>
<string lang="it"><![CDATA[
Dammi tutti gli album della BBC Symphony Orchestra.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi les albums de l'Orchestre symphonique de la BBC. 
]]></string>
<string lang="nl"><![CDATA[
Noem alle albums waarop het BBC Symphony Orchestra meespeelt.
]]></string>
<keywords lang="en"><![CDATA[ 
BBC Symphony Orchestra, album
]]></keywords>
<keywords lang="de"><![CDATA[
BBC Symphony Orchestra, Album
]]></keywords>
<keywords lang="es"><![CDATA[ 
álbumes, BBC Symphony Orchestra
]]></keywords>
<keywords lang="it"><![CDATA[ 
BBC Symphony Orchestra, album
]]></keywords>
<keywords lang="fr"><![CDATA[ 
albums, Orchestre symphonique de la BBC
]]></keywords>
<keywords lang="nl"><![CDATA[ 
album, BBC Symphony Orchestra
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:performingOrchestra ?orchestra .
  ?orchestra foaf:name 'BBC Symphony Orchestra' .
}
]]></query>
</question>

<question id="16" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me all bands that Michael Stipe is a member of.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Bands, in denen Michael Stipe Mitglied ist.
]]></string>
<string lang="es"><![CDATA[
Dame todas las bandas en las cuales Michael Stipe es un miembro?
]]></string>
<string lang="it"><![CDATA[
Dammi tutti i gruppi musicali di cui Michael Stipe è membro.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les groupes dont Michael Stipe a été un membre.
]]></string>
<string lang="nl"><![CDATA[
Geef me alle bands waarin Michael Stipe zat.
]]></string>
<keywords lang="en"><![CDATA[ 
Michael Stipe, member, band
]]></keywords>
<keywords lang="de"><![CDATA[
Michael Stipe, Mitglied, Band
]]></keywords>
<keywords lang="es"><![CDATA[ 
bandas, Michael Stipe
]]></keywords>
<keywords lang="it"><![CDATA[ 
Michael Stipe, membro, gruppo musicale
]]></keywords>
<keywords lang="fr"><![CDATA[ 
groupes, Michael Stipe, membre
]]></keywords>
<keywords lang="nl"><![CDATA[ 
band, Michael Stipe, lid
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?band
WHERE { 
 ?artist foaf:name 'Michael Stipe' .
 ?artist mo:member_of ?band .
}
]]></query>
</question>

<question id="17" answertype="number" aggregation="true">
<string lang="en"><![CDATA[
How many albums did Amy Macdonald release?
]]></string>
<string lang="de"><![CDATA[
Wieviele Alben hat Amy Macdonald herausgebracht?
]]></string>
<string lang="es"><![CDATA[
Cuantos álbumes ha estrado Amy MacDonald?
]]></string>
<string lang="it"><![CDATA[
Quanti album ha rilasciato Amy Macdonald?
]]></string>
<string lang="fr"><![CDATA[
Combien d'albums ont été créés par Amy Macdonald?
]]></string>
<string lang="nl"><![CDATA[
Hoeveel albums heeft Amy Macdonald uitgebracht?
]]></string>
<keywords lang="en"><![CDATA[ 
Amy Macdonald, number of albums
]]></keywords>
<keywords lang="de"><![CDATA[
Amy Macdonald, Anzahl Alben
]]></keywords>
<keywords lang="es"><![CDATA[ 
álbumes, Amy MacDonald
]]></keywords>
<keywords lang="it"><![CDATA[ 
Amy Macdonald, numero di album
]]></keywords>
<keywords lang="fr"><![CDATA[ 
nombre d'albums, Amy Macdonald
]]></keywords>
<keywords lang="nl"><![CDATA[ 
aantal albums, Amy Macdonald
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?album)
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:album .
  ?album dc:title ?albumtitle .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Amy Macdonald' .
}
]]></query>
</question>

<question id="18" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me all live albums by Michael Jackson.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Live-Alben von Michael Jackson.
]]></string>
<string lang="es"><![CDATA[
Dame todos los  álbumes en directo de Michael Jackson.
]]></string>
<string lang="it"><![CDATA[
Dammi tutti gli album live di Michael Jackson.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les albums live de Michael Jackson.
]]></string>
<string lang="nl"><![CDATA[
Noem alle live-albums van Michael Jackson.
]]></string>
<keywords lang="en"><![CDATA[ 
Michael Jackson, live album
]]></keywords>
<keywords lang="de"><![CDATA[
Michael Jackson, Live-Album
]]></keywords>
<keywords lang="es"><![CDATA[ 
álbumes en directo, Michael Jackson
]]></keywords>
<keywords lang="it"><![CDATA[ 
Michael Jackson, album live
]]></keywords>
<keywords lang="fr"><![CDATA[ 
albums live, Michael Jackson
]]></keywords>
<keywords lang="nl"><![CDATA[ 
live-album, Michael Jackson
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album
WHERE {
  ?album rdf:type mo:Record . 
  ?album mo:release_type mo:live .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Michael Jackson' .
}
]]></query>
</question>

<question id="19" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Who produced the album In Utero?
]]></string>
<string lang="de"><![CDATA[
Wer hat das Album In Utero produziert?
]]></string>
<string lang="es"><![CDATA[
Quien produjo el álbum In Utero?
]]></string>
<string lang="it"><![CDATA[
Chi ha prodotto l'album In Utero?
]]></string>
<string lang="fr"><![CDATA[
Qui a produit l'album In Utero?
]]></string>
<string lang="nl"><![CDATA[
Wie produceerde het album In Utero?
]]></string>
<keywords lang="en"><![CDATA[ 
album, In Utero, producer
]]></keywords>
<keywords lang="de"><![CDATA[
Album, In Utero, Produzent
]]></keywords>
<keywords lang="es"><![CDATA[ 
autor, álbum, In Utero
]]></keywords>
<keywords lang="it"><![CDATA[ 
album, In Utero, produttore
]]></keywords>
<keywords lang="fr"><![CDATA[ 
produit, album, In Utero
]]></keywords>
<keywords lang="nl"><![CDATA[ 
producent, In Utero
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?producer
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:album .
  ?album dc:title 'In Utero' .
  ?album mo:producer ?producer .
}
]]></query>
</question>

<question id="20" answertype="number" aggregation="false">
<string lang="en"><![CDATA[
How long is the song Hardcore Kids?
]]></string>
<string lang="de"><![CDATA[
Wie lang ist das Lied Hardcore Kids?
]]></string>
<string lang="es"><![CDATA[
Cual es la duración de la canción Hardcore Kids?
]]></string>
<string lang="it"><![CDATA[
Quanto dura la canzone Hardcore Kids?
]]></string>
<string lang="fr"><![CDATA[
Quelle est la durée du morceau Hardcore Kids?
]]></string>
<string lang="nl"><![CDATA[
Hoe lang duurt het nummer Hardcore Kids?
]]></string>
<keywords lang="en"><![CDATA[ 
song, Hardcore Kids, length
]]></keywords>
<keywords lang="de"><![CDATA[
Lied, Hardcore Kids, Länge
]]></keywords>
<keywords lang="es"><![CDATA[ 
duración, canción Hardcore Kids
]]></keywords>
<keywords lang="it"><![CDATA[ 
canzone, Hardcore Kids, durata
]]></keywords>
<keywords lang="fr"><![CDATA[ 
durée, morceau, Hardcore Kids
]]></keywords>
<keywords lang="nl"><![CDATA[ 
lengte, nummer, Hardcore Kids
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?duration
WHERE {
  ?track rdf:type mo:Track . 
  ?track dc:title 'Hardcore Kids' .
  ?track tl:duration ?duration .
}
]]></query>
</question>

<question id="21" answertype="date" aggregation="false">
<string lang="en"><![CDATA[
When did Dave Grohl join Nirvana?
]]></string>
<string lang="de"><![CDATA[
Wann ist Dave Grohl zu Nirvana gekommen?
]]></string>
<string lang="es"><![CDATA[
Cuando se unió Dave Grohl a Nirvana?
]]></string>
<string lang="it"><![CDATA[
Quando Dave Grohl si è unito ai Nirvana?
]]></string>
<string lang="fr"><![CDATA[
Quand rejoignit Dave Grohl Nirvana?
]]></string>
<string lang="nl"><![CDATA[
Wanneer trad Dave Grohl toe tot Nirvana?
]]></string>
<keywords lang="en"><![CDATA[ 
Dave Grohl, Nirvana, begin date
]]></keywords>
<keywords lang="de"><![CDATA[
Davel Grohl, Nirvana, Startdatum
]]></keywords>
<keywords lang="es"><![CDATA[ 
Dave Grohl, inicio, Nirvana
]]></keywords>
<keywords lang="it"><![CDATA[ 
Dave Grohl, Nirvana, data d'inizio
]]></keywords>
<keywords lang="fr"><![CDATA[ 
rejoignit, Dave Grohl, Nirvana
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Dave Grohl, Nirvana, toetredingsdatum
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX event: <http://purl.org/NET/c4dm/event.owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?begindate
WHERE {
  ?artist foaf:name 'Dave Grohl' .
  ?band foaf:name 'Nirvana' .
  ?event rdf:type mo:membership .
  ?event event:agent ?artist .
  ?event mo:group ?band .
  ?event event:time ?time .
  ?time tl:start ?begindate .
}
]]></query>
</question>

<question id="22" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me all songs by Aretha Franklin.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Lieder von Aretha Franklin.
]]></string>
<string lang="es"><![CDATA[
Dame todas las canciones de Aretha Franklin
]]></string>
<string lang="it"><![CDATA[
Dammi tutte le canzoni di Aretha Franklin.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les morceaux d'Aretha Franklin.
]]></string>
<string lang="nl"><![CDATA[
Noem alle songs van Aretha Franklin.
]]></string>
<keywords lang="en"><![CDATA[ 
Aretha Franklin, song
]]></keywords>
<keywords lang="de"><![CDATA[
Aretha Franklin, Lied
]]></keywords>
<keywords lang="es"><![CDATA[ 
canciones, Aretha Franklin
]]></keywords>
<keywords lang="it"><![CDATA[ 
Aretha Franklin, canzoni
]]></keywords>
<keywords lang="fr"><![CDATA[ 
morceaux, Aretha Franklin
]]></keywords>
<keywords lang="nl"><![CDATA[ 
song, Aretha Franklin
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?track
WHERE {
  ?artist foaf:name 'Aretha Franklin' .
  ?track foaf:maker ?artist .
  ?track rdf:type mo:Track .
}
]]></query>
</question>

<question id="23" answertype="date" aggregation="false">
<string lang="en"><![CDATA[
Since when does Millencolin exist?
]]></string>
<string lang="de"><![CDATA[
Seit wann gibt es Millencolin?
]]></string>
<string lang="es"><![CDATA[
Desde cuando existe el Millencolin?
]]></string>
<string lang="it"><![CDATA[
Da quando esistono i Millencolin?
]]></string>
<string lang="fr"><![CDATA[
Depuis quand existe Millencolin?
]]></string>
<string lang="nl"><![CDATA[
Sinds wanneer bestaat Millencolin?
]]></string>
<keywords lang="en"><![CDATA[ 
Millencolin, begin date
]]></keywords>
<keywords lang="de"><![CDATA[
Millencolin, Startdatum
]]></keywords>
<keywords lang="es"><![CDATA[ 
Millencolin, fecha de inicio
]]></keywords>
<keywords lang="it"><![CDATA[ 
Millencolin, data d'inizio
]]></keywords>
<keywords lang="fr"><![CDATA[ 
data d'existence, Millencolin
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Millencolin, datum, oprichting
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Millencolin'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}
]]></query>
</question>

<question id="24" answertype="number" aggregation="true">
<string lang="en"><![CDATA[
How many members does the band Trio have?
]]></string>
<string lang="de"><![CDATA[
Wieviele Mitglieder hat die Band Trio?
]]></string>
<string lang="es"><![CDATA[
Cuantos miembros tiene la banda del Trio?
]]></string>
<string lang="it"><![CDATA[
Quanti membri ha il gruppo musicale Trio?
]]></string>
<string lang="fr"><![CDATA[
Combien de membres a le groupe Trio?
]]></string>
<string lang="nl"><![CDATA[
Hoeveel leden heeft de band Trio?
]]></string>
<keywords lang="en"><![CDATA[ 
band, Trio, number of members
]]></keywords>
<keywords lang="de"><![CDATA[
Band, Trio, Anzahl Mitglieder
]]></keywords>
<keywords lang="es"><![CDATA[ 
Banda, Trio, numero de miembros
]]></keywords>
<keywords lang="it"><![CDATA[ 
gruppo musicale, Trio, numero di membri
]]></keywords>
<keywords lang="fr"><![CDATA[ 
nombre de membres, groupe Trio
]]></keywords>
<keywords lang="nl"><![CDATA[ 
aantal leden, band, Trio
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?member)
WHERE {
    ?band foaf:name 'Trio' .
    ?band rdf:type mo:MusicGroup .
    ?member mo:member_of ?band .
}
]]></query>
</question>

