<?xml version="1.0" ?>
<dataset id="musicbrainz-train">
<question aggregation="false" answertype="date" id="26">
<string lang="en"><![CDATA[When was Elvis Presley born?]]></string>
<string lang="de"><![CDATA[Wann wurde Elvis Presley geboren?]]></string>
<string lang="es"><![CDATA[Cuando nació Elvis Presley?]]></string>
<string lang="it"><![CDATA[Quando è nato Elvis Presley?]]></string>
<string lang="fr"><![CDATA[Quand est né Elvis Presley?]]></string>
<string lang="nl"><![CDATA[Wat is de geboortedatum van Elvis Presley?]]></string>
<keywords lang="en"><![CDATA[Elvis Presley, birth date]]></keywords>
<keywords lang="de"><![CDATA[Elvis Presley, Geburtstag]]></keywords>
<keywords lang="es"><![CDATA[fecha de nacimiento, Elvis Presley]]></keywords>
<keywords lang="it"><![CDATA[Elvis Presley, data di nascita]]></keywords>
<keywords lang="fr"><![CDATA[date de naissance, Elvis Presley]]></keywords>
<keywords lang="nl"><![CDATA[geboortedatum, Elvis Presley]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Elvis Presley'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}]]></query>
<answers>
<answer>
<date>1935-01-08</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="94">
<string lang="en"><![CDATA[Give me all audiobooks by Paul Auster.]]></string>
<string lang="de"><![CDATA[Gib mir alle Hörbücher von Paul Auster.]]></string>
<string lang="es"><![CDATA[Dame todos los audiolibros de Paul Auster]]></string>
<string lang="it"><![CDATA[Dammi tutti gli audiolibri di Paul Auster.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les livres audios de Paul Auster.]]></string>
<string lang="nl"><![CDATA[Noem alle luisterboeken van Paul Auster.]]></string>
<keywords lang="en"><![CDATA[audiobook, Paul Auster]]></keywords>
<keywords lang="de"><![CDATA[Hörbuch, Paul Auster]]></keywords>
<keywords lang="es"><![CDATA[audiolibros, Paul Auster]]></keywords>
<keywords lang="it"><![CDATA[audiolibri, Paul Auster]]></keywords>
<keywords lang="fr"><![CDATA[livres audios, Paul Auster]]></keywords>
<keywords lang="nl"><![CDATA[luisterboek, Paul Auster]]></keywords>
<query><![CDATA[PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:audiobook .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Paul Auster' .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/d8395a70-6221-411a-8714-446093ced543</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/b3635198-90ea-4362-ace0-e6c921bcf021</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/a4e86ccf-803f-4131-861c-11f11b713bc6</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/e00843d3-71ad-401b-8a25-3f882a44474f</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/a06ea28b-2f0d-487f-be61-6c7b472d2c53</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/870ea4f9-ca03-4392-857f-c78251da5fcb</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="90">
<string lang="en"><![CDATA[Did Kurt Cobain have children?]]></string>
<string lang="de"><![CDATA[Hatte Kurt Cobain Kinder?]]></string>
<string lang="es"><![CDATA[Tuvo hijos Kurt Cobain?]]></string>
<string lang="it"><![CDATA[Kurt Cobain aveva figli?]]></string>
<string lang="fr"><![CDATA[Kurt Cobain avait-il des enfants?]]></string>
<string lang="nl"><![CDATA[Had Kurt Cobain kinderen?]]></string>
<keywords lang="en"><![CDATA[Kurt Cobain, child]]></keywords>
<keywords lang="de"><![CDATA[Kurt Cobain, Kind]]></keywords>
<keywords lang="es"><![CDATA[Kurt Cobain, hijos]]></keywords>
<keywords lang="it"><![CDATA[Kurt Cobain, figli]]></keywords>
<keywords lang="fr"><![CDATA[Kurt Cobain, enfants]]></keywords>
<keywords lang="nl"><![CDATA[Kurt Cobain, kind]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
ASK
WHERE {
  ?artist rel:parentOf ?child .
  ?child foaf:name ?name .
  ?artist foaf:name 'Kurt Cobain' .
}]]></query>
<answers>
<answer>
<boolean>false</boolean>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="75">
<string lang="en"><![CDATA[How many members does the largest group have?]]></string>
<string lang="de"><![CDATA[Wieviele Mitglieder hat die größte Gruppe?]]></string>
<string lang="es"><![CDATA[Cuantos miembros tiene el grupo más largo?]]></string>
<string lang="it"><![CDATA[Quanti membri ha il gruppo più grande?]]></string>
<string lang="fr"><![CDATA[Combien de membres a le groupe le plus large?]]></string>
<string lang="nl"><![CDATA[Hoeveel leden heeft de grootste band?]]></string>
<keywords lang="en"><![CDATA[group, number of members, maximum]]></keywords>
<keywords lang="de"><![CDATA[Gruppe, Anzahl Mitglieder, Maximum]]></keywords>
<keywords lang="es"><![CDATA[miembros, grupo más largo]]></keywords>
<keywords lang="it"><![CDATA[gruppo, numero dei membri massimo]]></keywords>
<keywords lang="fr"><![CDATA[groupe, nombre de membres, maximum]]></keywords>
<keywords lang="nl"><![CDATA[band, aantal leden, maximum]]></keywords>
<query><![CDATA[PREFIX mo: <http://purl.org/ontology/mo/>
SELECT COUNT(?artist) AS ?number
WHERE {
  ?artist mo:member_of ?band .
}
GROUP BY ?band
ORDER BY DESC(?number) 
LIMIT 1]]></query>
<answers>
<answer>
<number>199</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="53">
<string lang="en"><![CDATA[Are there any interviews with J.R.R. Tolkien?]]></string>
<string lang="de"><![CDATA[Gibt es Interviews mit J.R.R. Tolkien?]]></string>
<string lang="es"><![CDATA[Existen entrevistas con J.R.R.  Tolkien?]]></string>
<string lang="it"><![CDATA[Ci sono interviste a J.R.R. Tolkien?]]></string>
<string lang="fr"><![CDATA[Existe-t-il des interviews de J.R.R. Tolkien?]]></string>
<string lang="nl"><![CDATA[Bestaan er interviews met J.R.R. Tolkien?]]></string>
<keywords lang="en"><![CDATA[interview, J.R.R. Tolkien]]></keywords>
<keywords lang="de"><![CDATA[Interview, J.R.R. Tolkien]]></keywords>
<keywords lang="es"><![CDATA[entrevistas, J.R.R.  Tolkien]]></keywords>
<keywords lang="it"><![CDATA[intervista, J.R.R. Tolkien]]></keywords>
<keywords lang="fr"><![CDATA[interviews, J.R.R. Tolkien]]></keywords>
<keywords lang="nl"><![CDATA[interview, J.R.R. Tolkien]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
ASK 
WHERE {
  ?album mo:release_type mo:interview .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'J.R.R. Tolkien' .
}]]></query>
<answers>
<answer>
<boolean>true</boolean>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="32">
<string lang="en"><![CDATA[Which solo artists died on the same day as Elvis?]]></string>
<string lang="de"><![CDATA[Welche Solokünstler starben am selben Tag wie Elvis?]]></string>
<string lang="es"><![CDATA[Que solistas murieron en el mismo día que Elvis?]]></string>
<string lang="it"><![CDATA[Quale solista mori lo stesso giorni di Elvis?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Welke solo-artiesten stierven op dezelfde dag als Elvis?]]></string>
<keywords lang="en"><![CDATA[solo artist, death date, same as, Elvis, death date]]></keywords>
<keywords lang="de"><![CDATA[Solokünstler, Todesdatum, gleich, Elvis, Todesdatum]]></keywords>
<keywords lang="es"><![CDATA[solistas, fecha de defunción, igual , Elvis]]></keywords>
<keywords lang="it"><![CDATA[solista, data di morte, uguale a, Elvis, data di morte]]></keywords>
<keywords lang="fr"><![CDATA[artistes solos, date décès, même, Elvis Presley]]></keywords>
<keywords lang="nl"><![CDATA[solo-artiest, sterfdatum, identiek, Elvis]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist
WHERE {
  ?elvis foaf:name 'Elvis Presley' .
  ?elvis bio:event ?event .
  ?event rdf:type bio:Death .
  ?event bio:date ?date . 
  ?artist rdf:type mo:SoloMusicArtist .
  ?artist bio:event ?event_2 .
  ?event_2 rdf:type bio:Death .
  ?event_2 bio:date ?date .
  FILTER (!sameTerm(?artist,?elvis))
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/f7eac709-a950-4a63-8d8d-c2eea5da804a</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="87">
<string lang="en"><![CDATA[Are there any live albums by the Beatles?]]></string>
<string lang="de"><![CDATA[Gibt es Live-Alben von den Beatles?]]></string>
<string lang="es"><![CDATA[Existen álbumes en directo de los Beatles]]></string>
<string lang="it"><![CDATA[Ci sono album live dei Beatles?]]></string>
<string lang="fr"><![CDATA[Existe-t-il des albums lives des Beatles?]]></string>
<string lang="nl"><![CDATA[Bestaan er live-albums van The Beatles?]]></string>
<keywords lang="en"><![CDATA[live album, The Beatles]]></keywords>
<keywords lang="de"><![CDATA[Live-Album, The Beatles]]></keywords>
<keywords lang="es"><![CDATA[álbumes en directo, Beatles]]></keywords>
<keywords lang="it"><![CDATA[album live, The Beatles]]></keywords>
<keywords lang="fr"><![CDATA[albums lives, Beatles]]></keywords>
<keywords lang="nl"><![CDATA[live-album, The Beatles]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:live .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'The Beatles' .
}]]></query>
<answers>
<answer>
<boolean>true</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="31">
<string lang="en"><![CDATA[When did Pete Best leave The Beatles?]]></string>
<string lang="de"><![CDATA[Wann hat Pete Best die Beatles verlassen?]]></string>
<string lang="es"><![CDATA[Cuando dejo Pete Best los Beatles?]]></string>
<string lang="it"><![CDATA[Quando Pete Best ha lasciato i Beatles?]]></string>
<string lang="fr"><![CDATA[Quand a Pete Best quitté les Beatles?]]></string>
<string lang="nl"><![CDATA[Wanneer verliet Pete Best The Beatles?]]></string>
<keywords lang="en"><![CDATA[Pete Best, The Beatles, end date]]></keywords>
<keywords lang="de"><![CDATA[Pete Best, The Beatles, Enddatum]]></keywords>
<keywords lang="es"><![CDATA[Pete Best, Beatles, dejo]]></keywords>
<keywords lang="it"><![CDATA[Pete Best, Beatles, data di fine]]></keywords>
<keywords lang="fr"><![CDATA[Pete Best, quitté, Beatles]]></keywords>
<keywords lang="nl"><![CDATA[Pete Best, The Beatles, verliet, datum]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX event: <http://purl.org/NET/c4dm/event.owl#>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Pete Best' .
  ?event rdf:type mo:membership .
  ?event event:agent ?artist .
  ?event mo:group ?band .
  ?band foaf:name 'The Beatles' .
  ?event event:time ?time .
  ?time tl:end ?date .
}]]></query>
<answers>
<answer>
<date>1962-08-16</date>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="24">
<string lang="en"><![CDATA[How many members does the band Trio have?]]></string>
<string lang="de"><![CDATA[Wieviele Mitglieder hat die Band Trio?]]></string>
<string lang="es"><![CDATA[Cuantos miembros tiene la banda del Trio?]]></string>
<string lang="it"><![CDATA[Quanti membri ha il gruppo musicale Trio?]]></string>
<string lang="fr"><![CDATA[Combien de membres a le groupe Trio?]]></string>
<string lang="nl"><![CDATA[Hoeveel leden heeft de band Trio?]]></string>
<keywords lang="en"><![CDATA[band, Trio, number of members]]></keywords>
<keywords lang="de"><![CDATA[Band, Trio, Anzahl Mitglieder]]></keywords>
<keywords lang="es"><![CDATA[Banda, Trio, numero de miembros]]></keywords>
<keywords lang="it"><![CDATA[gruppo musicale, Trio, numero di membri]]></keywords>
<keywords lang="fr"><![CDATA[nombre de membres, groupe Trio]]></keywords>
<keywords lang="nl"><![CDATA[aantal leden, band, Trio]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?member)
WHERE {
    ?band foaf:name 'Trio' .
    ?band rdf:type mo:MusicGroup .
    ?member mo:member_of ?band .
}]]></query>
<answers>
<answer>
<number>3</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="2">
<string lang="en"><![CDATA[Which groups was David Bowie a member of?]]></string>
<string lang="de"><![CDATA[In welchen Bands war David Bowie?]]></string>
<string lang="es"><![CDATA[En que grupos fue miembro David Bownie?]]></string>
<string lang="it"><![CDATA[Di quali gruppi David Bowie è stato membro?]]></string>
<string lang="fr"><![CDATA[De quel groupe David Bowie était-il un membre?]]></string>
<string lang="nl"><![CDATA[Van welke bands was David Bowie lid?]]></string>
<keywords lang="en"><![CDATA[David Bowie, member, group]]></keywords>
<keywords lang="de"><![CDATA[David Bowie, Band]]></keywords>
<keywords lang="es"><![CDATA[grupos, David Bowie]]></keywords>
<keywords lang="it"><![CDATA[David Bowie, membro, gruppo]]></keywords>
<keywords lang="fr"><![CDATA[groupe, David Bowie, membre]]></keywords>
<keywords lang="nl"><![CDATA[band, David Bowie]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?band
WHERE {
  ?artist foaf:name 'David Bowie' .
  ?artist mo:member_of ?band .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/39dfc059-93b1-41a1-af27-3a753c0711d3</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/14797449-01d5-431b-9649-ec071c9ac410</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/03beedf4-babe-4a7e-82d9-4e5883164812</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/9f132fea-c047-4b5c-a7a3-4996812ce0d0</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/1e18f529-2965-494e-be50-4b2a023148d4</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/732ede83-aa0b-4ea3-a9cd-579b3ddf98f0</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="7">
<string lang="en"><![CDATA[Give me the present members of The Cure.]]></string>
<string lang="de"><![CDATA[Gib mir die aktuellen Mitglieder von The Cure.]]></string>
<string lang="es"><![CDATA[Dame todos los miembros actuales de The Cure]]></string>
<string lang="it"><![CDATA[Dammi i membri attuali dei The Cure.]]></string>
<string lang="fr"><![CDATA[Donnes-moi la formation actuelle de The Cure.]]></string>
<string lang="nl"><![CDATA[Geef de huidige leden van The Cure.]]></string>
<keywords lang="en"><![CDATA[The Cure, member, present]]></keywords>
<keywords lang="de"><![CDATA[The Cure, Mitglieder, aktuell]]></keywords>
<keywords lang="es"><![CDATA[The cure, miembros actuales]]></keywords>
<keywords lang="it"><![CDATA[The Cure, membri, attuali]]></keywords>
<keywords lang="fr"><![CDATA[formation actuelle, The Cure]]></keywords>
<keywords lang="nl"><![CDATA[The Cure, huidige leden]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX event: <http://purl.org/NET/c4dm/event.owl#>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?member
WHERE { 
  ?band foaf:name 'The Cure' .
  ?event rdf:type mo:membership .
  ?event event:agent ?member .
  ?event mo:group ?band .
  OPTIONAL {
    ?event event:time ?time .
    ?time tl:end ?enddate .
  }
  FILTER (!bound(?enddate))
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/2b2a7e94-fdc6-4c2e-859c-441faa4089cd</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/48555d10-ded8-4172-a737-33bffc0125d5</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/7d1a1624-784b-4f89-8ff9-b9b493cd059d</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/e83e045f-2191-4ccd-b8ba-7d93852b6f9b</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="17">
<string lang="en"><![CDATA[How many albums did Amy Macdonald release?]]></string>
<string lang="de"><![CDATA[Wieviele Alben hat Amy Macdonald herausgebracht?]]></string>
<string lang="es"><![CDATA[Cuantos álbumes ha estrado Amy MacDonald?]]></string>
<string lang="it"><![CDATA[Quanti album ha rilasciato Amy Macdonald?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Hoeveel albums heeft Amy Macdonald uitgebracht?]]></string>
<keywords lang="en"><![CDATA[Amy Macdonald, number of albums]]></keywords>
<keywords lang="de"><![CDATA[Amy Macdonald, Anzahl Alben]]></keywords>
<keywords lang="es"><![CDATA[álbumes, Amy MacDonald]]></keywords>
<keywords lang="it"><![CDATA[Amy Macdonald, numero di album]]></keywords>
<keywords lang="fr"><![CDATA[]]></keywords>
<keywords lang="nl"><![CDATA[aantal albums, Amy Macdonald]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?album)
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:album .
  ?album dc:title ?albumtitle .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Amy Macdonald' .
}]]></query>
<answers>
<answer>
<number>10</number>
</answer>
</answers>
</question>
<question aggregation="true" answertype="boolean" id="83">
<string lang="en"><![CDATA[Was John Lennon married?]]></string>
<string lang="de"><![CDATA[War John Lennon verheiratet?]]></string>
<string lang="es"><![CDATA[Estaba John Lennon casado?]]></string>
<string lang="it"><![CDATA[John Lennon era sposato?]]></string>
<string lang="fr"><![CDATA[John Lennon était-il marié?]]></string>
<string lang="nl"><![CDATA[Was John Lennon getrouwd?]]></string>
<keywords lang="en"><![CDATA[John Lennon, married]]></keywords>
<keywords lang="de"><![CDATA[John Lennon, verheiratet]]></keywords>
<keywords lang="es"><![CDATA[John Lennon, casado]]></keywords>
<keywords lang="it"><![CDATA[John Lennon, sposato]]></keywords>
<keywords lang="fr"><![CDATA[John Lennon, marié]]></keywords>
<keywords lang="nl"><![CDATA[John Lennon, getrouwd]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
ASK
WHERE {
  ?artist foaf:name 'John Lennon' .
  ?artist rel:spouseOf ?spouse .
  FILTER (BOUND(?spouse))
}]]></query>
<answers>
<answer>
<boolean>true</boolean>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="80">
<string lang="en"><![CDATA[How many solo artists were born in 1966?]]></string>
<string lang="de"><![CDATA[Wieviele Solokünstler wurden 1966 geboren?]]></string>
<string lang="es"><![CDATA[Cuantos solistas nacieron en 1996?]]></string>
<string lang="it"><![CDATA[Quanti solisti sono nati nel 1966?]]></string>
<string lang="fr"><![CDATA[Quels aristes solos sont nés en 1966?]]></string>
<string lang="nl"><![CDATA[Hoeveel solo-artiesten zijn geboren in 1966?]]></string>
<keywords lang="en"><![CDATA[number of solo artists, birth date, 1966]]></keywords>
<keywords lang="de"><![CDATA[Anzahl Solokünstler, Geburtstag, 1966]]></keywords>
<keywords lang="es"><![CDATA[solistas, fecha de nacimiento, 1966]]></keywords>
<keywords lang="it"><![CDATA[numero di solisti, data di nascita, 1966]]></keywords>
<keywords lang="fr"><![CDATA[]]></keywords>
<keywords lang="nl"><![CDATA[solo-artiest, geboortejaar, 1966]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?artist)
WHERE {
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  { ?event bio:date ?date .
    FILTER ( ?date <= '1966-12-31'^^xsd:date && ?date >= '1966-01-01'^^xsd:date ) }
  UNION 
  { ?event bio:date ?date .
    FILTER regex(?date,'1966') }
}]]></query>
<answers>
<answer>
<number>859</number>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="66">
<string lang="en"><![CDATA[Which person recorded the most singles?]]></string>
<string lang="de"><![CDATA[Wer hat die meisten Singles aufgenommen?]]></string>
<string lang="es"><![CDATA[Quien ha grabado la mayoría de los singles]]></string>
<string lang="it"><![CDATA[Chi ha composto il maggior numero di singoli?]]></string>
<string lang="fr"><![CDATA[Qui a enregistré les plus de singles?]]></string>
<string lang="nl"><![CDATA[Welke artiest heeft de meeste singles opgenomen?]]></string>
<keywords lang="en"><![CDATA[person, number of singles, maximum]]></keywords>
<keywords lang="de"><![CDATA[Person, Anzahl Singles, Maximum]]></keywords>
<keywords lang="es"><![CDATA[persona, grabado, mayor numero de singles]]></keywords>
<keywords lang="it"><![CDATA[persona, numero di singoli, massimo]]></keywords>
<keywords lang="fr"><![CDATA[enregistré, nombre de singles, maximum]]></keywords>
<keywords lang="nl"><![CDATA[artiest, aantal singles, maximum]]></keywords>
<query><![CDATA[PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT ?artist
WHERE {
  ?artist rdf:type mo:SoloMusicArtist .
  ?album foaf:maker ?artist .
  ?album mo:release_type mo:single .
}
GROUP BY ?artist
ORDER BY DESC(COUNT(?album)) 
LIMIT 1]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/79239441-bfd5-4981-a70c-55c3f15c1287</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="61">
<string lang="en"><![CDATA[Give me all members of The Muppets.]]></string>
<string lang="de"><![CDATA[Gib mir alle Mitglieder der Muppets.]]></string>
<string lang="es"><![CDATA[Dame todos los miembros de los Muppets]]></string>
<string lang="it"><![CDATA[Dammi tutti i membri dei Muppets.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les membres de The Muppets.]]></string>
<string lang="nl"><![CDATA[Noem alle leden van The Muppets.]]></string>
<keywords lang="en"><![CDATA[The Muppets, member]]></keywords>
<keywords lang="de"><![CDATA[The Muppets, Mitglieder]]></keywords>
<keywords lang="es"><![CDATA[miembros, Muppets]]></keywords>
<keywords lang="it"><![CDATA[Muppets, membri]]></keywords>
<keywords lang="fr"><![CDATA[membres, The Muppets]]></keywords>
<keywords lang="nl"><![CDATA[The Muppets, lid]]></keywords>
<query><![CDATA[PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?artist
WHERE {
  ?band foaf:name 'The Muppets' .
  ?artist mo:member_of ?band.
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/992a7ea8-96c1-4058-ba96-f811c8d01c77</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/d49f81bd-7354-4263-86d2-3321273d4d10</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/d6924537-5874-4dea-9749-9c3d83348733</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/b35a762a-1134-43ec-88da-ed67cf5013d2</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/71f88b1f-eac7-416f-bf1a-e76adc755578</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/31cc1360-4424-4c16-a7bd-4a6f780a0bad</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/ca867c70-1f5f-4456-9888-70e97e14cb39</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/7321c1f0-20ef-4eb9-b271-c13dcb5712a5</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="54">
<string lang="en"><![CDATA[How many bands are called Queen?]]></string>
<string lang="de"><![CDATA[Wieviele Bands heißen Queen?]]></string>
<string lang="es"><![CDATA[Cuantas bandas se llaman Queen?]]></string>
<string lang="it"><![CDATA[Quanti gruppi musicali si chiamano Queen?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Hoeveel bands heten Queen?]]></string>
<keywords lang="en"><![CDATA[number of bands, name, Queen]]></keywords>
<keywords lang="de"><![CDATA[Anzahl Bands, Name, Queen]]></keywords>
<keywords lang="es"><![CDATA[bandas, llamadas, Queen]]></keywords>
<keywords lang="it"><![CDATA[numero di gruppi musicali, Queen]]></keywords>
<keywords lang="fr"><![CDATA[nombre de groupes, Queen]]></keywords>
<keywords lang="nl"><![CDATA[aantal bands, naam, Queen]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?artist) 
WHERE {
  ?artist rdf:type mo:MusicGroup .
  ?artist foaf:name 'Queen' .
}]]></query>
<answers>
<answer>
<number>1</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="boolean" id="74">
<string lang="en"><![CDATA[Are there bootleg recordings by Pink Floyd?]]></string>
<string lang="de"><![CDATA[Gibt es Bootleg-Aufnahmen von Pink Floyd?]]></string>
<string lang="es"><![CDATA[Cuales son las grabaciones bootleg de Pink Floyd?]]></string>
<string lang="it"><![CDATA[Ci sono incisioni bootleg dei Pink Floyd?]]></string>
<string lang="fr"><![CDATA[Existe-t-il des bootlegs de Pink Floyd?]]></string>
<string lang="nl"><![CDATA[Bestaan er bootleg-opnamen van Pink Floyd?]]></string>
<keywords lang="en"><![CDATA[bootleg recording, Pink Floyd]]></keywords>
<keywords lang="de"><![CDATA[Bootleg-Aufnahme, Pink Floyd]]></keywords>
<keywords lang="es"><![CDATA[grabaciones bootleg, Pink Floyd]]></keywords>
<keywords lang="it"><![CDATA[incisioni bootleg, Pink Floyd]]></keywords>
<keywords lang="fr"><![CDATA[bootlegs, Pink Floyd]]></keywords>
<keywords lang="nl"><![CDATA[bootleg, Pink Floyd]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK 
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_status mo:bootleg .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Pink Floyd' .
}]]></query>
<answers>
<answer>
<boolean>true</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="21">
<string lang="en"><![CDATA[When did Dave Grohl join Nirvana?]]></string>
<string lang="de"><![CDATA[Wann ist Dave Grohl zu Nirvana gekommen?]]></string>
<string lang="es"><![CDATA[Cuando se unió Dave Grohl a Nirvana?]]></string>
<string lang="it"><![CDATA[Quando Dave Grohl si è unito ai Nirvana?]]></string>
<string lang="fr"><![CDATA[Quand rejoignit Dave Grohl Nirvana?]]></string>
<string lang="nl"><![CDATA[Wanneer trad Dave Grohl toe tot Nirvana?]]></string>
<keywords lang="en"><![CDATA[Dave Grohl, Nirvana, begin date]]></keywords>
<keywords lang="de"><![CDATA[Davel Grohl, Nirvana, Startdatum]]></keywords>
<keywords lang="es"><![CDATA[Dave Grohl, inicio, Nirvana]]></keywords>
<keywords lang="it"><![CDATA[]]></keywords>
<keywords lang="fr"><![CDATA[rejoignit, Dave Grohl, Nirvana]]></keywords>
<keywords lang="nl"><![CDATA[Dave Grohl, Nirvana, toetredingsdatum]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX event: <http://purl.org/NET/c4dm/event.owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?begindate
WHERE {
  ?artist foaf:name 'Dave Grohl' .
  ?band foaf:name 'Nirvana' .
  ?event rdf:type mo:membership .
  ?event event:agent ?artist .
  ?event mo:group ?band .
  ?event event:time ?time .
  ?time tl:start ?begindate .
}]]></query>
<answers>
<answer>
<date>1990-09-24</date>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="6">
<string lang="en"><![CDATA[Which solo artists had their 50th birthday on May 30, 2012?]]></string>
<string lang="de"><![CDATA[Welche Solokünstler hatten am 30. Mai 2012 ihren 50. Geburtstag?]]></string>
<string lang="es"><![CDATA[Que solitas cumplen su 50 cumpleaños en el 30 de Mayo del 2012?]]></string>
<string lang="it"><![CDATA[Quale solista ebbe in suo cinquantesimo compleanno il 30 maggio 2012?]]></string>
<string lang="fr"><![CDATA[Quels artistes solos ont eu 50 ans le 30 Mai 2012?]]></string>
<string lang="nl"><![CDATA[Welke solo-artiesten werden op 30 mei 2012 50?]]></string>
<keywords lang="en"><![CDATA[solo artist, 50th birthday, 2012-05-30]]></keywords>
<keywords lang="de"><![CDATA[Solokünstler, 50. Geburtstag, 2012-05-30]]></keywords>
<keywords lang="es"><![CDATA[solitas, 50 cumpleaños, 2012-05-30]]></keywords>
<keywords lang="it"><![CDATA[solista, cinquantesimo compleanno, 2012-05-30]]></keywords>
<keywords lang="fr"><![CDATA[artistes solos, 50 ans, 30 Mai 2012]]></keywords>
<keywords lang="nl"><![CDATA[solo-artiest, 50 jaar, 2012-05-30]]></keywords>
<query><![CDATA[PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist
WHERE {
  ?artist rdf:type mo:SoloMusicArtist .
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date 1962-05-30^^xsd:dateTime .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/2f654b0b-b1a7-4834-bed4-fd4883774611</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="93">
<string lang="en"><![CDATA[Who created the single The Girl Is Mine?]]></string>
<string lang="de"><![CDATA[Von wem ist die Single The Girl Is Mine?]]></string>
<string lang="es"><![CDATA[Quien ha creado el single The Girl is mine?]]></string>
<string lang="it"><![CDATA[Chi ha creato il singolo The Girl Is Mine?]]></string>
<string lang="fr"><![CDATA[Qui a créé le single The Girl Is Mine?]]></string>
<string lang="nl"><![CDATA[Van wie is de single The Girl Is Mine?]]></string>
<keywords lang="en"><![CDATA[single, The Girl Is Mine, creator]]></keywords>
<keywords lang="de"><![CDATA[Single, The Girl Is Mine, Urheber]]></keywords>
<keywords lang="es"><![CDATA[creador, single Girl is Mine]]></keywords>
<keywords lang="it"><![CDATA[singolo, The Girl Is Mine, creatore]]></keywords>
<keywords lang="fr"><![CDATA[créateur, single, The Girl Is Mine]]></keywords>
<keywords lang="nl"><![CDATA[single, The Girl Is Mine, artiest]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?artist
WHERE {
  ?album mo:release_type mo:single .
  ?album dc:title 'The Girl Is Mine' .
  ?album foaf:maker ?artist .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/6d1a1ef7-beda-400c-9da3-8761e7ecd3e3</uri>
</answer>
</answers>
</question>
