<?xml version="1.0" encoding="UTF-8"?>
<dataset id="musicbrainz-train">

<question id="49" answertype="number" aggregation="true">
<string lang="en"><![CDATA[
For how long was Tina Turner married to Ike Turner?
]]></string>
<string lang="de"><![CDATA[
Wie lange war Tina Turner mit Ike Turner verheiratet?
]]></string>
<string lang="es"><![CDATA[
Por cuanto tiempo ha estado Tina Turner casada con Ike Turner
]]></string>
<string lang="it"><![CDATA[
Per quanto tempo Tina Turner è stata sposata con Ike Turner?
]]></string>
<string lang="fr"><![CDATA[
Pour combien de temps Tina Turner était-elle mariée à Ike Turner?
]]></string>
<string lang="nl"><![CDATA[
Hoe lang was Tina Turner met Ike Turner getrouwd?
]]></string>
<keywords lang="en"><![CDATA[ 
Tina Turner, married, Ike Turner, duration
]]></keywords>
<keywords lang="de"><![CDATA[
Tina Turner, verheiratet, Ike Turner, Dauer
]]></keywords>
<keywords lang="es"><![CDATA[ 
Tina Turner, duración matrimonio, Ike Turner
]]></keywords>
<keywords lang="it"><![CDATA[ 
Tina Turner, sposata, Ike Turner, durata
]]></keywords>
<keywords lang="fr"><![CDATA[ 
Tina Turner, mariée, Ike Turner, durée
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Tina Turner, getrouwd, Ike Turner, lengte
]]></keywords>
<query><![CDATA[
OUT OF SCOPE
]]></query>
</question>

<question id="50" answertype="string" aggregation="false">
<string lang="en"><![CDATA[
Give me the names of the children of John Lennon.
]]></string>
<string lang="de"><![CDATA[
Gib mir die Namen der Kinder von John Lennon.
]]></string>
<string lang="es"><![CDATA[
Dame los nombres de todos los hijos de John Lennon
]]></string>
<string lang="it"><![CDATA[
Dammi i nomi dei figli di John Lennon.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi les noms des enfants de John Lennon.
]]></string>
<string lang="nl"><![CDATA[
Geef de namen van de kinderen van John Lennon.
]]></string>
<keywords lang="en"><![CDATA[ 
name, child, John Lennon
]]></keywords>
<keywords lang="de"><![CDATA[
Name, Kind, John Lennon
]]></keywords>
<keywords lang="es"><![CDATA[ 
nombre, hijos, John Lennon
]]></keywords>
<keywords lang="it"><![CDATA[ 
nome, figlio, John Lennon
]]></keywords>
<keywords lang="fr"><![CDATA[ 
noms, enfants, John Lennon
]]></keywords>
<keywords lang="nl"><![CDATA[ 
naam, kind, John Lennon
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?name
WHERE {
  ?artist foaf:name 'John Lennon' .
  ?artist rel:parentOf ?child .
  ?child foaf:name ?name .
}
]]></query>
</question>

<question id="53" answertype="boolean" aggregation="false">
<string lang="en"><![CDATA[
Are there any interviews with J.R.R. Tolkien?
]]></string>
<string lang="de"><![CDATA[
Gibt es Interviews mit J.R.R. Tolkien?
]]></string>
<string lang="es"><![CDATA[
Existen entrevistas con J.R.R.  Tolkien?
]]></string>
<string lang="it"><![CDATA[
Ci sono interviste a J.R.R. Tolkien?
]]></string>
<string lang="fr"><![CDATA[
Existe-t-il des interviews de J.R.R. Tolkien?
]]></string>
<string lang="nl"><![CDATA[
Bestaan er interviews met J.R.R. Tolkien?
]]></string>
<keywords lang="en"><![CDATA[ 
interview, J.R.R. Tolkien
]]></keywords>
<keywords lang="de"><![CDATA[
Interview, J.R.R. Tolkien
]]></keywords>
<keywords lang="es"><![CDATA[ 
entrevistas, J.R.R.  Tolkien
]]></keywords>
<keywords lang="it"><![CDATA[ 
intervista, J.R.R. Tolkien
]]></keywords>
<keywords lang="fr"><![CDATA[ 
interviews, J.R.R. Tolkien
]]></keywords>
<keywords lang="nl"><![CDATA[ 
interview, J.R.R. Tolkien
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
ASK 
WHERE {
  ?album mo:release_type mo:interview .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'J.R.R. Tolkien' .
}
]]></query>
</question>

<question id="55" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Who performed the song Over the Rainbow?
]]></string>
<string lang="de"><![CDATA[
Wer hat das Lied Over the Rainbow gesungen?
]]></string>
<string lang="es"><![CDATA[
Quien ha cantado la canción Over the Rainbow?
]]></string>
<string lang="it"><![CDATA[
Chi ha cantato la canzone Over the Rainbow?
]]></string>
<string lang="fr"><![CDATA[
Qui a chanté le morceau Over the Rainbow?
]]></string>
<string lang="nl"><![CDATA[
Wie zong het nummer Over the Rainbow?
]]></string>
<keywords lang="en"><![CDATA[ 
song, Over the Rainbow, performer
]]></keywords>
<keywords lang="de"><![CDATA[
Lied, Over the Rainbow, Sänger
]]></keywords>
<keywords lang="es"><![CDATA[ 
cantante, Over the Rainbow
]]></keywords>
<keywords lang="it"><![CDATA[ 
canzone, Over the Rainbow, cantante
]]></keywords>
<keywords lang="fr"><![CDATA[ 
chanté, morceau, Over the Rainbow
]]></keywords>
<keywords lang="nl"><![CDATA[ 
nummer, Over the Rainbow, artiest
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist
WHERE {
  ?track rdf:type mo:Track .
  ?track dc:title 'Over the Rainbow' .
  ?track foaf:maker ?artist .
}
]]></query>
</question>

<question id="56" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me all songs on the album Abbey Road.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Lieder von dem Album Abbey Road.
]]></string>
<string lang="es"><![CDATA[
Dame todas las canciones del álbum Abbey Road
]]></string>
<string lang="it"><![CDATA[
Dammi tutte le canzoni dell'album Abbey Road.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les morceaux de l'album Abbey Road.
]]></string>
<string lang="nl"><![CDATA[
Geef alle nummers van het album Abbey Road.
]]></string>
<keywords lang="en"><![CDATA[ 
Abbey Road, song
]]></keywords>
<keywords lang="de"><![CDATA[
Abbey Road, Lied
]]></keywords>
<keywords lang="es"><![CDATA[ 
canciones ,  álbum Abbey Road
]]></keywords>
<keywords lang="it"><![CDATA[ 
Abbey Road, canzoni
]]></keywords>
<keywords lang="fr"><![CDATA[ 
morceaux, Abbey Road
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Abbey Road, nummer
]]></keywords>
<query><![CDATA[
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?track 
WHERE {
  ?album mo:release_type mo:album .
  ?album dc:title 'Abbey Road' .
  ?album mo:track ?track .
}
]]></query>
</question>

<question id="61" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me all members of The Muppets.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Mitglieder der Muppets.
]]></string>
<string lang="es"><![CDATA[
Dame todos los miembros de los Muppets
]]></string>
<string lang="it"><![CDATA[
Dammi tutti i membri dei Muppets.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les membres de The Muppets.
]]></string>
<string lang="nl"><![CDATA[
Noem alle leden van The Muppets.
]]></string>
<keywords lang="en"><![CDATA[ 
The Muppets, member
]]></keywords>
<keywords lang="de"><![CDATA[
The Muppets, Mitglieder
]]></keywords>
<keywords lang="es"><![CDATA[ 
miembros, Muppets
]]></keywords>
<keywords lang="it"><![CDATA[ 
Muppets, membri
]]></keywords>
<keywords lang="fr"><![CDATA[ 
membres, The Muppets
]]></keywords>
<keywords lang="nl"><![CDATA[ 
The Muppets, lid
]]></keywords>
<query><![CDATA[
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?artist
WHERE {
  ?band foaf:name 'The Muppets' .
  ?artist mo:member_of ?band.
}
]]></query>
</question>
 
<question id="62" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me all siblings of Michael Jackson.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Geschwister von Michael Jackson.
]]></string>
<string lang="es"><![CDATA[
Dame todos los hermanos de Michael Jackson
]]></string>
<string lang="it"><![CDATA[
Dammi tutti i fratelli e le sorelle di Michael Jackson.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les frères et soeurs de Michael Jackson.
]]></string>
<string lang="nl"><![CDATA[
Geef alle broers en zusters van Michael Jackson.
]]></string>
<keywords lang="en"><![CDATA[ 
Michael Jackson, sibling
]]></keywords>
<keywords lang="de"><![CDATA[
Michael Jackson, Geschwister
]]></keywords>
<keywords lang="es"><![CDATA[ 
hermanos, Michael Jackson
]]></keywords>
<keywords lang="it"><![CDATA[ 
Michael Jackson, fratelli e sorelle
]]></keywords>
<keywords lang="fr"><![CDATA[ 
frères et soeurs, Michael Jackson
]]></keywords>
<keywords lang="nl"><![CDATA[ 
broer of zuster, Michael Jackson
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist
WHERE {
  ?mj foaf:name 'Michael Jackson' .
  ?artist rel:siblingOf ?mj .
}
]]></query>
</question>  
  
<question id="64" answertype="number" aggregation="true">
<string lang="en"><![CDATA[
How many audiobooks by Tolkien are there?
]]></string>
<string lang="de"><![CDATA[
Wieviele Hörbücher von Tolkien gibt es?
]]></string>
<string lang="es"><![CDATA[
Cuantos audiolibros existen de Tolkien
]]></string>
<string lang="it"><![CDATA[
Quanti audiolibri di Tolkien esistono?
]]></string>
<string lang="fr"><![CDATA[
Combien de livres audios de Tolkien existe-t-il?
]]></string>
<string lang="nl"><![CDATA[
Hoeveel luisterboeken van Tolkien zijn er?
]]></string>
<keywords lang="en"><![CDATA[ 
number of audiobooks, Tolkien
]]></keywords>
<keywords lang="de"><![CDATA[
Anzahl Hörbücher, Tolkien
]]></keywords>
<keywords lang="es"><![CDATA[ 
audiolibros, Tolkien
]]></keywords>
<keywords lang="it"><![CDATA[ 
numero di audiolibri, Tolkien
]]></keywords>
<keywords lang="fr"><![CDATA[ 
nombre de livres audios, Tolkien
]]></keywords>
<keywords lang="nl"><![CDATA[ 
aantal luisterboeken, Tolkien
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT COUNT(DISTINCT ?album)
WHERE {
  ?album mo:release_type mo:audiobook .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'J.R.R. Tolkien' .
}
]]></query>
</question>

<question id="65" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me all soundtracks composed by John Williams.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Soundtracks, die von John Williams komponiert wurden.
]]></string>
<string lang="es"><![CDATA[
Dame todas las bandas sonoras compuestas por John Williams
]]></string>
<string lang="it"><![CDATA[
Dammi tutte le colonne sonore composte da John Williams.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi toutes les bandes sons composées par John Williams.
]]></string>
<string lang="nl"><![CDATA[
Geef me alle soundtracks die werden gecomponeerd door John Williams.
]]></string>
<keywords lang="en"><![CDATA[ 
soundtrack, composer, John Williams
]]></keywords>
<keywords lang="de"><![CDATA[
Soundtrack, Komponist, John Williams
]]></keywords>
<keywords lang="es"><![CDATA[ 
bandas sonoras, compositor, John Williams
]]></keywords>
<keywords lang="it"><![CDATA[ 
colonne sonore, compositore, John Williams
]]></keywords>
<keywords lang="fr"><![CDATA[ 
bandes sons, composées, John Williams
]]></keywords>
<keywords lang="nl"><![CDATA[ 
soundtrack, componist, John Williams
]]></keywords>
<query><![CDATA[
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?album
WHERE {
  ?album mo:release_type mo:soundtrack .
  ?album mo:composer ?artist .
  ?artist foaf:name 'John Williams' .
}
]]></query>
</question>

<question id="69" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me all Celldweller EPs.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Celldweller-EPs.
]]></string>
<string lang="es"><![CDATA[
Dame todos los EP de Celldweller
]]></string>
<string lang="it"><![CDATA[
Dammi tutti gli EP dei Celldweller.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi toutes les EP de Celldweller.
]]></string>
<string lang="nl"><![CDATA[
Geef me alle ep's van Celldweller.
]]></string>
<keywords lang="en"><![CDATA[ 
Celldweller, EP
]]></keywords>
<keywords lang="de"><![CDATA[
Celldweller, EP
]]></keywords>
<keywords lang="es"><![CDATA[ 
EP de Celldweller
]]></keywords>
<keywords lang="it"><![CDATA[ 
Celldweller, EP
]]></keywords>
<keywords lang="fr"><![CDATA[ 
EP, Celldweller
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Celldweller, ep
]]></keywords>
<query><![CDATA[
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?album
WHERE {
  ?album mo:release_type mo:ep .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Celldweller' .
}
]]></query>
</question>

<question id="73" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me the spouses of all members of The Beatles.
]]></string>
<string lang="de"><![CDATA[
Gib mir die Ehepartner aller Mitglieder der Beatles.
]]></string>
<string lang="es"><![CDATA[
Dame las esposas de todos los miembros de los Beatles
]]></string>
<string lang="it"><![CDATA[
Dammi le mogli di tutti i membri dei Beatles.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi les épouses de tous les membres des Beatles.
]]></string>
<string lang="nl"><![CDATA[
Noem de echtgenotes van alle leden van The Beatles.
]]></string>
<keywords lang="en"><![CDATA[ 
member, The Beatles, spouse
]]></keywords>
<keywords lang="de"><![CDATA[
Mitglieder, The Beatles, Ehepartner
]]></keywords>
<keywords lang="es"><![CDATA[ 
esposas, miembros, Beatles
]]></keywords>
<keywords lang="it"><![CDATA[ 
membro, The Beatles, moglie
]]></keywords>
<keywords lang="fr"><![CDATA[ 
épouses, membres, Beatles
]]></keywords>
<keywords lang="nl"><![CDATA[ 
echtgenote, lid, The Beatles
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?spouse 
WHERE {
  ?band foaf:name 'The Beatles' .
  ?artist mo:member_of ?band .
  ?artist rel:spouseOf ?spouse .
}
]]></query>
</question>

<question id="80" answertype="number" aggregation="true">
<string lang="en"><![CDATA[
How many solo artists were born in 1966?
]]></string>
<string lang="de"><![CDATA[
Wieviele Solokünstler wurden 1966 geboren?
]]></string>
<string lang="es"><![CDATA[
Cuantos solistas nacieron en 1996?
]]></string>
<string lang="it"><![CDATA[
Quanti solisti sono nati nel 1966?
]]></string>
<string lang="fr"><![CDATA[
Quels aristes solos sont nés en 1966?
]]></string>
<string lang="nl"><![CDATA[
Hoeveel solo-artiesten zijn geboren in 1966?
]]></string>
<keywords lang="en"><![CDATA[ 
number of solo artists, birth date, 1966
]]></keywords>
<keywords lang="de"><![CDATA[
Anzahl Solokünstler, Geburtstag, 1966
]]></keywords>
<keywords lang="es"><![CDATA[ 
solistas, fecha de nacimiento, 1966
]]></keywords>
<keywords lang="it"><![CDATA[ 
numero di solisti, data di nascita, 1966
]]></keywords>
<keywords lang="fr"><![CDATA[ 
nombre d'aristes solos, date de naissance, 1966
]]></keywords>
<keywords lang="nl"><![CDATA[ 
solo-artiest, geboortejaar, 1966
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?artist)
WHERE {
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  { ?event bio:date ?date .
    FILTER ( ?date <= '1966-12-31'^^xsd:date && ?date >= '1966-01-01'^^xsd:date ) }
  UNION 
  { ?event bio:date ?date .
    FILTER regex(?date,'1966') }
}
]]></query>
</question>
  
<question id="89" answertype="date" aggregation="false">
<string lang="en"><![CDATA[
When were The Vertigos founded?
]]></string>
<string lang="de"><![CDATA[
Wann wurden The Vertigos gegründet?
]]></string>
<string lang="es"><![CDATA[
Cuando se fundaron los Vertigos?
]]></string>
<string lang="it"><![CDATA[
Quando sono stati fondati i Vertigos?
]]></string>
<string lang="fr"><![CDATA[
Quand a été fondé The Vertigos?
]]></string>
<string lang="nl"><![CDATA[
Wanneer werden The Vertigos opgericht?
]]></string>
<keywords lang="en"><![CDATA[ 
The Vertigos, start date
]]></keywords>
<keywords lang="de"><![CDATA[
The Vertigos, Startdatum
]]></keywords>
<keywords lang="es"><![CDATA[ 
fundaron, Vertigos
]]></keywords>
<keywords lang="it"><![CDATA[ 
The Vertigos, data di inizio
]]></keywords>
<keywords lang="fr"><![CDATA[ 
date de fondations, The Vertigos
]]></keywords>
<keywords lang="nl"><![CDATA[ 
The Vertigos, opgericht, datum
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'The Vertigos'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}
]]></query>
</question>

<question id="92" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me the collaborations of Shakira.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Künstler, mit denen Shakira zusammengearbeitet hat.
]]></string>
<string lang="es"><![CDATA[
Dame todos los colaboradores de Shakira
]]></string>
<string lang="it"><![CDATA[
Dammi tutti gli artisti con cui Shakira ha collaborato.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi toutes les collaborations de Shakira.
]]></string>
<string lang="nl"><![CDATA[
Geef me alle artiesten waarmee Shakira heeft samengewerkt.
]]></string>
<keywords lang="en"><![CDATA[ 
Shakira, collaboration
]]></keywords>
<keywords lang="de"><![CDATA[
Shakira, Kollaboration
]]></keywords>
<keywords lang="es"><![CDATA[ 
Shakira, colaboradores
]]></keywords>
<keywords lang="it"><![CDATA[ 
Shakira, collaborazione
]]></keywords>
<keywords lang="fr"><![CDATA[ 
collaborations, Shakira
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Shakira, samenwerken, artiest
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist
WHERE {
  ?shakira foaf:name 'Shakira'  .
  ?shakira rel:collaboratesWith ?artist .
}
]]></query>
</question>
 
<question id="94" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Give me all audiobooks by Paul Auster.
]]></string>
<string lang="de"><![CDATA[
Gib mir alle Hörbücher von Paul Auster.
]]></string>
<string lang="es"><![CDATA[
Dame todos los audiolibros de Paul Auster
]]></string>
<string lang="it"><![CDATA[
Dammi tutti gli audiolibri di Paul Auster.
]]></string>
<string lang="fr"><![CDATA[
Donnes-moi tous les livres audios de Paul Auster.
]]></string>
<string lang="nl"><![CDATA[
Noem alle luisterboeken van Paul Auster.
]]></string>
<keywords lang="en"><![CDATA[ 
audiobook, Paul Auster
]]></keywords>
<keywords lang="de"><![CDATA[
Hörbuch, Paul Auster
]]></keywords>
<keywords lang="es"><![CDATA[ 
audiolibros, Paul Auster
]]></keywords>
<keywords lang="it"><![CDATA[ 
audiolibri, Paul Auster
]]></keywords>
<keywords lang="fr"><![CDATA[ 
livres audios, Paul Auster
]]></keywords>
<keywords lang="nl"><![CDATA[ 
luisterboek, Paul Auster
]]></keywords>
<query><![CDATA[
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:release_type mo:audiobook .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Paul Auster' .
}
]]></query>
</question>
  
<question id="97" answertype="resource" aggregation="true">
<string lang="en"><![CDATA[
Which Beatles were married more than once?
]]></string>
<string lang="de"><![CDATA[
Welche Beatles waren mehr als einmal verheiratet?
]]></string>
<string lang="es"><![CDATA[
Que Beatles se han casado más de una vez?
]]></string>
<string lang="it"><![CDATA[
Quali Beatles sono stati sposati più di una volta?
]]></string>
<string lang="fr"><![CDATA[
Quels Beatles se sont mariés plus d'une fois?
]]></string>
<string lang="nl"><![CDATA[
Welke Beatles waren meer dan één keer getrouwd?
]]></string>
<keywords lang="en"><![CDATA[ 
The Beatles, member, number of spouses, greater than 1
]]></keywords>
<keywords lang="de"><![CDATA[
The Beatles, Mitglied, Anzahl Ehepartner, größer als 1
]]></keywords>
<keywords lang="es"><![CDATA[ 
Beatles, casado, más una vez
]]></keywords>
<keywords lang="it"><![CDATA[ 
Beatles, membro, numero di mogli, maggiore di 1
]]></keywords>
<keywords lang="fr"><![CDATA[ 
Beatles, membre, nombre de marriage, plus d'une fois
]]></keywords>
<keywords lang="nl"><![CDATA[ 
The Beatles, lid, aantal echtgenotes, meer dan 1
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist
WHERE {
  ?band foaf:name 'The Beatles' .
  ?artist mo:member_of ?band .
  ?artist rel:spouseOf ?spouse .
} 
GROUP BY ?artist
HAVING (COUNT(?spouse) > 1)
]]></query>
</question>

<question id="98" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[
Show me all live albums by Nat King Cole.
]]></string>
<string lang="de"><![CDATA[
Zeige mir alle Live-Alben von Nat King Cole.
]]></string>
<string lang="es"><![CDATA[
Dame todos los álbumes en directo de Nat King Cole
]]></string>
<string lang="it"><![CDATA[
Mostrami tutti gli album live di Nat King Cole.
]]></string>
<string lang="fr"><![CDATA[
Montres-moi tous les albums live de Nat King Cole.
]]></string>
<string lang="nl"><![CDATA[
Toon alle live-albums van Nat King Cole.
]]></string>
<keywords lang="en"><![CDATA[ 
live album, Nat King Cole
]]></keywords>
<keywords lang="de"><![CDATA[
Live-Album, Nat King Cole
]]></keywords>
<keywords lang="es"><![CDATA[ 
álbumes en directo, Nat King Cole
]]></keywords>
<keywords lang="it"><![CDATA[ 
album live, Nat King Cole
]]></keywords>
<keywords lang="fr"><![CDATA[ 
albums live, Nat King Cole
]]></keywords>
<keywords lang="nl"><![CDATA[ 
live-album, Nat King Cole
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album
WHERE {
  ?album rdf:type mo:Record . 
  ?album mo:release_type mo:live .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Nat King Cole' .
}
]]></query>
</question>

<question id="100" answertype="date" aggregation="false">
<string lang="en"><![CDATA[
Since when does Scattered Earth exist?
]]></string>
<string lang="de"><![CDATA[
Seit wann gibt es Scattered Earth?
]]></string>
<string lang="es"><![CDATA[
Desde cuando existe Scattered Earth?
]]></string>
<string lang="it"><![CDATA[
Da quando esistono gli Scattered Earth?
]]></string>
<string lang="fr"><![CDATA[
Depuis quand existe Scattered Earth?
]]></string>
<string lang="nl"><![CDATA[
Sinds wanneer bestaat Scattered Earth?
]]></string>
<keywords lang="en"><![CDATA[ 
Scattered Earth, start date
]]></keywords>
<keywords lang="de"><![CDATA[
Scattered Earth, Startdatum
]]></keywords>
<keywords lang="es"><![CDATA[ 
fecha de inicio, Scattered Earth
]]></keywords>
<keywords lang="it"><![CDATA[ 
Scattered Earth, data di inizio
]]></keywords>
<keywords lang="fr"><![CDATA[ 
Scattered Earth, date de création
]]></keywords>
<keywords lang="nl"><![CDATA[ 
Scattered Earth, oprichting, datum
]]></keywords>
<query><![CDATA[
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Scattered Earth'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}
]]></query>
</question>  

</dataset>

