<?xml version="1.0" ?>
<dataset id="musicbrainz-train">
<question aggregation="true" answertype="resource" id="39">
<string lang="en"><![CDATA[Give me all former members of the Berliner Philharmoniker.]]></string>
<string lang="de"><![CDATA[Gib mir alle ehemaligen Mitglieder der Berliner Philharmoniker.]]></string>
<string lang="es"><![CDATA[Dame todos los miembros anteriores de la Filarmónica de Berlin]]></string>
<string lang="it"><![CDATA[Dammi tutti i membri precedenti della Berliner Philharmoniker.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les membres passés de la Philharmonie de Berlin.]]></string>
<string lang="nl"><![CDATA[Noem alle voormalige leden van de Berliner Philharmoniker.]]></string>
<keywords lang="en"><![CDATA[Berliner Philharmoniker, former member]]></keywords>
<keywords lang="de"><![CDATA[Berliner Philharmoniker, ehemalige Mitglieder]]></keywords>
<keywords lang="es"><![CDATA[miembros anteriores , Filarmónica de Berlin]]></keywords>
<keywords lang="it"><![CDATA[Berliner Philharmoniker, membri precedenti]]></keywords>
<keywords lang="fr"><![CDATA[membres, passés, Philharmonie de Berlin.]]></keywords>
<keywords lang="nl"><![CDATA[voormalig lid, Berliner Philharmoniker]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX event: <http://purl.org/NET/c4dm/event.owl#>
PREFIX tl: <http://purl.org/NET/c4dm/timeline.owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?member
WHERE { 
  ?orchestra foaf:name 'Berliner Philharmoniker' .
  ?event rdf:type mo:membership .
  ?event event:agent ?member .
  ?event mo:group ?orchestra .
  ?event event:time ?time .
  ?time tl:end ?enddate .
  FILTER (bound(?enddate))
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/0d1af11b-9236-4cc4-8141-9ece7a495756</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/65a44f13-d63e-4516-a094-f3a5307e877f</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/6afe0f78-8e90-4539-b562-dfae433d41f2</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/84045b93-beb0-4bc8-a855-93266ec6bbdc</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/87b816f9-749b-42b2-9670-5d3a503bd9e9</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/baa8f822-fc5e-49bb-92cb-df7a65071e8e</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/d34f1593-36d4-42ad-8b56-fa9f2ea129c2</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/e4669b9c-b321-4586-b18f-6f84724a6d4a</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="resource" id="76">
<string lang="en"><![CDATA[Which rock album has the most tracks?]]></string>
<string lang="de"><![CDATA[Welches Rockalbum hat die meisten Lieder?]]></string>
<string lang="es"><![CDATA[Que álbum de rock tiene el mayor numero de canciones?]]></string>
<string lang="it"><![CDATA[Quale album rock ha il maggior numero di tracce?]]></string>
<string lang="fr"><![CDATA[Quel album de rock a le plus de pistes?]]></string>
<string lang="nl"><![CDATA[Welk rock-album bevat de meeste nummers?]]></string>
<keywords lang="en"><![CDATA[album, rock, number of tracks, maximum]]></keywords>
<keywords lang="de"><![CDATA[Rockalbum, Anzahl Lieder, Maximum]]></keywords>
<keywords lang="es"><![CDATA[álbum rock,mayor numero canciones]]></keywords>
<keywords lang="it"><![CDATA[album, rock, numero di tracce, massimo]]></keywords>
<keywords lang="fr"><![CDATA[album de rock, nombre de pistes, maximum]]></keywords>
<keywords lang="nl"><![CDATA[rock-album, aantal nummers, maximum]]></keywords>
<query><![CDATA[PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT ?album
WHERE {
  ?album mo:release_type mo:album .
  ?album dc:description 'rock' .
  ?album mo:track ?track .
}
GROUP BY ?album
ORDER BY DESC(COUNT(?track))
LIMIT 1]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/97e3b3ff-7927-4966-a379-b304982f2425</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="15">
<string lang="en"><![CDATA[Give me all albums with the BBC Symphony Orchestra.]]></string>
<string lang="de"><![CDATA[Gib mir alle Alben mit dem BBC Symphony Orchestra.]]></string>
<string lang="es"><![CDATA[Dame todos los álbumes con la BBC Symphony Orchestra]]></string>
<string lang="it"><![CDATA[Dammi tutti gli album della BBC Symphony Orchestra.]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Noem alle albums waarop het BBC Symphony Orchestra meespeelt.]]></string>
<keywords lang="en"><![CDATA[BBC Symphony Orchestra, album]]></keywords>
<keywords lang="de"><![CDATA[BBC Symphony Orchestra, Album]]></keywords>
<keywords lang="es"><![CDATA[álbumes, BBC Symphony Orchestra]]></keywords>
<keywords lang="it"><![CDATA[BBC Symphony Orchestra, album]]></keywords>
<keywords lang="fr"><![CDATA[albums, Orchestre symphonique de la BBC]]></keywords>
<keywords lang="nl"><![CDATA[album, BBC Symphony Orchestra]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album
WHERE {
  ?album rdf:type mo:Record .
  ?album mo:performingOrchestra ?orchestra .
  ?orchestra foaf:name 'BBC Symphony Orchestra' .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/63f82ef6-1ce9-4ea0-9c3d-a9de4640016c</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/4bc8b3da-9cc8-48e6-bfab-1ec94626e0d4</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/02cbf72c-8b93-4e3c-86ee-a6e7ea586296</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/3e559fdd-0bc1-452a-90f6-ae71fb600d83</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/578da6d4-a5fc-4255-85e9-0a124f07f93f</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/18a7aa23-6656-4e39-8ef7-c3a3a4f7ddaf</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/e9cad5e7-4f41-4b7a-83f3-60554a0a8614</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/e6b43d6f-6c32-4a12-b93f-2e6680b82082</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/c7f1341d-874e-4533-a0bb-5abe77abcb6d</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/a2988172-5ede-41b9-bf04-5259b9bc613d</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/5dcc5017-3fbd-457e-9326-31fce3f63905</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/a478a8a3-5c3e-4fc7-b201-04531cb84a83</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/c8b9f993-c476-4ec7-947c-35cebe4f314c</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/43da5103-3b0e-41b9-9a4e-9fedc05621c4</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/3f4f58cf-56e5-48a0-9488-3c2b09a5a1ae</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/b2558e90-0506-4d8c-82b5-2ae9e29a7a71</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/24cf9b07-2f9e-4589-96ce-906f778dafc7</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="boolean" id="48">
<string lang="en"><![CDATA[Did the Sex Pistols already break up?]]></string>
<string lang="de"><![CDATA[Haben sich die Sex Pistols schon aufgelöst?]]></string>
<string lang="es"><![CDATA[Se han separado los Sex Pistols?]]></string>
<string lang="it"><![CDATA[I Sex Pistols si sono già separati?]]></string>
<string lang="fr"><![CDATA[Les Sex Pistols sont-ils dissous?]]></string>
<string lang="nl"><![CDATA[Zijn de Sex Pistols al uit elkaar?]]></string>
<keywords lang="en"><![CDATA[Sex Pistols, exists, end date]]></keywords>
<keywords lang="de"><![CDATA[Sex Pistols, existiert, Enddatum]]></keywords>
<keywords lang="es"><![CDATA[Sex Pistols, existe fecha de separación]]></keywords>
<keywords lang="it"><![CDATA[Sex Pistols, eistere, data di fine]]></keywords>
<keywords lang="fr"><![CDATA[Sex Pistols, existe, date de dissolution]]></keywords>
<keywords lang="nl"><![CDATA[Sex Pistols, bestaat, einde]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK 
WHERE {
  ?artist foaf:name 'Sex Pistols'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Death .
  FILTER (bound(?event))
}]]></query>
<answers>
<answer>
<boolean>true</boolean>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="29">
<string lang="en"><![CDATA[Give me all people who were members of The Beatles.]]></string>
<string lang="de"><![CDATA[Gib mir alle Personen, die jemals bei den Beatles waren.]]></string>
<string lang="es"><![CDATA[Dame todos los miembros de los Beatles]]></string>
<string lang="it"><![CDATA[Dammi tutte le persone che sono state membri dei Beatles.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les personnes qui ont été membres des Beatles.]]></string>
<string lang="nl"><![CDATA[Noem alle personen die ooit lid van The Beatles waren.]]></string>
<keywords lang="en"><![CDATA[member, The Beatles]]></keywords>
<keywords lang="de"><![CDATA[Mitglied, The Beatles]]></keywords>
<keywords lang="es"><![CDATA[miembros, Beatles]]></keywords>
<keywords lang="it"><![CDATA[membro, Beatles]]></keywords>
<keywords lang="fr"><![CDATA[membres, Beatles]]></keywords>
<keywords lang="nl"><![CDATA[lid, The Beatles]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?artist
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Beatles' .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/4d5447d7-c61c-4120-ba1b-d7f471d385b9</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/ba550d0e-adac-4864-b88b-407cab5e76af</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/42a8f507-8412-4611-854f-926571049fa0</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/0d4ab0f9-bbda-4ab1-ae2c-f772ffcfbea9</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/49a51491-650e-44b3-8085-2f07ac2986dd</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/300c4c73-33ac-4255-9d57-4e32627f5e13</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="77">
<string lang="en"><![CDATA[When was the daughter of Elvis Presley born?]]></string>
<string lang="de"><![CDATA[Wann wurde die Tochter von Elvis Presley geboren?]]></string>
<string lang="es"><![CDATA[Cuando nació la hija de Elvis Presley?]]></string>
<string lang="it"><![CDATA[Quando è nata la figlia di Elvis Presley?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Wanneer werd de dochter van Elvis Presley geboren?]]></string>
<keywords lang="en"><![CDATA[Elvis Presley, daughter, birth date]]></keywords>
<keywords lang="de"><![CDATA[Elvis Presley, Tochter, Geburtstag]]></keywords>
<keywords lang="es"><![CDATA[fecha de nacimiento, hija, Elvis Presley]]></keywords>
<keywords lang="it"><![CDATA[Elvis Presley, figlia, data di nascita]]></keywords>
<keywords lang="fr"><![CDATA[date de naissance, fille, Elvis Presley]]></keywords>
<keywords lang="nl"><![CDATA[Elvis Presley, dochter, geboortedatum]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Elvis Presley' .
  ?artist rel:parentOf ?child .
  ?child bio:event ?event .
  ?event rdf:type bio:Birth .
  ?event bio:date ?date .
}]]></query>
<answers>
<answer>
<date>1968-02-01</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="91">
<string lang="en"><![CDATA[Who is the creator of the audiobook The Hobbit?]]></string>
<string lang="de"><![CDATA[Von wem ist das Hörbuch The Hobbit?]]></string>
<string lang="es"><![CDATA[Quien es el creador del audiolibro The Hobbit?]]></string>
<string lang="it"><![CDATA[]]></string>
<string lang="fr"><![CDATA[Qui est le créateur du livre audio The Hobbit?]]></string>
<string lang="nl"><![CDATA[Wie is de maker van het luisterboek The Hobbit?]]></string>
<keywords lang="en"><![CDATA[audiobook, The Hobbit, creator]]></keywords>
<keywords lang="de"><![CDATA[Hörbuch, The Hobbit, Urheber]]></keywords>
<keywords lang="es"><![CDATA[creador, audiolibro The Hobbit]]></keywords>
<keywords lang="it"><![CDATA[audiolibro, The Hobbit, creatore]]></keywords>
<keywords lang="fr"><![CDATA[créateur, livre audio, The Hobbit]]></keywords>
<keywords lang="nl"><![CDATA[luisterboek, The Hobbit, maker]]></keywords>
<query><![CDATA[PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT DISTINCT ?creator
WHERE {
    ?album mo:release_type mo:audiobook .
    ?album dc:title 'The Hobbit' .
    ?album foaf:maker ?creator . 
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/97f3efea-558f-4137-9e4c-8a2fcec3c2d4</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="41">
<string lang="en"><![CDATA[When did Kurt Cobain die?]]></string>
<string lang="de"><![CDATA[Wann ist Kurt Cobain gestorben?]]></string>
<string lang="es"><![CDATA[Cuando murió Kurt Cobain]]></string>
<string lang="it"><![CDATA[Quando mori Kurt Cobain?]]></string>
<string lang="fr"><![CDATA[Quand est mort Kurt Cobain?]]></string>
<string lang="nl"><![CDATA[Wanneer overleed Kurt Cobain?]]></string>
<keywords lang="en"><![CDATA[Kurt Cobain, death date]]></keywords>
<keywords lang="de"><![CDATA[Kurt Cobain, Todesdatum]]></keywords>
<keywords lang="es"><![CDATA[fecha de defunción, Kurt Cobain]]></keywords>
<keywords lang="it"><![CDATA[Kurt Cobain, data di morte]]></keywords>
<keywords lang="fr"><![CDATA[data de décès, Kurt Cobain]]></keywords>
<keywords lang="nl"><![CDATA[Kurt Cobain, sterfdatum]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date
WHERE {
  ?artist foaf:name 'Kurt Cobain'.
  ?artist bio:event ?event .
  ?event rdf:type bio:Death .
  ?event bio:date ?date .
}]]></query>
<answers>
<answer>
<date>1994-04-05</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="date" id="3">
<string lang="en"><![CDATA[When was the band Dover founded?]]></string>
<string lang="de"><![CDATA[Wann wurde die Band Dover gegründet?]]></string>
<string lang="es"><![CDATA[Cuando fue fundada la banda Dover?]]></string>
<string lang="it"><![CDATA[Quando è stata creata la band Dover?]]></string>
<string lang="fr"><![CDATA[Quand a été fondé le groupe Dover?]]></string>
<string lang="nl"><![CDATA[Wanneer is de band Dover opgericht?]]></string>
<keywords lang="en"><![CDATA[Dover, band, founded]]></keywords>
<keywords lang="de"><![CDATA[Dover, Band, gegründet]]></keywords>
<keywords lang="es"><![CDATA[Dover, fecha inicio]]></keywords>
<keywords lang="it"><![CDATA[Dover, band, creare]]></keywords>
<keywords lang="fr"><![CDATA[fondé, groupe, Dover?]]></keywords>
<keywords lang="nl"><![CDATA[band, Dover, opgericht]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX bio: <http://purl.org/vocab/bio/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?date 
WHERE {
    ?artist rdf:type mo:MusicGroup .
    ?artist foaf:name 'Dover'.
    ?artist bio:event ?event .
    ?event rdf:type bio:Birth .
    ?event bio:date ?date .
}]]></query>
<answers>
<answer>
<date>1992-10-04</date>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="98">
<string lang="en"><![CDATA[Show me all live albums by Nat King Cole.]]></string>
<string lang="de"><![CDATA[Zeige mir alle Live-Alben von Nat King Cole.]]></string>
<string lang="es"><![CDATA[Dame todos los álbumes en directo de Nat King Cole]]></string>
<string lang="it"><![CDATA[Mostrami tutti gli album live di Nat King Cole.]]></string>
<string lang="fr"><![CDATA[Montres-moi tous les albums live de Nat King Cole.]]></string>
<string lang="nl"><![CDATA[Toon alle live-albums van Nat King Cole.]]></string>
<keywords lang="en"><![CDATA[live album, Nat King Cole]]></keywords>
<keywords lang="de"><![CDATA[Live-Album, Nat King Cole]]></keywords>
<keywords lang="es"><![CDATA[álbumes en directo, Nat King Cole]]></keywords>
<keywords lang="it"><![CDATA[album live, Nat King Cole]]></keywords>
<keywords lang="fr"><![CDATA[albums live, Nat King Cole]]></keywords>
<keywords lang="nl"><![CDATA[live-album, Nat King Cole]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?album
WHERE {
  ?album rdf:type mo:Record . 
  ?album mo:release_type mo:live .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Nat King Cole' .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/16fdc9e2-1667-49e2-af5b-a72ec6f07507</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/cb5103b7-929a-41a7-8aca-68b008d267d7</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/687d25ad-4065-4e9a-9728-0931c1a4ee39</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/5ac4ea62-6e22-4c01-b339-815d12ff805b</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="68">
<string lang="en"><![CDATA[Who wrote the lyrics for West Side Story?]]></string>
<string lang="de"><![CDATA[Wer schrieb die Texte für West Side Story?]]></string>
<string lang="es"><![CDATA[Quien escribió la letra de West Side Story?]]></string>
<string lang="it"><![CDATA[Chi ha scritto il testo di West Side Story?]]></string>
<string lang="fr"><![CDATA[Qui a écrit le texte de West Side Story?]]></string>
<string lang="nl"><![CDATA[Wie schreef de tekst voor West Side Story?]]></string>
<keywords lang="en"><![CDATA[lyrics, West Side Story, writer]]></keywords>
<keywords lang="de"><![CDATA[Texte, West Side Story, Urheber]]></keywords>
<keywords lang="es"><![CDATA[escritor, letra, West Side Story]]></keywords>
<keywords lang="it"><![CDATA[testo, West Side Story, scrittore]]></keywords>
<keywords lang="fr"><![CDATA[auteur, West Side Story]]></keywords>
<keywords lang="nl"><![CDATA[West Side Story, tekstschrijver]]></keywords>
<query><![CDATA[PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?artist
WHERE {
  ?album dc:title 'West Side Story' .
  ?album mo:lyricist ?artist .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/bcd6af9f-afa8-43fd-b1be-acbbbb2f7dc7</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="63">
<string lang="en"><![CDATA[Which albums contain interviews with Queen?]]></string>
<string lang="de"><![CDATA[Welchen Alben enthalten Interviews mit Queen?]]></string>
<string lang="es"><![CDATA[Que álbumes contienen entrevistas con Queen?]]></string>
<string lang="it"><![CDATA[Quali album contengono delle interviste con i Queen?]]></string>
<string lang="fr"><![CDATA[Quels albums contiennt des interviews de Queen?]]></string>
<string lang="nl"><![CDATA[Welke albums bevatten interviews met Queen?]]></string>
<keywords lang="en"><![CDATA[album, interview, Queen]]></keywords>
<keywords lang="de"><![CDATA[Album, Interview, Queen]]></keywords>
<keywords lang="es"><![CDATA[álbumes, entrevistas, Queen]]></keywords>
<keywords lang="it"><![CDATA[album, intervista, Queen]]></keywords>
<keywords lang="fr"><![CDATA[albums, interviews, Queen]]></keywords>
<keywords lang="nl"><![CDATA[album, interview, Queen]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?album
WHERE {
  ?album mo:release_type mo:interview .
  ?album foaf:maker ?artist .
  ?artist foaf:name 'Queen' .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/record/8d3022d8-dcae-4cf0-b726-0b81fc06fb9c</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/2a3b5832-e4e1-4187-b6b8-173c8bb204e9</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/2df2cb8d-c98f-4cf3-8f87-4b891e26c1a4</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/abab8fa1-b816-4d76-98d5-1bea0cde56c1</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/1af1de42-a9f2-4568-a121-d48b5dfde0a5</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/137f0a4f-c6dc-439a-844d-fec64891a5c7</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/record/2712e3d9-ee93-4b5e-a002-cfbfa7c8b0f5</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="40">
<string lang="en"><![CDATA[Who created the song Freeway of Love?]]></string>
<string lang="de"><![CDATA[Wer hat das Lied Freeway of Love geschrieben?]]></string>
<string lang="es"><![CDATA[Quien creo la canción Freeway of Love]]></string>
<string lang="it"><![CDATA[Chi ha scritto la canzone Freeway of Love?]]></string>
<string lang="fr"><![CDATA[Qui a composé le morceau Freeway of Love?]]></string>
<string lang="nl"><![CDATA[Wie schreef het nummer Freeway of Love?]]></string>
<keywords lang="en"><![CDATA[song, Freeway of Love, creator]]></keywords>
<keywords lang="de"><![CDATA[Lied, Freeway of Love, Urheber]]></keywords>
<keywords lang="es"><![CDATA[autor, canción, Freeway of Love]]></keywords>
<keywords lang="it"><![CDATA[canzone, Freeway of Love, scrittore]]></keywords>
<keywords lang="fr"><![CDATA[composé, morceau, Freeway of Love]]></keywords>
<keywords lang="nl"><![CDATA[Freeway of Love, componist]]></keywords>
<query><![CDATA[PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?artist
WHERE {
  ?track rdf:type mo:Track .
  ?track dc:title 'Freeway of Love' .
  ?track foaf:maker ?artist .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/2f9ecbed-27be-40e6-abca-6de49d50299e</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="92">
<string lang="en"><![CDATA[Give me the collaborations of Shakira.]]></string>
<string lang="de"><![CDATA[Gib mir alle Künstler, mit denen Shakira zusammengearbeitet hat.]]></string>
<string lang="es"><![CDATA[Dame todos los colaboradores de Shakira]]></string>
<string lang="it"><![CDATA[Dammi tutti gli artisti con cui Shakira ha collaborato.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les collaborations de Shakira.]]></string>
<string lang="nl"><![CDATA[Geef me alle artiesten waarmee Shakira heeft samengewerkt.]]></string>
<keywords lang="en"><![CDATA[Shakira, collaboration]]></keywords>
<keywords lang="de"><![CDATA[Shakira, Kollaboration]]></keywords>
<keywords lang="es"><![CDATA[Shakira, colaboradores]]></keywords>
<keywords lang="it"><![CDATA[Shakira, collaborazione]]></keywords>
<keywords lang="fr"><![CDATA[collaborations, Shakira]]></keywords>
<keywords lang="nl"><![CDATA[Shakira, samenwerken, artiest]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist
WHERE {
  ?shakira foaf:name 'Shakira'  .
  ?shakira rel:collaboratesWith ?artist .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/5e094f6b-3bfb-4248-925b-30b1b4698409</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/ce14c227-cce0-416f-a05f-08f9b114b29f</uri>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="4">
<string lang="en"><![CDATA[How many albums did Michael Jackson record?]]></string>
<string lang="de"><![CDATA[Wieviele Alben hat Michael Jackson aufgenommen?]]></string>
<string lang="es"><![CDATA[Cuantos álbumes ha grabado Michael Jackson?]]></string>
<string lang="it"><![CDATA[Quanti album ha inciso Michael Jackson?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Hoeveel albums heeft Michael Jackson opgenomen?]]></string>
<keywords lang="en"><![CDATA[Michael Jackson, number of albums]]></keywords>
<keywords lang="de"><![CDATA[Michael Jackson, Anzahl Alben]]></keywords>
<keywords lang="es"><![CDATA[Michael Jackson, numero de  álbumes]]></keywords>
<keywords lang="it"><![CDATA[Michael Jackson, numero di album]]></keywords>
<keywords lang="fr"><![CDATA[]]></keywords>
<keywords lang="nl"><![CDATA[Michael Jackson, albums]]></keywords>
<query><![CDATA[PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT COUNT(DISTINCT ?album)
WHERE {
	?album rdf:type mo:Record .
	?album foaf:maker ?artist .
	?artist foaf:name 'Michael Jackson' .
}]]></query>
<answers>
<answer>
<number>202</number>
</answer>
</answers>
</question>
<question aggregation="true" answertype="number" id="27">
<string lang="en"><![CDATA[How many artists are called John Williams?]]></string>
<string lang="de"><![CDATA[Wieviele Künstler heißen John Williams?]]></string>
<string lang="es"><![CDATA[Cuantos artistas se llaman John Williams?]]></string>
<string lang="it"><![CDATA[Quanti artisti si chiamano John Williams?]]></string>
<string lang="fr"><![CDATA[]]></string>
<string lang="nl"><![CDATA[Hoeveel artiesten met de naam John Williams zijn er?]]></string>
<keywords lang="en"><![CDATA[number of artists, name, John Williams]]></keywords>
<keywords lang="de"><![CDATA[Anzahl Künstler, Name, John Williams]]></keywords>
<keywords lang="es"><![CDATA[numero artistas, nombre, John Williams]]></keywords>
<keywords lang="it"><![CDATA[numero di artisti, nome, John Williams]]></keywords>
<keywords lang="fr"><![CDATA[]]></keywords>
<keywords lang="nl"><![CDATA[aantal artiesten, naam, John Williams]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?artist)
WHERE {
  ?artist rdf:type mo:SoloMusicArtist .
  ?artist foaf:name 'John Williams' .
}]]></query>
<answers>
<answer>
<number>13</number>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="47">
<string lang="en"><![CDATA[Who collaborated on Tocotronic vs. Console?]]></string>
<string lang="de"><![CDATA[Wer arbeitete bei Tocotronic vs. Console zusammen?]]></string>
<string lang="es"><![CDATA[Quien ha colaborado en Tocotronic vvs. Console?]]></string>
<string lang="it"><![CDATA[Chi ha collaborato a Tocotronic vs. Console?]]></string>
<string lang="fr"><![CDATA[Qui a collaboré sur Tocotronic vs. Console?]]></string>
<string lang="nl"><![CDATA[Wie werkten samen op Tocotronic vs. Console?]]></string>
<keywords lang="en"><![CDATA[collaborate, Tocotronic vs. Console]]></keywords>
<keywords lang="de"><![CDATA[Zusammenarbeit, Tocotronic vs. Console]]></keywords>
<keywords lang="es"><![CDATA[colaboraciones, Tocotronic vs. Console]]></keywords>
<keywords lang="it"><![CDATA[collaborazione, Tocotronic vs. Console]]></keywords>
<keywords lang="fr"><![CDATA[collaboré, Tocotronic vs. Console]]></keywords>
<keywords lang="nl"><![CDATA[samenwerking, Tocotronic vs. Console]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rel: <http://purl.org/vocab/relationship/>
SELECT DISTINCT ?artist
WHERE {
  ?t_vs_c foaf:name 'Tocotronic vs. Console' .
  ?artist rel:collaboratesWith ?t_vs_c .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/7717539b-33aa-45d5-b88d-9e627172db19</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/ca134505-1fcc-40a3-bef2-4f344b86d1f8</uri>
</answer>
</answers>
</question>
<question aggregation="false" answertype="resource" id="46">
<string lang="en"><![CDATA[List all members of The Notwist.]]></string>
<string lang="de"><![CDATA[Gib mir alle Mitglieder von The Notwist.]]></string>
<string lang="es"><![CDATA[Dame todos los miembros de Notwist]]></string>
<string lang="it"><![CDATA[Elenca tutti i membri dei The Notwist]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les membres de The Notwist.]]></string>
<string lang="nl"><![CDATA[Noem alle leden van de band The Notwist.]]></string>
<keywords lang="en"><![CDATA[The Notwist, member]]></keywords>
<keywords lang="de"><![CDATA[The Notwist, Mitglieder]]></keywords>
<keywords lang="es"><![CDATA[miembros, Notwist]]></keywords>
<keywords lang="it"><![CDATA[The Notwist, membri]]></keywords>
<keywords lang="fr"><![CDATA[membres, The Notwist]]></keywords>
<keywords lang="nl"><![CDATA[The Notwist, band, leden]]></keywords>
<query><![CDATA[PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX mo: <http://purl.org/ontology/mo/>
SELECT DISTINCT ?artist
WHERE {
  ?artist mo:member_of ?band .
  ?band foaf:name 'The Notwist' .
}]]></query>
<answers>
<answer>
<uri>http://zitgist.com/music/artist/ca134505-1fcc-40a3-bef2-4f344b86d1f8</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/cd967b9f-fb7b-4944-aca0-7fc09678407f</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/c4d30869-2366-45ef-8bab-c671aae79d2d</uri>
</answer>
<answer>
<uri>http://zitgist.com/music/artist/0a018360-3bc2-4cca-bb34-406bd5882334</uri>
</answer>
</answers>
</question>
