{
  "dataset" : {
    "id" : "qald-8-train-multilingual"
  },
  "questions" : [ {
    "id" : "1",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "List all the musicals with music by Elton John.",
      "keywords" : "musicals, music by, Elton John"
    }, {
      "language" : "de",
      "string" : "Liste alle Musicals mit Musik von Elton John auf.",
      "keywords" : "Musicals, Musik von, Elton John"
    }, {
      "language" : "es",
      "string" : "Dame todos los musicales con música de Elton John.",
      "keywords" : "musicales, música, Elton John"
    }, {
      "language" : "it",
      "string" : "Elenca tutti i musicals con musiche di Elton John.",
      "keywords" : "musicals, musiche, Elton John"
    }, {
      "language" : "fr",
      "string" : "Donne-moi tous les musicals avec de la musique de de Elton John.",
      "keywords" : "musicals, musique, Elton John"
    }, {
      "language" : "nl",
      "string" : "Toen een lijst van alle musicals met muziek van Elton John.",
      "keywords" : "musicals, muziek van, Elton John"
    }, {
      "language" : "hi_IN",
      "string" : "एल्टन जॉन द्वारा संगीत के साथ सभी संगीतों को सूचीबद्ध करें।",
      "keywords" : "एल्टन जॉन का संगीत"
    }, {
      "language" : "ro",
      "string" : "Listează toate muzicalurile cu muzică de Elton John.",
      "keywords" : "muzicaluri, muzică de Elton John"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Lion_King_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Lion_King_Jr_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Billy_Elliot_the_Musical"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lestat_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Aida_(musical)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "44",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Give me all actors starring in movies directed by William Shatner.",
      "keywords" : "actor, starring, movie, direct, William Shatner"
    }, {
      "language" : "fa",
      "string" : "تمام بازیگرانی که در فیلم های کارگردانی شده توسط ویلیام شاتنر بازی کرده اند را لیست کن.",
      "keywords" : "بازیگرانی، فیلم های، کارگردانی شده، ویلیام شاتنر، بازی کرده اند"
    }, {
      "language" : "de",
      "string" : "Gib mir alle Schauspieler von Filmen, in denen William Shatner Regie geführt hat.",
      "keywords" : "Schauspieler, Film, Regie, William Shatner"
    }, {
      "language" : "es",
      "string" : "Dame todos los actores de películas dirigidas por William Shatner.",
      "keywords" : "actor, película, director, William Shatner"
    }, {
      "language" : "it",
      "string" : "Dammi tutti gli attori che recitano in film diretti da William Shatner.",
      "keywords" : "attore, recitare, film, diretto, William Shatner"
    }, {
      "language" : "fr",
      "string" : "Donnes-moi tous les acteurs qui ont joué dans des films réalisés par Williams Shatner.",
      "keywords" : "acteur, film, réalisé, William Shatner"
    }, {
      "language" : "nl",
      "string" : "Geef alle acteurs van films waar William Shatner de regie van voerde.",
      "keywords" : "acteur, film, regisseur, William Shatner"
    }, {
      "language" : "hi_IN",
      "string" : "विलियम शेटनेर द्वारा निर्देशित फिल्मों में सभी कलाकारों की सूचि दे।",
      "keywords" : "विलियम शेटनेर, निर्देशित फिल्म, कलाकार"
    }, {
      "language" : "ro",
      "string" : "Dă-mi toți actorii care joacă roluri principale în filme regizate de William Shatner.",
      "keywords" : "actor, rol principal, film, regiza, William Shatner"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tom_Towles"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/William_Shatner"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Brenda_Bakke"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/John_Prosky"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/George_Takei"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Duane_Whitaker"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Dick_Van_Patten"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Amy_Acker"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Rickey_Medlocke"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Leonard_Nimoy"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Walter_Koenig"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Dan_Martin_(actor)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/DeForest_Kelley"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chuck_Williams_(actor)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/J.T._Colosa"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/James_Doohan"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Dan_Gauthier"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Nichelle_Nichols"
          }
        } ]
      }
    } ]
  }, {
    "id" : "56",
    "answertype" : "list",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Give me all launch pads operated by NASA.",
      "keywords" : "launch pad, operate, NASA"
    }, {
      "language" : "de",
      "string" : "Gib mir alle von der NASA betriebenen Startrampen.",
      "keywords" : "Startrampe, betreiben, NASA"
    }, {
      "language" : "es",
      "string" : "Dame todas las plataformas de lanzamiento operadas por la NASA.",
      "keywords" : "plataforma de lanzamiento, operada por la NASA"
    }, {
      "language" : "it",
      "string" : "Dammi tutte le rampe di lancio gestite dalla NASA.",
      "keywords" : "rampa di lancio, gestire, NASA"
    }, {
      "language" : "fr",
      "string" : "Donnes-moi toutes les rampes de lancements des Etats-unis.",
      "keywords" : "rampes de lancements, Etats-unis"
    }, {
      "language" : "nl",
      "string" : "Noem alle lanceerplatformen van de NASA.",
      "keywords" : "lanceerplatform, NASA"
    }, {
      "language" : "hi_IN",
      "string" : "मुझे नासा द्वारा संचालित सभी लॉन्च पैड की सूचि दें।",
      "keywords" : "नासा, संचालित, लॉन्च पैड"
    }, {
      "language" : "ro",
      "string" : "Dă-mi toate rampele de lansare operate de către NASA.",
      "keywords" : "rampă de lansare, operat, NASA"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "list" ]
      },
      "results" : {
        "bindings" : [ {
          "list" : {
            "type" : "list",
            "value" : "http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0"
          }
        }, {
          "list" : {
            "type" : "list",
            "value" : "http://dbpedia.org/resource/Keweenaw_Rocket_Range"
          }
        }, {
          "list" : {
            "type" : "list",
            "value" : "http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36"
          }
        }, {
          "list" : {
            "type" : "list",
            "value" : "http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3"
          }
        }, {
          "list" : {
            "type" : "list",
            "value" : "http://dbpedia.org/resource/Broglio_Space_Centre"
          }
        }, {
          "list" : {
            "type" : "list",
            "value" : "http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39"
          }
        }, {
          "list" : {
            "type" : "list",
            "value" : "http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13"
          }
        } ]
      }
    } ]
  }, {
    "id" : "81",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "List the children of Margaret Thatcher.",
      "keywords" : "Margaret Thatcher, child"
    }, {
      "language" : "de",
      "string" : "Liste die Kinder von Margaret Thatcher auf.",
      "keywords" : "Margaret Thatcher, Kind"
    }, {
      "language" : "es",
      "string" : "Dame una lista de los hijos de Margaret Thatcher.",
      "keywords" : "Margaret Thatcher, hijos"
    }, {
      "language" : "it",
      "string" : "Elenca i figli di Margaret Thatcher.",
      "keywords" : "Margaret Thatcher, figlio"
    }, {
      "language" : "fr",
      "string" : "Donnes-moi tous les enfants de Margaret Thatcher.",
      "keywords" : "enfants, Margaret Thatcher"
    }, {
      "language" : "nl",
      "string" : "Noem alle kinderen van Margaret Thatcher.",
      "keywords" : "kinderen, Margaret Thatcher"
    }, {
      "language" : "hi_IN",
      "string" : "मार्गरेट थैचर के बच्चों की सूची बनाएं।",
      "keywords" : "मार्गरेट थैचर, बच्चों"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mark_Thatcher"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Carol_Thatcher"
          }
        } ]
      }
    } ]
  }, {
    "id" : "86",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "List all games by GMT.",
      "keywords" : "game, GMT"
    }, {
      "language" : "de",
      "string" : "Liste alle Spiele von GMT auf.",
      "keywords" : "Spiel, GMT"
    }, {
      "language" : "es",
      "string" : "Dame todos los juegos de GMT.",
      "keywords" : "juegos, GMT"
    }, {
      "language" : "it",
      "string" : "Elenca tutti i giochi di GMT.",
      "keywords" : "gioco, GMT"
    }, {
      "language" : "fr",
      "string" : "Donne-moi tous les jeux de GMT.",
      "keywords" : "jeux, GMT"
    }, {
      "language" : "nl",
      "string" : "Noem alle spelen van GMT.",
      "keywords" : "spel, GMT"
    }, {
      "language" : "hi_IN",
      "string" : "जीएमटी द्वारा सभी खेलों की सूची बनाएं।",
      "keywords" : "जीएमटी, खेल"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Washington's_War"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fields_of_Fire_(game)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Commands_&_Colors:_Ancients"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_World_At_War"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Twilight_Struggle"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sword_of_Rome"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Paths_of_Glory_(board_game)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chandragupta_(board_game)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "124",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Give me all actors starring in Last Action Hero.",
      "keywords" : "actor, starring, Last Action Hero"
    }, {
      "language" : "de",
      "string" : "Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.",
      "keywords" : "Schauspieler, mitspielen, Last Action Hero"
    }, {
      "language" : "es",
      "string" : "Dame todos los actores que hayan actuado en Last Action Hero.",
      "keywords" : "actores, Last Action Hero"
    }, {
      "language" : "it",
      "string" : "Dammi tutti gli attori che hanno recitato in Last Action Hero.",
      "keywords" : "attori, Last Action Hero"
    }, {
      "language" : "fr",
      "string" : "Noem alle acteurs uit de film Last Action Hero.",
      "keywords" : "acteurs, Last Action Hero"
    }, {
      "language" : "nl",
      "string" : "Noem alle acteurs uit de film Last Action Hero.",
      "keywords" : "acteur, Last Action Hero"
    }, {
      "language" : "hi_IN",
      "string" : "मुझे लास्ट एक्शन हीरो में अभिनीत सभी कलाकारों के नाम बतायें दो।",
      "keywords" : "लास्ट एक्शन हीरो, सभी कलाकार, नाम"
    }, {
      "language" : "ro",
      "string" : "Dă-mi toți actorii cu roluri principale în Last Action Hero.",
      "keywords" : "actor, rol principal, Last Action Hero"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tom_Noonan"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/F._Murray_Abraham"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Arnold_Schwarzenegger"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mercedes_Ruehl"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Charles_Dance"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Art_Carney"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Frank_McRae"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Austin_O'Brien"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Robert_Prosky"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Anthony_Quinn"
          }
        } ]
      }
    } ]
  }, {
    "id" : "165",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Show me all books in Asimov's Foundation series.",
      "keywords" : "books, Asimov, Foundation series"
    }, {
      "language" : "fa",
      "string" : "مجموعه کتاب های آسیموف چند کتاب دارد؟",
      "keywords" : "مجموعه کتاب های، آسیموف، کتاب"
    }, {
      "language" : "de",
      "string" : "Zeig mir alle Bücher in Asimovs Foundation-Serie.",
      "keywords" : "Asimov, Foundation-Serie, Bücher"
    }, {
      "language" : "es",
      "string" : "Muéstrame todos los libros en la serie Fundación de Asimov",
      "keywords" : "libros, serie Fundación Asimov"
    }, {
      "language" : "it",
      "string" : "Mostrami tutti i libri del Ciclo della Fondazione di Asimov",
      "keywords" : "libri, Ciclo della Fondazione, Asimov"
    }, {
      "language" : "fr",
      "string" : "Montres-moi tous les livres du Cycle de Fondation d'Asimov.",
      "keywords" : "livres, Cycle de Fondation, Asimov"
    }, {
      "language" : "nl",
      "string" : "Toon alle boeken die bij de Foundation-serie horen.",
      "keywords" : "boeken, Foundation-serie"
    }, {
      "language" : "hi_IN",
      "string" : "असिमोव की फाउंडेशन श्रृंखला की सारी पुस्तकों की सूचि दिखाएं।",
      "keywords" : "असिमोव, फाउंडेशन श्रृंखला, पुस्तकों"
    }, {
      "language" : "ro",
      "string" : "Arată-mi toate cărțile din seria Fundația de Asimov",
      "keywords" : "cărți, seria Fundația, Asimov"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Originist"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Foundation_and_Earth"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Forward_the_Foundation"
          }
        } ]
      }
    } ]
  }, {
    "id" : "172",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Give me all members of Prodigy.",
      "keywords" : "member, Prodigy"
    }, {
      "language" : "fa",
      "string" : "تمام اعضای پرادیجی را لیست کن.",
      "keywords" : "اعضا، پرادیجی"
    }, {
      "language" : "de",
      "string" : "Gib mir alle Bandmitglieder von Prodigy.",
      "keywords" : "Bandmitglied, Prodigy"
    }, {
      "language" : "es",
      "string" : "Dame todos los miembros de la banda Prodigy.",
      "keywords" : "miembros de la banda Prodigy"
    }, {
      "language" : "it",
      "string" : "Dammi tutti i membri dei Prodigy.",
      "keywords" : "membri, Prodigy"
    }, {
      "language" : "fr",
      "string" : "Donne-moi tous les membres de Prodigy.",
      "keywords" : "members, Prodigy"
    }, {
      "language" : "nl",
      "string" : "Noem alle leden van Prodigy.",
      "keywords" : "leden, Prodigy"
    }, {
      "language" : "hi_IN",
      "string" : "मुझे प्रोडिजी के सभी सदस्यों की सूचि बतायें।",
      "keywords" : "प्रोडिजी, सदस्यों"
    }, {
      "language" : "ro",
      "string" : "Dă-mi toții membrii Prodigy.",
      "keywords" : "membru, Prodigy"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Maxim_(musician)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Liam_Howlett"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Keith_Flint"
          }
        } ]
      }
    } ]
  } ]
}